[{"question": "what does albania speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jdx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jdx ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Albania ] )", "golden_entities": {"m.0jdx": "Albania"}, "answer_entities": {"m.012psb": "Romani language", "m.012v8": "Albanian language", "m.01vy26": "Romanian, Macedo Language", "m.0349s": "Greek Language"}}, {"question": "what is shakira 's nationality", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wj18h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wj18h ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Shakira ] )", "golden_entities": {"m.01wj18h": "Shakira"}, "answer_entities": {"m.01ls2": "Colombia"}}, {"question": "who is playing bilbo baggins", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g6z1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g6z1 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Old Bilbo ] ) )", "golden_entities": {"m.0g6z1": "Old Bilbo"}, "answer_entities": {"m.016zp5": "Ian Holm", "m.02fz3w": "Martin Freeman", "m.0f_wwf": "Norman Bird", "m.0n290f8": "Mikhail Danilov"}}, {"question": "where is the 2012 ncaa basketball tournament", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.080nmfs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.080nmfs ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ 2012 NCAA Men's Division I Basketball Tournament ] )", "golden_entities": {"m.080nmfs": "2012 NCAA Men's Division I Basketball Tournament"}, "answer_entities": {"m.01mq08": "Talking Stick Resort Arena", "m.01n31w": "Moda Center", "m.02b99h": "Edward Jones Dome", "m.02hqj2": "TD Garden", "m.02p_rvk": "Consol Energy Center", "m.02y3xn": "Mercedes-Benz Superdome", "m.02z6zt": "Bridgestone Arena", "m.0328cp": "Nationwide Arena", "m.038bv6": "Georgia Dome", "m.039nbl": "Greensboro Coliseum Complex", "m.0635xb": "The Pit", "m.0635y4": "UD Arena", "m.063ypc": "CenturyLink Center Omaha", "m.0f0fv9": "KFC Yum! Center"}}, {"question": "where did matt barnes play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07dr3v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07dr3v ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Matt Barnes ] ) )", "golden_entities": {"m.07dr3v": "Matt Barnes"}, "answer_entities": {"m.0jmjr": "Los Angeles Clippers", "m.0jmk7": "Los Angeles Lakers"}}, {"question": "where does the jordan river begin", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cvy5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cvy5 ns:geography.river.origin ?x .\n}\n", "logical_form": "( JOIN ( R [ geography , river , origin ] ) [ Jordan River ] )", "golden_entities": {"m.0cvy5": "Jordan River"}, "answer_entities": {"m.01txc9": "Anti-Lebanon mountains"}}, {"question": "where did rihanna come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mt91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mt91 ns:music.artist.origin ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , origin ] ) [ Rihanna ] )", "golden_entities": {"m.06mt91": "Rihanna"}, "answer_entities": {"m.0162v": "Barbados", "m.02p5kp": "Saint Michael Parish"}}, {"question": "who does kurt busch drive for now", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02llzy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02llzy ns:base.nascar.nascar_driver.team ?x .\n}\n", "logical_form": "( JOIN ( R [ base , nascar , nascar driver , team ] ) [ Kurt Busch ] )", "golden_entities": {"m.02llzy": "Kurt Busch"}, "answer_entities": {"m.073mq9": "Team Penske"}}, {"question": "what is the time zone in uk now", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ssc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ssc ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ United Kingdom ] )", "golden_entities": {"m.07ssc": "United Kingdom"}, "answer_entities": {"m.03bdv": "Greenwich Mean Time Zone"}}, {"question": "where are google headquarters located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03bby1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03bby1 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Googleplex ] )", "golden_entities": {"m.03bby1": "Googleplex"}, "answer_entities": {"m.01zjkmr": "94043", "m.0l2xl": "Santa Clara County", "m.0r6c4": "Mountain View"}}, {"question": "what was richard wright known for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bv6k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bv6k ns:common.topic.notable_types ?x .\n}\n", "logical_form": "( JOIN ( R [ common , topic , notable types ] ) [ Richard Wright ] )", "golden_entities": {"m.0bv6k": "Richard Wright"}, "answer_entities": {"m.01xryvt": "Author"}}, {"question": "where is the nascar hall of fame", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0635_7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0635_7 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ NASCAR Hall of Fame ] )", "golden_entities": {"m.0635_7": "NASCAR Hall of Fame"}, "answer_entities": {"m.05fkf": "North Carolina", "m.0fsb8": "Charlotte"}}, {"question": "what was the name of wright brothers plane", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fzv_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fzv_ ns:aviation.aircraft_manufacturer.aircraft_models_made ?x .\n}\n", "logical_form": "( JOIN ( R [ aviation , aircraft manufacturer , aircraft models made ] ) [ Wright brothers ] )", "golden_entities": {"m.0fzv_": "Wright brothers"}, "answer_entities": {"g.1hb_g613l": "Wright Model EX", "m.025tb9v": "1902 Wright Glider", "m.02x015_": "Wright Model B", "m.02x01s7": "Wright Model C", "m.0416n2": "Wright Flyer", "m.0bt3mt": "1900 Wright Glider"}}, {"question": "where is located university of leeds", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bzs9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bzs9 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ University of Leeds ] )", "golden_entities": {"m.01bzs9": "University of Leeds"}, "answer_entities": {"m.04p3c": "Leeds", "m.07ssc": "United Kingdom"}}, {"question": "who is gilbert gottfried snl", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02y0yt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02y0yt ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Gilbert Gottfried ] )", "golden_entities": {"m.02y0yt": "Gilbert Gottfried"}, "answer_entities": {"m.018gz8": "Comedian", "m.02hrh1q": "Actor", "m.0np9r": "Voice Actor"}}, {"question": "what language do they denmark", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k6nt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k6nt ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Denmark ] )", "golden_entities": {"m.0k6nt": "Denmark"}, "answer_entities": {"m.02_8gp": "Greenlandic language", "m.0295r": "Danish Language", "m.02hrcqd": "Faroese", "m.04306rv": "German Language"}}, {"question": "what did martin luther do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04yd_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04yd_ ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Martin Luther ] )", "golden_entities": {"m.04yd_": "Martin Luther"}, "answer_entities": {"m.016fly": "Professor", "m.0266rh": "Monk", "m.02kvl3l": "Theologian", "m.05t4q": "Physician", "m.05xjb": "Priest", "m.0cbd2": "Writer"}}, {"question": "what team did grover cleveland alexander play for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01zt27)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01zt27 ns:baseball.baseball_player.batting_stats ?y .\n?y ns:baseball.batting_statistics.team ?x .\n}\n", "logical_form": "( JOIN ( R [ baseball , batting statistics , team ] ) ( JOIN ( R [ baseball , baseball player , batting stats ] ) [ Grover Cleveland Alexander ] ) )", "golden_entities": {"m.01zt27": "Grover Cleveland Alexander"}, "answer_entities": {"m.01yjl": "Chicago Cubs", "m.05xvj": "Philadelphia Phillies", "m.06x68": "St. Louis Cardinals"}}, {"question": "what was eli whitney nationality", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ncr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ncr ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Eli Whitney ] )", "golden_entities": {"m.02ncr": "Eli Whitney"}, "answer_entities": {"m.09c7w0": "United States of America"}}, {"question": "what was christiaan barnard famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02092)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02092 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Christiaan Barnard ] )", "golden_entities": {"m.02092": "Christiaan Barnard"}, "answer_entities": {"m.02y_93f": "Surgeon", "m.05t4q": "Physician"}}, {"question": "where was dwight d. eisenhower from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.028rk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.028rk ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Dwight D. Eisenhower ] )", "golden_entities": {"m.028rk": "Dwight D. Eisenhower"}, "answer_entities": {"m.0101wz": "Denison"}}, {"question": "where do audi come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k50)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k50 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Audi ] ) )", "golden_entities": {"m.0k50": "Audi"}, "answer_entities": {"m.01dky4": "Ingolstadt"}}, {"question": "what to do washington dc december", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rh6k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rh6k ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Washington, D.C. ] )", "golden_entities": {"m.0rh6k": "Washington, D.C."}, "answer_entities": {"m.01_0bd": "Newseum", "m.016dff": "Washington Monument", "m.016fkr": "National Mall", "m.01gbmc": "National Air and Space Museum", "m.01lw24": "Folger Shakespeare Library", "m.022j06": "Franklin Delano Roosevelt Memorial", "m.024g7s": "Arthur M. Sackler Gallery", "m.0266ss": "National Museum of the American Indian", "m.0270__": "Korean War Veterans Memorial", "m.027128": "National World War II Memorial", "m.02734s3": "Katzen Arts Center", "m.02czw2": "National Building Museum", "m.02mv9q": "National Portrait Gallery", "m.02n5d1": "Anacostia Community Museum", "m.02p98v": "United States Holocaust Memorial Museum", "m.02ppyjj": "Marian Koshland Science Museum", "m.02qghxw": "Decatur House", "m.02qksvk": "Sewall-Belmont House and Museum", "m.033xgm": "Smithsonian Institution Building", "m.033xmz": "National Museum of Natural History", "m.033xp2": "Hirshhorn Museum and Sculpture Garden", "m.03q_0d": "Dumbarton Oaks", "m.03qg30": "Corcoran Gallery of Art", "m.03w66bm": "National Gallery of Art East Building", "m.03w726n": "National Archives Building", "m.03yw5h": "The Historical Society of Washington, D.C.", "m.041tsw": "Freer Gallery of Art", "m.043l1hs": "Old Stone House", "m.0442r8": "International Spy Museum", "m.044dqy_": "Art Museum of the Americas", "m.04ct6r7": "National Museum of Crime & Punishment", "m.04gmyv": "National Postal Museum", "m.04lgc0d": "Lillian & Albert Small Jewish Museum", "m.04lvcf": "National Museum of Women in the Arts", "m.04qnr0": "The Phillips Collection", "m.05229b8": "Laogai Museum", "m.059hxr2": "Madame Tussauds DC", "m.05zc1k": "National Aquarium in Washington, D.C.", "m.06_09g5": "Thomas Jefferson Memorial", "m.065x19g": "B'nai B'rith Klutznick National Jewish Museum", "m.06zqhxm": "Shiloh Baptist Church", "m.073l4k": "National Museum of African Art", "m.07dr_h": "Saint John Paul II National Shrine", "m.07f92f": "Renwick Gallery", "m.07vth": "United States Capitol", "m.081sq": "White House", "m.09p_2j": "Thomas Jefferson Building", "m.0b60fy": "National Museum of African American History and Culture", "m.0bbss1": "Mary McLeod Bethune Council House National Historic Site", "m.0by04": "United States Naval Observatory", "m.0c56z2": "Old Patent Office Building", "m.0d3548": "Tudor Place", "m.0d357s": "The Octagon House", "m.0dgsl8": "Kreeger Museum", "m.0drzq": "Lincoln Memorial", "m.0ff71l": "Woodrow Wilson House", "m.0gfbmq": "Hillwood Estate, Museum & Gardens", "m.0hztgf5": "National Gallery of Art West Building", "m.0j2kpvl": "National Museum of American History", "m.0k3ctcz": "Textile Museum", "m.0k3n0tk": "The Kreeger Museum"}}, {"question": "what language is spoken in singapore", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06t2t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06t2t ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ Singapore ] )", "golden_entities": {"m.06t2t": "Singapore"}, "answer_entities": {"m.02h40lc": "English Language", "m.0653m": "Standard Chinese", "m.07c9s": "Tamil Language", "m.0y1mh": "Malay Language"}}, {"question": "what do singapore speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06t2t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06t2t ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Singapore ] )", "golden_entities": {"m.06t2t": "Singapore"}, "answer_entities": {"m.01r2l": "Chinese language", "m.02h40lc": "English Language", "m.07c9s": "Tamil Language"}}, {"question": "who wrote the book of st. john", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01dmz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01dmz ns:book.written_work.author ?x .\n}\n", "logical_form": "( JOIN ( R [ book , written work , author ] ) [ Book of Revelation ] )", "golden_entities": {"m.01dmz": "Book of Revelation"}, "answer_entities": {"m.06ft_k": "John of Patmos"}}, {"question": "who is kobe bryant dad", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kmd4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kmd4 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ Kobe Bryant ] ) )", "golden_entities": {"m.01kmd4": "Kobe Bryant", "m.05zppz": "Male"}, "answer_entities": {"m.024trx": "Joe Bryant"}}, {"question": "what continent does israel belong to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03spz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03spz ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Israel ] )", "golden_entities": {"m.03spz": "Israel"}, "answer_entities": {"m.0j0k": "Asia"}}, {"question": "what is the capital city of albania", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jdx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jdx ns:location.country.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , capital ] ) [ Albania ] )", "golden_entities": {"m.0jdx": "Albania"}, "answer_entities": {"m.07m_f": "Tirana"}}, {"question": "what is wentworth miller in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06p426)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06p426 ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , series ] ) ( JOIN ( R [ tv , tv actor , starring roles ] ) [ Wentworth Miller ] ) )", "golden_entities": {"m.06p426": "Wentworth Miller"}, "answer_entities": {"m.03hhtns": "Dinotopia", "m.06dfz1": "Prison Break"}}, {"question": "who killed harvey milk", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01brc5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01brc5 ns:user.alexander.misc.murdered_person.murdered_by ?x .\n}\n", "logical_form": "( JOIN ( R [ user , alexander , misc , murdered person , murdered by ] ) [ Harvey Milk ] )", "golden_entities": {"m.01brc5": "Harvey Milk"}, "answer_entities": {"m.02dzj8": "Dan White"}}, {"question": "who owns nissan car manufacturer", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05b4c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05b4c ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ Nissan Motor Co., Ltd. ] )", "golden_entities": {"m.05b4c": "Nissan Motor Co., Ltd."}, "answer_entities": {"m.04nzf7": "Yoshisuke Aikawa", "m.0vpy5vb": "William Gorham", "m.0wrj2c_": "Masujiro Hashimoto", "m.0wrj2lb": "Kenjiro Den", "m.0wrj2mj": "Rokuro Aoyama", "m.0wrj2n7": "Meitaro Takeuchi"}}, {"question": "where is the university of west alabama located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07c5fv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07c5fv ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ University of West Alabama ] )", "golden_entities": {"m.07c5fv": "University of West Alabama"}, "answer_entities": {"m.09c7w0": "United States of America", "m.0gyh": "Alabama", "m.0qbzf": "Livingston"}}, {"question": "what did kenny everett die off", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01m0gh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01m0gh ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Kenny Everett ] )", "golden_entities": {"m.01m0gh": "Kenny Everett"}, "answer_entities": {"m.0d19y2": "HIV/AIDS"}}, {"question": "where does joey king live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03yk4pb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03yk4pb ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Joey King ] ) )", "golden_entities": {"m.03yk4pb": "Joey King"}, "answer_entities": {"m.030qb3t": "Los Angeles", "m.0cv3w": "Las Vegas"}}, {"question": "what was manchester united first name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.050fh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.050fh ns:sports.sports_team.previously_known_as ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , previously known as ] ) [ Manchester United F.C. ] )", "golden_entities": {"m.050fh": "Manchester United F.C."}, "answer_entities": {"m.05l1ffz": "Newton Heath L&YR F.C."}}, {"question": "where did elvis presley started his career", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02jq1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02jq1 ns:music.artist.origin ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , origin ] ) [ Elvis Presley ] )", "golden_entities": {"m.02jq1": "Elvis Presley"}, "answer_entities": {"m.0c_m3": "Memphis"}}, {"question": "what jobs did harriet tubman have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.098yd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.098yd ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Harriet Tubman ] )", "golden_entities": {"m.098yd": "Harriet Tubman"}, "answer_entities": {"m.0cbd2": "Writer", "m.0j_7vl6": "Activist"}}, {"question": "what does amanda seyfried play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03zz8b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03zz8b ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Amanda Seyfried ] ) )", "golden_entities": {"m.03zz8b": "Amanda Seyfried"}, "answer_entities": {"m.0_d7r_6": "Pan", "m.0_ylqw8": "Fathers and Daughters", "m.010bmn2w": "Dog Food", "m.0114hb3m": "Ted 2", "m.012n3_27": "Let It Snow", "m.0272_vz": "Mamma Mia!", "m.028b3px": "Solstice", "m.02xtxw": "Mean Girls", "m.03crpy6": "Boogie Woogie", "m.03nq_dr": "Jennifer's Body", "m.05b08zq": "Dear John", "m.05n3l7": "Alpha Dog", "m.07l4yp8": "Chloe", "m.09v12js": "Letters to Juliet", "m.0bg8jm5": "A Bag of Hammers", "m.0c241c_": "Red Riding Hood", "m.0cfhfz": "Nine Lives", "m.0crpgp": "American Gun", "m.0dr_xmk": "In Time", "m.0gw8ngw": "Gone", "m.0gwvbxv": "The Big Wedding", "m.0gww77t": "Official Selection", "m.0gy8df_": "While We're Young", "m.0h51_mt": "Les Mis\u00e9rables", "m.0hhgh69": "Epic", "m.0hn82bb": "The End of Love", "m.0j2b8qf": "Lovelace", "m.0s9l4cg": "Pete and Goat", "m.0s9l50x": "Wonderful Tonight", "m.0v13yby": "The Girl Who Conned the Ivy League", "m.0vps74l": "A Million Ways to Die in the West"}}, {"question": "what is the jurisdiction of the us supreme court", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07sz1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07sz1 ns:law.court.jurisdiction ?x .\n}\n", "logical_form": "( JOIN ( R [ law , court , jurisdiction ] ) [ Supreme Court of the United States ] )", "golden_entities": {"m.07sz1": "Supreme Court of the United States"}, "answer_entities": {"m.09c7w0": "United States of America"}}, {"question": "what instrument does bela fleck play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.017f9r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.017f9r ns:music.musical_group.member ?y .\n?y ns:music.group_membership.role ?x .\n}\n", "logical_form": "( JOIN ( R [ music , group membership , role ] ) ( JOIN ( R [ music , musical group , member ] ) [ B\u00e9la Fleck and the Flecktones ] ) )", "golden_entities": {"m.017f9r": "B\u00e9la Fleck and the Flecktones"}, "answer_entities": {"m.018j2": "Banjo", "m.018vs": "Bass guitar", "m.03qjg": "Harmonica", "m.06ncr": "Saxophone", "m.0l14j_": "Flute", "m.0l14md": "Percussion"}}, {"question": "what position does ray allen", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03lh3v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03lh3v ns:basketball.basketball_player.position_s ?x .\n}\n", "logical_form": "( JOIN ( R [ basketball , basketball player , position s ] ) [ Ray Allen ] )", "golden_entities": {"m.03lh3v": "Ray Allen"}, "answer_entities": {"m.03558l": "Shooting guard"}}, {"question": "what branch is made up of the house of representatives", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b3wk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b3wk ns:government.governmental_body.body_this_is_a_component_of ?x .\n}\n", "logical_form": "( JOIN ( R [ government , governmental body , body this is a component of ] ) [ United States House of Representatives ] )", "golden_entities": {"m.0b3wk": "United States House of Representatives"}, "answer_entities": {"m.07t31": "United States Congress"}}, {"question": "where did chancellorsville battle take place", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d0mw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d0mw ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ Battle of Chancellorsville ] )", "golden_entities": {"m.0d0mw": "Battle of Chancellorsville"}, "answer_entities": {"m.07z1m": "Virginia", "m.0mn1p": "Spotsylvania County"}}, {"question": "who was king or queen after victoria", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cw10)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cw10 ns:people.person.children ?x .\n?x ns:common.topic.notable_types ns:m.04fnrhx .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Monarch ] ) ( JOIN ( R [ people , person , children ] ) [ Queen Victoria ] ) )", "golden_entities": {"m.0cw10": "Queen Victoria", "m.04fnrhx": "Monarch"}, "answer_entities": {"m.0cm03": "Edward VII"}}, {"question": "what movie did rihanna play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mt91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mt91 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Rihanna ] ) )", "golden_entities": {"m.06mt91": "Rihanna"}, "answer_entities": {"m.0bh8tgs": "Battleship", "m.0hz4j2j": "This Is the End", "m.0mwfph8": "Home"}}, {"question": "what religion was mary todd lincoln", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ypl0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ypl0 ns:people.person.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , religion ] ) [ Mary Todd Lincoln ] )", "golden_entities": {"m.01ypl0": "Mary Todd Lincoln"}, "answer_entities": {"m.019cr": "Baptists", "m.0631_": "Presbyterianism", "m.0c8wxp": "Catholicism"}}, {"question": "who all has jason kidd played for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cg2v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cg2v ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Jason Kidd ] ) )", "golden_entities": {"m.02cg2v": "Jason Kidd"}, "answer_entities": {"m.0jm3b": "Brooklyn Nets", "m.0jm3v": "New York Knicks", "m.0jmcv": "Dallas Mavericks", "m.0jml5": "Phoenix Suns"}}, {"question": "where is headquarters of verizon", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_dn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_dn ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Verizon Communications ] ) )", "golden_entities": {"m.07_dn": "Verizon Communications"}, "answer_entities": {"m.02_286": "New York City"}}, {"question": "where is the country of cyprus located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ppq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ppq ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Cyprus ] )", "golden_entities": {"m.01ppq": "Cyprus"}, "answer_entities": {"m.02qkt": "Eurasia"}}, {"question": "who invented dell computer", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0py9b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0py9b ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ Dell ] )", "golden_entities": {"m.0py9b": "Dell"}, "answer_entities": {"m.013q3z": "Michael S. Dell"}}, {"question": "where did morgan freeman come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.055c8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.055c8 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Morgan Freeman ] )", "golden_entities": {"m.055c8": "Morgan Freeman"}, "answer_entities": {"m.0c_m3": "Memphis"}}]