[{"question": "what shows did kellie martin star in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03kcyd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03kcyd ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , series ] ) ( JOIN ( R [ tv , tv actor , starring roles ] ) [ Kellie Martin ] ) )", "golden_entities": {"m.03kcyd": "Kellie Martin"}, "answer_entities": {"m.0180mw": "ER", "m.025v6tf": "Father Murphy", "m.026h12p": "ABC Weekend Special", "m.027z1w1": "Mystery Woman", "m.02s17g": "Mr. Belvedere", "m.03q1mg": "The Tracey Ullman Show", "m.03v_dq": "Life Goes On", "m.03vn46": "Taz-Mania", "m.03wrwt": "Life with Lucy", "m.05nlzq": "A Pup Named Scooby-Doo", "m.07cf_d1": "Crisis Center", "m.08znxc": "Christy", "m.0d7bm_": "Potato Head Kids"}}, {"question": "where is whistler mountain located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pg6z3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pg6z3 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Whistler Mountain ] )", "golden_entities": {"m.02pg6z3": "Whistler Mountain"}, "answer_entities": {"m.015jr": "British Columbia", "m.0183r6": "Coast Mountains", "m.019f_v": "North American Cordillera", "m.01jwb2": "Pacific Coast Ranges", "m.059g4": "North America", "m.05q3snr": "Fitzsimmons Range", "m.08p698": "Pacific Ranges", "m.08pqh0": "Garibaldi Ranges", "m.0d060g": "Canada"}}, {"question": "what country did james cook come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_j8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_j8 ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ James Cook ] )", "golden_entities": {"m.03_j8": "James Cook"}, "answer_entities": {"m.014tss": "Kingdom of Great Britain", "m.07ssc": "United Kingdom"}}, {"question": "when did the christchurch quake happened", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gg9kfr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gg9kfr ns:time.event.start_date ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , start date ] ) [ 2011 Christchurch earthquake ] )", "golden_entities": {"m.0gg9kfr": "2011 Christchurch earthquake"}, "answer_entities": {"value": "2011-02-22"}}, {"question": "who played mason capwell", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04f3bz1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04f3bz1 ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Mason Capwell ] ) )", "golden_entities": {"m.04f3bz1": "Mason Capwell"}, "answer_entities": {"m.04qpl4": "Terry Lester", "m.0dvmd": "Leonardo DiCaprio"}}, {"question": "what is james madison most famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0424m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0424m ns:common.topic.notable_types ?x .\n}\n", "logical_form": "( JOIN ( R [ common , topic , notable types ] ) [ James Madison ] )", "golden_entities": {"m.0424m": "James Madison"}, "answer_entities": {"m.01xljv7": "US President"}}, {"question": "where was the battle of antietam creek", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lkxb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lkxb ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ Battle of Antietam ] )", "golden_entities": {"m.0lkxb": "Battle of Antietam"}, "answer_entities": {"m.04rrd": "Maryland", "m.0txnb": "Sharpsburg"}}, {"question": "who are shakespeare 's parents names", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081k8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081k8 ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ William Shakespeare ] )", "golden_entities": {"m.081k8": "William Shakespeare"}, "answer_entities": {"m.01stsq": "John Shakespeare", "m.01xgc7": "Mary Shakespeare"}}, {"question": "what type of guitar does kirk hammett play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0489w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0489w ns:music.group_member.instruments_played ?x .\n?x ns:music.instrument.family ns:m.0342h .\n}\n", "logical_form": "( AND ( JOIN [ music , instrument , family ] [ Guitar ] ) ( JOIN ( R [ music , group member , instruments played ] ) [ Kirk Hammett ] ) )", "golden_entities": {"m.0489w": "Kirk Hammett", "m.0342h": "Guitar"}, "answer_entities": {"m.018vs": "Bass guitar"}}, {"question": "what language they speak in the philippines", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05v8c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05v8c ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ Philippines ] )", "golden_entities": {"m.05v8c": "Philippines"}, "answer_entities": {"m.01jb8r": "Filipino language", "m.02h40lc": "English Language"}}, {"question": "where is the kakadu national park located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0psgs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0psgs ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Kakadu National Park ] )", "golden_entities": {"m.0psgs": "Kakadu National Park"}, "answer_entities": {"m.05ff6": "Northern Territory"}}, {"question": "what timezone is colorado in right now", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01n4w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01n4w ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Colorado ] )", "golden_entities": {"m.01n4w": "Colorado"}, "answer_entities": {"m.02hczc": "Mountain Time Zone"}}, {"question": "what disease has jack osbourne got", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02348n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02348n ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n", "logical_form": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ Jack Osbourne ] )", "golden_entities": {"m.02348n": "Jack Osbourne"}, "answer_entities": {"m.0dcqh": "Multiple sclerosis"}}, {"question": "what language they speak in taiwan", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06f32)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06f32 ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ Taiwan ] )", "golden_entities": {"m.06f32": "Taiwan"}, "answer_entities": {"m.0653m": "Standard Chinese"}}, {"question": "who owns the toronto maple leafs", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j6tr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j6tr ns:sports.professional_sports_team.owner_s ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , professional sports team , owner s ] ) [ Toronto Maple Leafs ] )", "golden_entities": {"m.0j6tr": "Toronto Maple Leafs"}, "answer_entities": {"m.06p05l": "Maple Leaf Sports & Entertainment"}}, {"question": "what county is novato california in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0r1hb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0r1hb ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Novato ] )", "golden_entities": {"m.0r1hb": "Novato"}, "answer_entities": {"m.0l2hf": "Marin County"}}, {"question": "what are the basic beliefs of sikhism", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06yyp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06yyp ns:religion.religion.beliefs ?x .\n}\n", "logical_form": "( JOIN ( R [ religion , religion , beliefs ] ) [ Sikhism ] )", "golden_entities": {"m.06yyp": "Sikhism"}, "answer_entities": {"m.017kx3": "Sa\u1e43s\u0101ra", "m.02fbl": "Dharma", "m.049hc": "Karma", "m.04xy3": "Monotheism", "m.06fmt": "Reincarnation", "m.0c576t": "Pyaar"}}, {"question": "where did hernando cortez die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03m_h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03m_h ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Hern\u00e1n Cort\u00e9s ] )", "golden_entities": {"m.03m_h": "Hern\u00e1n Cort\u00e9s"}, "answer_entities": {"m.08hf27": "Castilleja de la Cuesta"}}, {"question": "where was the ancient region of mesopotamia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0524v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0524v ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Mesopotamia ] )", "golden_entities": {"m.0524v": "Mesopotamia"}, "answer_entities": {"m.04wsz": "Middle East"}}, {"question": "who are the green bay packers owned by", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03b3j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03b3j ns:sports.professional_sports_team.owner_s ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , professional sports team , owner s ] ) [ Green Bay Packers ] )", "golden_entities": {"m.03b3j": "Green Bay Packers"}, "answer_entities": {"m.0c24nj": "Green Bay Packers Board of Directors"}}, {"question": "what inspired langston hughes to write poetry", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bv62)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bv62 ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Langston Hughes ] )", "golden_entities": {"m.0bv62": "Langston Hughes"}, "answer_entities": {"m.085gk": "Walt Whitman"}}, {"question": "where did henry knox die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01hx16)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01hx16 ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Henry Knox ] )", "golden_entities": {"m.01hx16": "Henry Knox"}, "answer_entities": {"m.03897b": "Thomaston"}}, {"question": "what language do they speak in northern ireland", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05bcl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05bcl ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ Northern Ireland ] )", "golden_entities": {"m.05bcl": "Northern Ireland"}, "answer_entities": {"m.0165vf": "Ulster Scots dialects", "m.02h40lc": "English Language", "m.03x42": "Irish"}}, {"question": "what countries make up continental europe", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02j9z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02j9z ns:base.locations.continents.countries_within ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , continents , countries within ] ) [ Europe ] )", "golden_entities": {"m.02j9z": "Europe"}, "answer_entities": {"m.0154j": "Belgium", "m.015qh": "Bulgaria", "m.0163v": "Belarus", "m.0166b": "Bosnia and Herzegovina", "m.01mjq": "Czech Republic", "m.01pj7": "Croatia", "m.02kmm": "Estonia", "m.02vzc": "Finland", "m.0345h": "Germany", "m.035qy": "Greece", "m.03gj2": "Hungary", "m.03rj0": "Iceland", "m.03rjj": "Italy", "m.03rt9": "Republic of Ireland", "m.04fh3": "Republic of Kosovo", "m.04g5k": "Latvia", "m.04g61": "Luxembourg", "m.04gzd": "Lithuania", "m.04j53": "Liechtenstein", "m.04v3q": "Malta", "m.04w4s": "Moldova", "m.04w58": "Monaco", "m.056vv": "Montenegro", "m.059j2": "Netherlands", "m.05b4w": "Norway", "m.05qhw": "Poland", "m.05r4w": "Portugal", "m.06bnz": "Russia", "m.06c1y": "Romania", "m.06mkj": "Spain", "m.06mzp": "Switzerland", "m.06npd": "Slovakia", "m.06sff": "San Marino", "m.06t8v": "Slovenia", "m.077qn": "Serbia", "m.07ssc": "United Kingdom", "m.07t21": "Ukraine", "m.07ytt": "Vatican City", "m.0bjv6": "Republic of Macedonia", "m.0d0kn": "Georgia", "m.0d0vqn": "Sweden", "m.0h7x": "Austria", "m.0hg5": "Andorra", "m.0jdx": "Albania", "m.0jgx": "Armenia", "m.0k6nt": "Denmark"}}, {"question": "what do abrahamic religions have in common", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f_h6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f_h6 ns:religion.religion.practices ?x .\n}\n", "logical_form": "( JOIN ( R [ religion , religion , practices ] ) [ Abrahamic religions ] )", "golden_entities": {"m.0f_h6": "Abrahamic religions"}, "answer_entities": {"m.01zky": "Circumcision", "m.04xy3": "Monotheism"}}, {"question": "what did johnny crawford sing", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01qmb2r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01qmb2r ns:music.artist.track ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , track ] ) [ Johnny Crawford ] )", "golden_entities": {"m.01qmb2r": "Johnny Crawford"}, "answer_entities": {"m.010f1rn": "Cindy's Birthday", "m.010f1rw": "Daydreams", "m.010f1s2": "Treasure", "m.010f1s9": "Patti Ann", "m.010f1sj": "Donna", "m.010f1sr": "Something Special", "m.010f1sz": "Your Nose Is Gonna Grow", "m.010f1t5": "Mr. Blue", "m.010f1td": "Rumors", "m.010f1tm": "Proud", "m.010f1tv": "Cindy's Gonna Cry", "m.010f1v1": "Judy Loves Me", "m.010f1v8": "Sandy", "m.010f1vh": "Lonesome Town", "m.010f1vq": "Sittin' and A-Watchin'", "m.01f3d9r": "Rumors", "m.0x1mxp4": "Petite Chanson", "m.0x86_1": "Cindy's Birthday", "m.0xc1_j": "Maybe It's You", "m.0xv33_": "Daydreams", "m.0xv333": "Rumours", "m.0xv33b": "Your Nose Is Gonna Grow", "m.0xv33k": "Proud", "m.0xv33s": "Patti Ann", "m.0xv346": "Cindy's Gonna Cry", "m.0xv34f": "Judy Loves Me", "m.0xv34n": "Janie Please Believe Me", "m.0xv34w": "What Happened to Janie", "m.0xv352": "Lonesome Town", "m.0xv359": "Lucky Star", "m.0xv35j": "Devil or Angel", "m.0xv35r": "Sandy", "m.0xv35z": "Debbie", "m.0xv365": "Your Love Is Growing Cold", "m.0xv36d": "That's All I Want From You", "m.0xv36m": "Cry on My Shoulder", "m.0xv36v": "I Don't Need You", "m.0xv371": "Mr Blue", "m.0xv378": "The Girl Next Door", "m.0xv37h": "We Belong Together", "m.0xv37q": "No One Really Loves", "m.0xv37y": "Sittin' and A-Watchin'", "m.0zc0l6": "Cindy's Birthday"}}, {"question": "what sport does sally pearson compete in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0287hgn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0287hgn ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Sally Pearson ] )", "golden_entities": {"m.0287hgn": "Sally Pearson"}, "answer_entities": {"m.01445t": "Athlete", "m.059846g": "Track and field athlete"}}, {"question": "where is atlanta texas located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0_ztb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0_ztb ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Atlanta ] )", "golden_entities": {"m.0_ztb": "Atlanta"}, "answer_entities": {"m.0msb1": "Cass County"}}, {"question": "where is tom cruise from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07r1h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07r1h ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Tom Cruise ] )", "golden_entities": {"m.07r1h": "Tom Cruise"}, "answer_entities": {"m.071cn": "Syracuse"}}, {"question": "what movies did madonna appear in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vs_v8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vs_v8 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Madonna ] ) )", "golden_entities": {"m.01vs_v8": "Madonna"}, "answer_entities": {"m.014kq6": "Die Another Day", "m.017sg6": "A Certain Sacrifice", "m.027jdg0": "Dangerous Game", "m.027yrxp": "Who's That Girl", "m.02ndy4": "A League of Their Own", "m.02pg45": "Four Rooms", "m.0326d9": "Vision Quest", "m.034d5_": "Blue in the Face", "m.035_2h": "Dick Tracy", "m.04_ccy": "Shadows and Fog", "m.04f31_j": "Bloodhounds of Broadway", "m.04jrlg": "Shanghai Surprise", "m.04jrzl": "Girl 6", "m.05b_gq": "Swept Away", "m.06fht6": "Desperately Seeking Susan", "m.07mpbj": "Arthur and the Invisibles", "m.07vf5c": "Evita", "m.09y6pb": "The Next Best Thing", "m.0bb1gvg": "Star", "m.0dtxp9": "Torrance Rises", "m.0kv8_w": "Body of Evidence", "m.0xndfq6": "secretprojectrevolution"}}, {"question": "where was the roman colosseum located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d5qx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d5qx ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Colosseum ] )", "golden_entities": {"m.0d5qx": "Colosseum"}, "answer_entities": {"m.03rjj": "Italy", "m.06c62": "Rome"}}, {"question": "what time zone is new york under", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059rby)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059rby ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ New York ] )", "golden_entities": {"m.059rby": "New York"}, "answer_entities": {"m.02_37z": "UTC\u221205:00", "m.02hcv8": "Eastern Time Zone"}}, {"question": "where did bashar al assad study", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_vwx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_vwx ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Bashar al-Assad ] ) )", "golden_entities": {"m.01_vwx": "Bashar al-Assad"}, "answer_entities": {"m.07pnw6": "Damascus University"}}, {"question": "what films did charlie chaplin direct", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lc5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lc5 ns:film.director.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , director , film ] ) [ Charlie Chaplin ] )", "golden_entities": {"m.01lc5": "Charlie Chaplin"}, "answer_entities": {"g.11r7rjf5y": "Charlie Chaplin Cavalcade", "g.11vjpgmn4": "The Charlie Chaplin Festival", "m.011_mj": "The Circus", "m.028ccyx": "The Rounders", "m.02nmmc": "Monsieur Verdoux", "m.02nr5x": "A Woman of Paris: A Drama of Fate", "m.02qmf5d": "His New Job", "m.02qmf84": "His Prehistoric Past", "m.02qmf9w": "The Face on the Bar-room Floor", "m.02qmg0x": "His Trysting Place", "m.02rd3lk": "Caught in the Rain", "m.02rd3sr": "Her Friend the Bandit", "m.02rd486": "Mabel's Married Life", "m.02rd4fq": "Laughing Gas", "m.02rd4m6": "The Property Man", "m.02rd7tg": "Those Love Pangs", "m.02rd7zm": "Gentlemen of Nerve", "m.02rd81q": "His Musical Career", "m.02rd8fr": "Getting Acquainted", "m.02rdpf9": "His Regeneration", "m.02rdqf9": "Shanghaied", "m.02rdz11": "The Professor", "m.02sd4m": "Limelight", "m.02vl0sm": "The Chaplin Revue", "m.03b1dk": "Behind the Screen", "m.04lm51": "Twenty Minutes of Love", "m.04vl27": "The Kid", "m.05x26y": "Pay Day", "m.0617fz": "A King In New York", "m.061nfk": "The New Janitor", "m.07lmgm": "A Night in the Show", "m.07m2_1": "The Pilgrim", "m.07m2js": "The Pawnshop", "m.07m2lh": "The Floorwalker", "m.07m2r4": "A Woman", "m.07m2sx": "By the Sea", "m.07m2v9": "A Jitney Elopement", "m.07m325": "The Bond", "m.07m7s0": "The Tramp", "m.07m7w3": "One A.M.", "m.07m82k": "The Count", "m.07m8hw": "Police", "m.07mll4": "A Day's Pleasure", "m.07mlq9": "Shoulder Arms", "m.07mlsy": "A Dog's Life", "m.07mlzy": "Sunnyside", "m.07mmj9": "The Rink", "m.07mpcp": "One Week", "m.07n2_l": "A Burlesque on Carmen", "m.07n33g": "In The Park", "m.07n3pj": "The Vagabond", "m.07n73f": "The Bank", "m.07n76l": "The Idle Class", "m.07n7h2": "Triple Trouble", "m.07n7w9": "Work", "m.07plln": "Dough and Dynamite", "m.085r31": "Easy Street", "m.08b2hs": "The Masquerader", "m.08gv4n": "A Night Out", "m.08h1y4": "A Countess From Hong Kong", "m.08kf7t": "The Adventurer", "m.08kfbx": "The Champion", "m.09lh9c": "The Fireman", "m.09t69n": "The Cure", "m.0crvd9_": "Charlie Chaplin: His Life & Work", "m.0cs040k": "Chaplin: The Collection: Vol. 3", "m.0f1ggl": "His New Profession", "m.0fyj8w": "Recreation", "m.0gy4z": "The Great Dictator", "m.0jq9t": "City Lights", "m.0jsfp": "The Gold Rush", "m.0jvw0": "The Immigrant", "m.0jz2p": "Modern Times", "m.0v3x_mv": "Charlie Chaplin Carnival", "m.0v3y82z": "Nice and Friendly"}}, {"question": "who were anakin skywalker 's parents", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f2y0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f2y0 ns:fictional_universe.fictional_character.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , fictional character , parents ] ) [ Darth Vader ] )", "golden_entities": {"m.0f2y0": "Darth Vader"}, "answer_entities": {"m.0ddqd": "Shmi Skywalker"}}, {"question": "what exactly did dale earnhardt die from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.026fx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.026fx ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Dale Earnhardt ] )", "golden_entities": {"m.026fx": "Dale Earnhardt"}, "answer_entities": {"m.06c7cpj": "Racing Accident", "m.07qd_p": "Basilar skull fracture"}}, {"question": "what year did miami heat win the championship", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jm2v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jm2v ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Miami Heat ] )", "golden_entities": {"m.0jm2v": "Miami Heat"}, "answer_entities": {"m.0bq7g4": "2006 NBA Finals", "m.0jwzhbj": "2012 NBA Finals", "m.0vpt91g": "2013 NBA Finals"}}, {"question": "what kind of government did benito mussolini have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0177g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0177g ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n", "logical_form": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Benito Mussolini ] ) )", "golden_entities": {"m.0177g": "Benito Mussolini"}, "answer_entities": {"m.062zj5": "Italian Socialist Party", "m.09v62_g": "Republican Fascist Party", "m.0bbycd": "National Fascist Party"}}, {"question": "who was emperor diocletian", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02d0k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02d0k ns:user.robert.roman_empire.roman_emperor.title ?x .\n}\n", "logical_form": "( JOIN ( R [ user , robert , roman empire , roman emperor , title ] ) [ Diocletian ] )", "golden_entities": {"m.02d0k": "Diocletian"}, "answer_entities": {"m.01g14w": "Roman emperor"}}, {"question": "who is chelsea kane", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vydtw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vydtw ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Chelsea Kane ] )", "golden_entities": {"m.02vydtw": "Chelsea Kane"}, "answer_entities": {"m.02h6p92": "Dancer", "m.02hrh1q": "Actor", "m.09l65": "Singer", "m.0np9r": "Voice Actor"}}, {"question": "who is darwin and what is his theory", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lwx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lwx ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Charles Darwin ] )", "golden_entities": {"m.01lwx": "Charles Darwin"}, "answer_entities": {"m.02h99sv": "Naturalist", "m.036n1": "Geologist", "m.06q2q": "Scientist", "m.07lqg0": "Biologist", "m.0cbd2": "Writer"}}, {"question": "what did obama study in school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:people.person.education ?y .\n?y ns:education.education.major_field_of_study ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , major field of study ] ) ( JOIN ( R [ people , person , education ] ) [ Barack Obama ] ) )", "golden_entities": {"m.02mjmr": "Barack Obama"}, "answer_entities": {"m.062z7": "Political Science"}}, {"question": "what continent is south africa part of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hzlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hzlz ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ South Africa ] )", "golden_entities": {"m.0hzlz": "South Africa"}, "answer_entities": {"m.0dg3n1": "Africa"}}, {"question": "what company did henry ford work for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gxm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gxm ns:people.person.employment_history ?y .\n?y ns:business.employment_tenure.company ?x .\n}\n", "logical_form": "( JOIN ( R [ business , employment tenure , company ] ) ( JOIN ( R [ people , person , employment history ] ) [ Henry Ford ] ) )", "golden_entities": {"m.03gxm": "Henry Ford"}, "answer_entities": {"m.01p00g": "Henry Ford Company", "m.02zs4": "Ford Motor Company", "m.04hys37": "Detroit Dry Dock Co", "m.04hys3r": "James F. Flower & Bros", "m.069q9b": "Edison Illuminating Company"}}, {"question": "where indian ocean is located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03rz4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03rz4 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Indian Ocean ] )", "golden_entities": {"m.03rz4": "Indian Ocean"}, "answer_entities": {"m.0dkh39": "World Ocean"}}, {"question": "who was mary 's mother", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04n7gc6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04n7gc6 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , parents ] ) [ Mary ] ) )", "golden_entities": {"m.04n7gc6": "Mary", "m.02zsn": "Female"}, "answer_entities": {"m.0121n2": "Saint Anne"}}, {"question": "where is the howard university located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0217m9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0217m9 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Howard University ] )", "golden_entities": {"m.0217m9": "Howard University"}, "answer_entities": {"m.09c7w0": "United States of America", "m.0rh6k": "Washington, D.C."}}, {"question": "what do catholics call their god", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c8wxp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c8wxp ns:religion.religion.deities ?x .\n}\n", "logical_form": "( JOIN ( R [ religion , religion , deities ] ) [ Catholicism ] )", "golden_entities": {"m.0c8wxp": "Catholicism"}, "answer_entities": {"m.03qsc": "Holy Spirit", "m.045m1_": "Jesus Christ", "m.077_fbm": "The Father", "m.0d05l6": "God"}}, {"question": "what is the capital of alaska state", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hjy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hjy ns:base.aareas.schema.administrative_area.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , capital ] ) [ Alaska ] )", "golden_entities": {"m.0hjy": "Alaska"}, "answer_entities": {"m.0l_q9": "Juneau"}}]