[{"question": "who was queen elizabeth the first 's mother", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02rg_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02rg_ ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , parents ] ) [ Elizabeth I of England ] ) )", "golden_entities": {"m.02rg_": "Elizabeth I of England", "m.02zsn": "Female"}, "answer_entities": {"m.09sxn": "Anne Boleyn"}}, {"question": "who played heath barkley", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05psqzd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05psqzd ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Heath Barkley ] ) )", "golden_entities": {"m.05psqzd": "Heath Barkley"}, "answer_entities": {"m.02vz7q": "Travis Fimmel"}}, {"question": "what did edward jenner do for a living", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ljb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ljb ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Edward Jenner ] )", "golden_entities": {"m.02ljb": "Edward Jenner"}, "answer_entities": {"m.05t4q": "Physician", "m.06q2q": "Scientist"}}, {"question": "what did brittany murphy died of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0168dy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0168dy ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Brittany Murphy ] )", "golden_entities": {"m.0168dy": "Brittany Murphy"}, "answer_entities": {"m.02q7n0v": "Combined drug intoxication", "m.0dq9p": "Pneumonia", "m.0lcdk": "Anemia"}}, {"question": "where is amsterdam ohio", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0yyzd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0yyzd ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Amsterdam ] )", "golden_entities": {"m.0yyzd": "Amsterdam"}, "answer_entities": {"m.0n25q": "Jefferson County"}}, {"question": "who did stephenie meyer play in twilight", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c4_9m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c4_9m ns:film.actor.film ?y .\n?y ns:film.performance.character ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , character ] ) ( JOIN ( R [ film , actor , film ] ) [ Stephenie Meyer ] ) )", "golden_entities": {"m.0c4_9m": "Stephenie Meyer"}, "answer_entities": {"m.0hq8yww": "Woman at Wedding"}}, {"question": "what teams are in the american league west", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07fbnf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07fbnf ns:sports.sports_league.teams ?y .\n?y ns:sports.sports_league_participation.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league participation , team ] ) ( JOIN ( R [ sports , sports league , teams ] ) [ American League West ] ) )", "golden_entities": {"m.07fbnf": "American League West"}, "answer_entities": {"m.04wmvz": "Los Angeles Angels of Anaheim", "m.05kmnv1": "California Angels", "m.05kmp0g": "Anaheim Angels", "m.05m_8": "Oakland Athletics", "m.06wpc": "Seattle Mariners", "m.07l8x": "Texas Rangers", "m.0fq2vj2": "Seattle Pilots"}}, {"question": "what are the name of mitt romney sons", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0271_s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0271_s ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , children ] ) [ Mitt Romney ] ) )", "golden_entities": {"m.0271_s": "Mitt Romney", "m.05zppz": "Male"}, "answer_entities": {"m.02kvkl_": "Matt Romney", "m.02kvkmn": "Ben Romney", "m.02kvkmy": "Craig Romney", "m.03m5dk9": "Tagg Romney", "m.03qj3pv": "Josh Romney"}}, {"question": "what was robert hooke 's contributions to science", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d6j4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d6j4 ns:law.inventor.inventions ?x .\n}\n", "logical_form": "( JOIN ( R [ law , inventor , inventions ] ) [ Robert Hooke ] )", "golden_entities": {"m.0d6j4": "Robert Hooke"}, "answer_entities": {"m.012d66": "Universal joint", "m.04j8js": "Diaphragm", "m.056jh0": "Balance wheel"}}, {"question": "who is nick grimshaw", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03cly4v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03cly4v ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Nick Grimshaw ] )", "golden_entities": {"m.03cly4v": "Nick Grimshaw"}, "answer_entities": {"m.015cjr": "Presenter", "m.02dsz": "Disc jockey"}}, {"question": "what did florence sabin do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.033_w4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.033_w4 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Florence R. Sabin ] )", "golden_entities": {"m.033_w4": "Florence R. Sabin"}, "answer_entities": {"m.05t4q": "Physician"}}, {"question": "where did audie murphy grow up", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_nh0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_nh0 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Audie Murphy ] )", "golden_entities": {"m.01_nh0": "Audie Murphy"}, "answer_entities": {"m.04bwqsw": "Kingston"}}, {"question": "what school does bart simpson go to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h6cb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h6cb ns:fictional_universe.fictional_character.education ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , fictional character , education ] ) [ Bart Simpson ] )", "golden_entities": {"m.0h6cb": "Bart Simpson"}, "answer_entities": {"m.0h2m5t_": "Springfield High School", "m.0h8cb": "Springfield Elementary School"}}, {"question": "where is okemos michigan", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0v7_g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0v7_g ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Okemos ] )", "golden_entities": {"m.0v7_g": "Okemos"}, "answer_entities": {"m.0njlp": "Ingham County"}}, {"question": "where did caroline kennedy go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01y603)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01y603 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Caroline Kennedy ] ) )", "golden_entities": {"m.01y603": "Caroline Kennedy"}, "answer_entities": {"m.01k7xz": "Radcliffe College", "m.01mpwj": "Harvard College", "m.01n951": "Columbia Law School", "m.03ksy": "Harvard University", "m.0bf5w5": "Concord Academy"}}, {"question": "who is the ravens coach", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ct6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ct6 ns:american_football.football_team.current_head_coach ?x .\n}\n", "logical_form": "( JOIN ( R [ american football , football team , current head coach ] ) [ Baltimore Ravens ] )", "golden_entities": {"m.01ct6": "Baltimore Ravens"}, "answer_entities": {"m.0c2fvr": "John Harbaugh"}}, {"question": "what does the roman empire consist of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06cmp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06cmp ns:location.location.contains ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , contains ] ) [ Roman Empire ] )", "golden_entities": {"m.06cmp": "Roman Empire"}, "answer_entities": {"g.120phpf9": "", "m.0_g_73y": "Scythopolis", "m.05h20fb": "Cilicia"}}, {"question": "what did fred goodwin do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05cfvw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05cfvw ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Fred Goodwin ] )", "golden_entities": {"m.05cfvw": "Fred Goodwin"}, "answer_entities": {"m.012t_z": "Businessperson", "m.04p2dz": "Chartered Accountant"}}, {"question": "where is port charlotte florida located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rjvf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rjvf ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Port Charlotte ] )", "golden_entities": {"m.0rjvf": "Port Charlotte"}, "answer_entities": {"m.0jgk_": "Charlotte County"}}, {"question": "who is reba mcentire 's son", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01dpsv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01dpsv ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , children ] ) [ Reba McEntire ] ) )", "golden_entities": {"m.01dpsv": "Reba McEntire", "m.05zppz": "Male"}, "answer_entities": {"m.0n7wd1p": "Shelby Blackstock"}}, {"question": "what episode does eric northman come in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0411sjw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0411sjw ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.seasons ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , seasons ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Eric Northman ] ) )", "golden_entities": {"m.0411sjw": "Eric Northman"}, "answer_entities": {"m.04nvqjm": "True Blood Season 1", "m.07kd5nl": "True Blood Season 2", "m.0bh71z0": "True Blood Season 3", "m.0gfwvpj": "True Blood Season 4", "m.0j6tx9m": "True Blood Season 5", "m.0k6j758": "True Blood - Season 6", "m.0wj_9lr": "True Blood Season 7"}}, {"question": "what was elijah mccoy famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0199mw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0199mw ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Elijah McCoy ] )", "golden_entities": {"m.0199mw": "Elijah McCoy"}, "answer_entities": {"m.03sbb": "Inventor", "m.09j9h": "Engineer"}}, {"question": "who did john paul jones fight for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045bz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.045bz ns:military.military_person.service ?y .\n?y ns:military.military_service.military_force ?x .\n}\n", "logical_form": "( JOIN ( R [ military , military service , military force ] ) ( JOIN ( R [ military , military person , service ] ) [ John Paul Jones ] ) )", "golden_entities": {"m.045bz": "John Paul Jones"}, "answer_entities": {"m.021xtf": "Merchant Navy", "m.0268nz": "Continental Navy", "m.065y1n": "Imperial Russian Navy"}}, {"question": "where does hudson river start", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cvyp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cvyp ns:geography.river.origin ?x .\n}\n", "logical_form": "( JOIN ( R [ geography , river , origin ] ) [ Hudson River ] )", "golden_entities": {"m.0cvyp": "Hudson River"}, "answer_entities": {"m.07663d": "Lake Tear of the Clouds"}}, {"question": "where was brad paisley born and raised", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gr7w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gr7w ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Brad Paisley ] )", "golden_entities": {"m.03gr7w": "Brad Paisley"}, "answer_entities": {"m.010xmb": "Glen Dale"}}, {"question": "what is charlotte north carolina known for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fsb8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fsb8 ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Charlotte ] )", "golden_entities": {"m.0fsb8": "Charlotte"}, "answer_entities": {"m.02vnhrq": "Billy Graham Library", "m.03d5y3g": "Freedom Park", "m.03g_2kj": "Discovery Place", "m.04td00": "Carowinds", "m.05g_v0l": "Bojangles' Coliseum", "m.0635_7": "NASCAR Hall of Fame", "m.09k6h_2": "Bechtler Museum of Modern Art", "m.0c2m75": "U.S. National Whitewater Center", "m.0cq5c0": "Carolinas Aviation Museum", "m.0fxjdx": "North Carolina Blumenthal Performing Arts Center", "m.0g0c28": "North Carolina Performing Arts Center at Charlotte Foundation", "m.0gjc5k": "Land of Oz"}}, {"question": "where is glastonbury connecticut", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rdgt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rdgt ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Glastonbury ] )", "golden_entities": {"m.0rdgt": "Glastonbury"}, "answer_entities": {"m.01x73": "Connecticut", "m.09c7w0": "United States of America", "m.0m2gk": "Hartford County"}}, {"question": "what is george washington 's hometown", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034rd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034rd ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ George Washington ] )", "golden_entities": {"m.034rd": "George Washington"}, "answer_entities": {"m.0mmyl": "Westmoreland County"}}, {"question": "what is arlington texas zip code", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0nqph)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0nqph ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ Arlington ] )", "golden_entities": {"m.0nqph": "Arlington"}, "answer_entities": {"m.020yf_6": "76011", "m.020yfv7": "76017", "m.020yfw2": "76012", "m.020yfx2": "76010", "m.020yg3f": "76006", "m.020yg4f": "76018", "m.020yg58": "76015", "m.020yg73": "76013", "m.020ygcw": "76016", "m.020yhh7": "76014", "m.021df5f": "22202", "m.03dxw18": "76001", "m.03dxw1p": "76002", "m.07nqdlq": "76096", "m.07nqdm4": "76094", "m.07nqdmt": "76019", "m.07nqdn0": "76007", "m.07nqdn7": "76005", "m.07nqdng": "76004", "m.07nqdnp": "76003", "m.09sh2kb": "22202-5000"}}, {"question": "what instruments does katy perry play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03y82t6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03y82t6 ns:music.artist.track_contributions ?y .\n?y ns:music.track_contribution.role ?x .\n}\n", "logical_form": "( JOIN ( R [ music , track contribution , role ] ) ( JOIN ( R [ music , artist , track contributions ] ) [ Katy Perry ] ) )", "golden_entities": {"m.03y82t6": "Katy Perry"}, "answer_entities": {"m.0290ngj": "Vocals"}}, {"question": "who played mickey on days of our lives", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f778b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f778b ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Mickey Horton ] ) )", "golden_entities": {"m.0f778b": "Mickey Horton"}, "answer_entities": {"m.0345r9": "John Clarke", "m.044xpb": "John Ingle", "m.04mm_3": "Kevin Dobson"}}, {"question": "what movies does nicole kidman star in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05dbf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05dbf ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Nicole Kidman ] ) )", "golden_entities": {"m.05dbf": "Nicole Kidman"}, "answer_entities": {"m.011yxg": "Moulin Rouge!", "m.012hf4j4": "Genius", "m.012stndr": "Secret in Their Eyes", "m.01hr1": "Batman Forever", "m.01pvl7": "To Die For", "m.02_nsc": "Days of Thunder", "m.023g6w": "Dogville", "m.026hh0m": "The Invasion", "m.026qnh6": "Australia", "m.0279yx9": "No. 5 the Film", "m.029xhb": "Panic Room", "m.02cbhg": "Cold Mountain", "m.02qcr": "Eyes Wide Shut", "m.02rzvmr": "Margot at the Wedding", "m.032z3r": "Birthday Girl", "m.033pck": "Dead Calm", "m.034bm_": "Far and Away", "m.034qbx": "The Stepford Wives", "m.034scm": "The Peacemaker", "m.03lvwp": "The Portrait of a Lady", "m.03ntbmw": "The Human Stain", "m.03tsys": "Flirting", "m.03y062v": "The Leading Man", "m.046dr3": "Birth", "m.0479x3x": "Need", "m.04dsq7v": "Chase Through the Night", "m.04dsq98": "The Bit Part", "m.04dsqb0": "Skin Deep", "m.04dsqd4": "Matthew and Son", "m.04dsqdp": "Wills & Burke", "m.04dsqpq": "Room to Move", "m.04j2wxr": "Nightmaster", "m.04jplwp": "Nine", "m.04nnpw": "The Others", "m.04w4_f": "BMX Bandits", "m.04w7rn": "The Golden Compass", "m.05650n": "Happy Feet", "m.05fm6m": "Bewitched", "m.05k2xy": "The Interpreter", "m.06wmkz": "Malice", "m.07626w": "Fur", "m.07jd8j": "Bush Christmas", "m.07sc1vd": "Rabbit Hole", "m.08v5s3f": "The Rivals", "m.095zlp": "The Hours", "m.09gcrsw": "The Danish Girl", "m.09qh12": "Emerald City", "m.0bshwmp": "Just Go With It", "m.0cc703f": "Trespass", "m.0cc8620": "Hemingway & Gellhorn", "m.0cnxqm5": "Windrider", "m.0crs9nr": "Short: International Release #2", "m.0cy6r9": "Billy Bathgate", "m.0dd8wdq": "The Timidity of the Loverat", "m.0ds27b": "My Life", "m.0gkr31c": "Archer's Adventure", "m.0gx938d": "The Paperboy", "m.0gx9hr9": "Stoker", "m.0gx9j_c": "An Australian in Rome", "m.0jl14xf": "The Railway Man", "m.0m9tw": "Practical Magic", "m.0n5wg2n": "Grace of Monaco", "m.0ngns90": "Queen of the Desert", "m.0wy31xz": "Before I Go to Sleep", "m.0x0jk5v": "Paddington", "m.0zbdddm": "Strangerland", "m.0zcpz3h": "The Family Fang"}}, {"question": "where did kate chopin grow up", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d8pw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d8pw ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Kate Chopin ] )", "golden_entities": {"m.0d8pw": "Kate Chopin"}, "answer_entities": {"m.06wxw": "St. Louis"}}, {"question": "what is the newspaper in phoenix", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d35y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d35y ns:periodicals.newspaper_circulation_area.newspapers ?x .\n}\n", "logical_form": "( JOIN ( R [ periodicals , newspaper circulation area , newspapers ] ) [ Phoenix ] )", "golden_entities": {"m.0d35y": "Phoenix"}, "answer_entities": {"m.03cgzvj": "The Catholic Sun", "m.041jxp": "The Arizona Republic", "m.09kqp8": "Phoenix New Times", "m.0bmwns": "Phoenix Gazette"}}, {"question": "where is luke bryan from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vpng6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vpng6 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Luke Bryan ] )", "golden_entities": {"m.02vpng6": "Luke Bryan"}, "answer_entities": {"m.0rxrq": "Leesburg"}}, {"question": "where did captain james cook grow up", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_j8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_j8 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ James Cook ] )", "golden_entities": {"m.03_j8": "James Cook"}, "answer_entities": {"m.045_cx": "Marton"}}, {"question": "where is alex rodriguez from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01f492)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01f492 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Alex Rodriguez ] )", "golden_entities": {"m.01f492": "Alex Rodriguez"}, "answer_entities": {"m.018z6h": "Washington Heights"}}, {"question": "who invented morse code", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04sb4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04sb4 ns:law.invention.inventor ?x .\n}\n", "logical_form": "( JOIN ( R [ law , invention , inventor ] ) [ Morse code ] )", "golden_entities": {"m.04sb4": "Morse code"}, "answer_entities": {"m.06q6n": "Samuel Morse"}}, {"question": "what is the political system in england", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02jx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02jx1 ns:location.country.form_of_government ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , form of government ] ) [ England ] )", "golden_entities": {"m.02jx1": "England"}, "answer_entities": {"m.01q20": "Constitutional monarchy", "m.07mq4k": "Constituent country"}}, {"question": "what does rupert murdoch own 2012", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06hrk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06hrk ns:organization.organization_founder.organizations_founded ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization founder , organizations founded ] ) [ Rupert Murdoch ] )", "golden_entities": {"m.06hrk": "Rupert Murdoch"}, "answer_entities": {"m.02z_b": "Fox News Channel", "m.03p1p8r": "British Sky Broadcasting", "m.04w2dc": "Fox Television Stations", "m.05bgd7": "Sky Italia", "m.08v17y": "Sky Television plc", "m.0cjdk": "FOX", "m.0gjb3y5": "STAR India", "m.0n_hqj6": "21st Century Fox", "m.0sxdg": "News Corporation", "m.0vsck0t": "News Corp"}}, {"question": "what did sammy davis jr die of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bmlb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bmlb ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Sammy Davis, Jr. ] )", "golden_entities": {"m.01bmlb": "Sammy Davis, Jr."}, "answer_entities": {"m.021plp": "Laryngeal cancer", "m.054rzc": "Complication"}}, {"question": "what did anna nicole smith died from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hwfl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hwfl ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Anna Nicole Smith ] )", "golden_entities": {"m.0hwfl": "Anna Nicole Smith"}, "answer_entities": {"m.01tf_6": "Drug overdose"}}, {"question": "what year did dwayne wade came to the nba", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03l295)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03l295 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Dwyane Wade ] ) )", "golden_entities": {"m.03l295": "Dwyane Wade"}, "answer_entities": {"m.038c0q": "2003 NBA draft"}}, {"question": "what religion does tom cruise follow", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07r1h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07r1h ns:base.popstra.celebrity.religion ?y .\n?y ns:base.popstra.religion_choice.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ base , popstra , religion choice , religion ] ) ( JOIN ( R [ base , popstra , celebrity , religion ] ) [ Tom Cruise ] ) )", "golden_entities": {"m.07r1h": "Tom Cruise"}, "answer_entities": {"m.06nzl": "Scientology"}}, {"question": "what language do lakota indians speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fk39)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fk39 ns:people.ethnicity.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ people , ethnicity , languages spoken ] ) [ Lakota people ] )", "golden_entities": {"m.0fk39": "Lakota people"}, "answer_entities": {"m.02h40lc": "English Language", "m.02k899": "Lakota Language"}}, {"question": "what money is used in the ukraine", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07t21)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07t21 ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Ukraine ] )", "golden_entities": {"m.07t21": "Ukraine"}, "answer_entities": {"m.035qkb": "Ukrainian hryvnia"}}, {"question": "where did ayn rand live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h25)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h25 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Ayn Rand ] ) )", "golden_entities": {"m.0h25": "Ayn Rand"}, "answer_entities": {"m.06pr6": "Saint Petersburg"}}, {"question": "when was the civil war in libya", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gfhg1y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gfhg1y ns:time.event.start_date ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , start date ] ) [ Libyan Civil War ] )", "golden_entities": {"m.0gfhg1y": "Libyan Civil War"}, "answer_entities": {"value": "2011-02-15"}}, {"question": "what influenced roy lichtenstein artwork", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gcgd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gcgd ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Roy Lichtenstein ] )", "golden_entities": {"m.0gcgd": "Roy Lichtenstein"}, "answer_entities": {"m.01sj_s": "Robert Rauschenberg", "m.04187y": "Allan Kaprow", "m.0gcjf": "Jasper Johns"}}, {"question": "where is kentucky located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0498y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0498y ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Kentucky ] )", "golden_entities": {"m.0498y": "Kentucky"}, "answer_entities": {"m.04_1l0v": "Contiguous United States", "m.09c7w0": "United States of America", "m.0hzc9m5": "United States, with Territories"}}, {"question": "where john tyler was born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042dk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042dk ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ John Tyler ] )", "golden_entities": {"m.042dk": "John Tyler"}, "answer_entities": {"m.0mp6c": "Charles City County"}}, {"question": "what place did thomas jefferson died", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07cbs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07cbs ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Thomas Jefferson ] )", "golden_entities": {"m.07cbs": "Thomas Jefferson"}, "answer_entities": {"m.0mp3l": "Charlottesville"}}, {"question": "what is the time zone in france", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f8l9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f8l9c ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ France ] )", "golden_entities": {"m.0f8l9c": "France"}, "answer_entities": {"m.02llzg": "Central European Time Zone"}}]