[{"question": "where did bob barker grow up", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ydhd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ydhd ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Bob Barker ] )", "golden_entities": {"m.01ydhd": "Bob Barker"}, "answer_entities": {"m.010th_": "Darrington"}}, {"question": "what are king charles spaniels", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04nmst)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04nmst ns:biology.animal_breed.breed_of ?x .\n}\n", "logical_form": "( JOIN ( R [ biology , animal breed , breed of ] ) [ King Charles Spaniel ] )", "golden_entities": {"m.04nmst": "King Charles Spaniel"}, "answer_entities": {"m.0bt9lr": "Dog"}}, {"question": "what year did the new york mets start", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g76)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g76 ns:sports.sports_team.founded ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , founded ] ) [ New York Mets ] )", "golden_entities": {"m.05g76": "New York Mets"}, "answer_entities": {"value": "1962"}}, {"question": "where did neil gaiman grow up", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05jm7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05jm7 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Neil Gaiman ] )", "golden_entities": {"m.05jm7": "Neil Gaiman"}, "answer_entities": {"m.022mpz": "Portchester"}}, {"question": "what books did aristotle wrote", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gz_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gz_ ns:book.author.book_editions_published ?x .\n}\n", "logical_form": "( JOIN ( R [ book , author , book editions published ] ) [ Aristotle ] )", "golden_entities": {"m.0gz_": "Aristotle"}, "answer_entities": {"m.059c9_l": "Nicomachean ethics", "m.059cb02": "Nicomachean ethics.", "m.059cb0l": "The Nicomachean ethics", "m.059cb12": "Nicomachean ethics", "m.059cb1l": "Nicomachean ethics", "m.059cb22": "Nicomachean ethics", "m.059cb2m": "The Nicomachean ethics", "m.059cb33": "The Nicomachean ethics", "m.059cb45": "The Nicomachean Ethics", "m.059cb4g": "The Nicomachean Ethics", "m.059cb4r": "Nicomachean Ethics", "m.059cb51": "Nicomachean Ethics", "m.059cb5d": "The Nicomachean Ethics", "m.059cb6h": "Nicomachean ethics", "m.059cb6z": "Nicomachean ethics.", "m.059cb7f": "The Nicomachean ethics", "m.059cb7w": "The Nicomachean ethics", "m.059cb8b": "Nicomachean ethics", "m.059cb8s": "The Nicomachean ethics", "m.059cb96": "Nicomachean ethics", "m.059cb9n": "The Nicomachean ethics", "m.059cbb2": "Nicomachean ethics", "m.059cbbl": "Nicomachean ethics", "m.059cbc0": "Nicomachean ethics", "m.059cbch": "The Nicomachean Ethics (Penguin Classics)", "m.059cbcs": "Nicomachean Ethics (Large Print)", "m.059cbd2": "Nicomachean Ethics (Loeb Classical Library\u00ae)", "m.059cbdd": "The Nicomachean Ethics (Great Books in Philosophy)", "m.059cbdq": "The Nicomachean Ethics (Wordsworth Classics) (Wordsworth Classics)"}}, {"question": "where is eu headquarters located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0_6t_z8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0_6t_z8 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ European Union ] ) )", "golden_entities": {"m.0_6t_z8": "European Union"}, "answer_entities": {"m.02rnbv": "City of Brussels"}}, {"question": "who runs the cornelia marie now", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02qn24x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02qn24x ns:boats.ship.owners ?y .\n?y ns:boats.ship_ownership.owner ?x .\n}\n", "logical_form": "( JOIN ( R [ boats , ship ownership , owner ] ) ( JOIN ( R [ boats , ship , owners ] ) [ FV Cornelia Marie ] ) )", "golden_entities": {"m.02qn24x": "FV Cornelia Marie"}, "answer_entities": {"m.0j2sdt9": "Jake Harris", "m.0j2sdtm": "F/V Cornelia Marie, LLC", "m.0j2sdty": "Josh Harris"}}, {"question": "where did john muir die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01fhry)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01fhry ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ John Muir ] )", "golden_entities": {"m.01fhry": "John Muir"}, "answer_entities": {"m.030qb3t": "Los Angeles"}}, {"question": "what countries are in the andean region", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0p2n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0p2n ns:location.location.partially_containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , partially containedby ] ) [ Andes ] ) )", "golden_entities": {"m.0p2n": "Andes", "m.01mp": "Country"}, "answer_entities": {"m.0165v": "Bolivia", "m.016wzw": "Peru", "m.01ls2": "Colombia", "m.01p1v": "Chile", "m.02k1b": "Ecuador", "m.07ylj": "Venezuela", "m.0jgd": "Argentina"}}, {"question": "what country was george washington from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034rd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034rd ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ George Washington ] )", "golden_entities": {"m.034rd": "George Washington"}, "answer_entities": {"m.02p89zz": "British America"}}, {"question": "what year did pete rose play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dxg6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dxg6 ns:baseball.baseball_player.batting_stats ?y .\n?y ns:baseball.batting_statistics.season ?x .\n}\n", "logical_form": "( JOIN ( R [ baseball , batting statistics , season ] ) ( JOIN ( R [ baseball , baseball player , batting stats ] ) [ Pete Rose ] ) )", "golden_entities": {"m.0dxg6": "Pete Rose"}, "answer_entities": {"m.027pwzc": "1985 Major League Baseball season", "m.02h7s1h": "1973 Major League Baseball Season", "m.02h7s1n": "1964 Major League Baseball Season", "m.02h7s1t": "1982 Major League Baseball Season", "m.02h7s28": "1966 Major League Baseball Season", "m.02h7s2f": "1971 Major League Baseball Season", "m.02h7s31": "1963 Major League Baseball Season", "m.02h7s36": "1978 Major League Baseball Season", "m.02h7s3j": "1970 Major League Baseball Season", "m.02h7s3p": "1979 Major League Baseball Season", "m.02h7s4s": "1967 Major League Baseball Season", "m.02h7s52": "1984 Major League Baseball Season", "m.02h7s5k": "1983 Major League Baseball Season", "m.02h7s5q": "1976 Major League Baseball Season", "m.02h7s6b": "1972 Major League Baseball Season", "m.02h7s78": "1981 Major League Baseball Season", "m.02h7s7r": "1975 Major League Baseball Season", "m.02h7s81": "1977 Major League Baseball Season", "m.02h7s8c": "1980 Major League Baseball Season", "m.02h7s9g": "1974 Major League Baseball Season", "m.02h7sbd": "1968 Major League Baseball Season", "m.02h7sbq": "1986 Major League Baseball Season", "m.02h7sd3": "1969 Major League Baseball Season", "m.05kcgsf": "1965 Major League Baseball Season"}}, {"question": "where does kyla ross live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09glsjp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09glsjp ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Kyla Ross ] ) )", "golden_entities": {"m.09glsjp": "Kyla Ross"}, "answer_entities": {"m.0r29m": "Aliso Viejo"}}, {"question": "what has anna kendrick been in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04066xj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04066xj ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Anna Kendrick ] ) )", "golden_entities": {"m.04066xj": "Anna Kendrick"}, "answer_entities": {"g.11b6v7j7y9": "Mike and Dave Need Wedding Dates", "m.0105n27v": "Cake", "m.011jhcqv": "The Hollars", "m.011jt0_l": "Digging for Fire", "m.0123kwtx": "Mr. Right", "m.012nlb0j": "The Accountant", "m.013bfwl1": "Table 19", "m.027sfwn": "Rocket Science", "m.03nm_fh": "Twilight", "m.04n33f0": "The Marc Pease Experience", "m.05pdh86": "The Twilight Saga: New Moon", "m.05t0_2v": "Scott Pilgrim vs. the World", "m.06_x996": "Up in the Air", "m.0728fz": "Camp", "m.075wx7_": "Eclipse", "m.075wx89": "The Twilight Saga: Breaking Dawn - Part 1", "m.0cmdwwg": "50/50", "m.0czd7xd": "Elsewhere", "m.0djz0rc": "The Twilight Saga: Breaking Dawn - Part 2", "m.0gtsxr4": "ParaNorman", "m.0gwdqfj": "What to Expect When You're Expecting", "m.0gz6b6g": "End of Watch", "m.0h16nwt": "Rapture-Palooza", "m.0h97w42": "The Company You Keep", "m.0hr6d1j": "Pitch Perfect", "m.0n5zm57": "Get a Job", "m.0n5zm5k": "Drinking Buddies", "m.0p8xf5w": "Trolls", "m.0v998k8": "Wish I Was Here", "m.0w1dkh1": "The Last Five Years", "m.0w29f81": "The Voices", "m.0w29fxm": "Happy Christmas", "m.0w2sx8x": "Into the Woods", "m.0wdnycs": "Life After Beth", "m.0y4nmtc": "Pitch Perfect 2"}}, {"question": "what are the team colors for the pittsburgh steelers", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05tfm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05tfm ns:sports.sports_team.colors ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , colors ] ) [ Pittsburgh Steelers ] )", "golden_entities": {"m.05tfm": "Pittsburgh Steelers"}, "answer_entities": {"m.019sc": "Black", "m.01l849": "Gold", "m.083jv": "White"}}, {"question": "what did roy rogers die of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mc6h1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mc6h1 ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Roy Rogers ] )", "golden_entities": {"m.01mc6h1": "Roy Rogers"}, "answer_entities": {"m.01l2m3": "Heart failure"}}, {"question": "what is calabria italy", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c61p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c61p ns:common.topic.notable_types ?x .\n}\n", "logical_form": "( JOIN ( R [ common , topic , notable types ] ) [ Calabria ] )", "golden_entities": {"m.0c61p": "Calabria"}, "answer_entities": {"m.02_1y_3": "Italian region"}}, {"question": "what years did andrew jackson run for president", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rlz ns:government.politician.election_campaigns ?x .\n}\n", "logical_form": "( JOIN ( R [ government , politician , election campaigns ] ) [ Andrew Jackson ] )", "golden_entities": {"m.0rlz": "Andrew Jackson"}, "answer_entities": {"m.04dnyqg": "Andrew Jackson Presidential Campaign, 1824", "m.04dnyvt": "Andrew Jackson Presidential Campaign, 1828", "m.04dnyy4": "Andrew Jackson Presidential Campaign, 1832"}}, {"question": "what 4 countries make up great britain", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034cm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034cm ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ Great Britain ] ) )", "golden_entities": {"m.034cm": "Great Britain", "m.01mp": "Country"}, "answer_entities": {"m.025ndl": "Kingdom of Scotland", "m.02jx1": "England", "m.0576g9": "Principality of Wales"}}, {"question": "how many languages are there in the philippines", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05v8c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05v8c ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Philippines ] )", "golden_entities": {"m.05v8c": "Philippines"}, "answer_entities": {"m.01jb8r": "Filipino language", "m.01zfd7": "Cebuano language", "m.025hmd": "Ilokano language", "m.02h40lc": "English Language", "m.02hxntx": "Waray-Waray Language", "m.02p9hz": "Pangasinan Language", "m.032db0": "Hiligaynon language", "m.03323g": "Kapampangan language", "m.07qv_": "Tagalog language"}}, {"question": "where is the columbia university located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01cf5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01cf5 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Barnard College ] )", "golden_entities": {"m.01cf5": "Barnard College"}, "answer_entities": {"m.02_286": "New York City", "m.059rby": "New York", "m.09c7w0": "United States of America"}}, {"question": "what did the scientist thomson discover", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j68z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j68z ns:symbols.name_source.namesakes ?x .\n}\n", "logical_form": "( JOIN ( R [ symbols , name source , namesakes ] ) [ Joseph John Thomson ] )", "golden_entities": {"m.0j68z": "Joseph John Thomson"}, "answer_entities": {"m.02xz0f": "Thomson scattering", "m.03ycsl": "Thomson", "m.08rnn2": "Thomson problem", "m.0ctgpr": "Thomson"}}, {"question": "where did john boehner come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.039rwf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.039rwf ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ John Boehner ] )", "golden_entities": {"m.039rwf": "John Boehner"}, "answer_entities": {"m.0yy2f": "Reading"}}, {"question": "what did julian fellowes write", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05mcjs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05mcjs ns:book.author.works_written ?x .\n}\n", "logical_form": "( JOIN ( R [ book , author , works written ] ) [ Julian Fellowes ] )", "golden_entities": {"m.05mcjs": "Julian Fellowes"}, "answer_entities": {"m.04t4zhj": "The Curious Adventures of the Abandoned Toys", "m.04t4zj0": "Gosford Park", "m.06lwf82": "Little Lord Fauntleroy's Victorian society", "m.09ynmb": "Mary Poppins", "m.0c1v8yb": "Past imperfect", "m.0dkd0z": "Snobs"}}, {"question": "where does selena gomez live map", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gs6vr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gs6vr ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Selena Gomez ] ) )", "golden_entities": {"m.0gs6vr": "Selena Gomez"}, "answer_entities": {"m.02_286": "New York City"}}, {"question": "what is venus named for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09bcm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09bcm ns:symbols.namesake.named_after ?x .\n}\n", "logical_form": "( JOIN ( R [ symbols , namesake , named after ] ) [ Venus ] )", "golden_entities": {"m.09bcm": "Venus"}, "answer_entities": {"m.09cxs": "Venus"}}, {"question": "who did john fox coach for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06_73l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06_73l ns:sports.sports_team_coach.teams_coached ?y .\n?y ns:sports.sports_team_coach_tenure.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team coach tenure , team ] ) ( JOIN ( R [ sports , sports team coach , teams coached ] ) [ John Fox ] ) )", "golden_entities": {"m.06_73l": "John Fox"}, "answer_entities": {"m.01y3c": "Carolina Panthers", "m.0289q": "Denver Broncos"}}, {"question": "what years have the dodgers won the world series", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04mjl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04mjl ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Los Angeles Dodgers ] )", "golden_entities": {"m.04mjl": "Los Angeles Dodgers"}, "answer_entities": {"m.04j7dq": "1981 World Series", "m.04j7ml": "1988 World Series", "m.04tfkz": "1965 World Series", "m.04tfp1": "1963 World Series", "m.04tfrv": "1959 World Series"}}, {"question": "what did farrah have surgery for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01j851)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01j851 ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n", "logical_form": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ Farrah Fawcett ] )", "golden_entities": {"m.01j851": "Farrah Fawcett"}, "answer_entities": {"m.02vxm4": "Anal cancer"}}, {"question": "who owns the cleveland browns", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xvb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xvb ns:sports.professional_sports_team.owner_s ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , professional sports team , owner s ] ) [ Cleveland Browns ] )", "golden_entities": {"m.01xvb": "Cleveland Browns"}, "answer_entities": {"m.0b84nt": "Randy Lerner"}}, {"question": "what language do jewish speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.041rx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.041rx ns:people.ethnicity.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ people , ethnicity , languages spoken ] ) [ Jewish people ] )", "golden_entities": {"m.041rx": "Jewish people"}, "answer_entities": {"m.02h40lc": "English Language", "m.02hx72b": "Judeo-Berber Language", "m.02q7hd1": "Jud\u00e6o-Persian dialects", "m.033qhv": "Judeo-Arabic languages", "m.033r5w": "Karaim Language", "m.0394p3": "Judeo-Italian Language", "m.039d68": "Biblical Hebrew", "m.03cp6j": "Biblical Aramaic", "m.03hkp": "Hebrew Language", "m.03wxv4": "Yevanic language", "m.04p7x": "Ladino Language", "m.04x5zg": "Lishana Deni Language", "m.04x6fd": "Lish\u00e1n Did\u00e1n Language", "m.04x7hz": "Lishanid Noshan Language", "m.04zxk0": "Hulaul\u00e1 Language", "m.057k1c": "Judeo-Aramaic languages", "m.05k_d6": "Judeo-Tat Language", "m.05m7l7": "Kayla dialect", "m.05mcpc": "Judeo-Malayalam", "m.05p1ky": "Judaeo-Portuguese", "m.05pfcj": "Jud\u00e6o-Catalan", "m.064_8sq": "French", "m.06b_j": "Russian Language", "m.06nm1": "Spanish Language", "m.0880p": "Yiddish Language"}}, {"question": "what airport is closer to downtown houston", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03l2n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03l2n ns:location.location.nearby_airports ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , nearby airports ] ) [ Houston ] )", "golden_entities": {"m.03l2n": "Houston"}, "answer_entities": {"m.0136st": "George Bush Intercontinental Airport", "m.01k_yv": "Ellington Airport", "m.01kyd9": "William P. Hobby Airport", "m.03nr98z": "West Houston Airport", "m.03nr9n_": "Pearland Regional Airport", "m.03nr9sf": "Houston Southwest Airport", "m.03ns7k6": "Lone Star Executive Airport", "m.0417b3c": "Weiser Air Park", "m.04181rz": "Westheimer Air Park", "m.04lf_z3": "Dan Jones International Airport", "m.04lg049": "Houston Fort Bend Airport", "m.04lh7kl": "Houston Executive Airport", "m.04zw7jj": "Houston Gulf Airport", "m.0744_b": "Sugar Land Regional Airport", "m.0bgpss": "David Wayne Hooks Memorial Airport"}}, {"question": "what city is fc schalke 04 in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.024_ql)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.024_ql ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ FC Schalke 04 ] ) )", "golden_entities": {"m.024_ql": "FC Schalke 04"}, "answer_entities": {"m.018fc9": "Gelsenkirchen"}}, {"question": "where did giovanni da verrazano come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k6d2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k6d2 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Giovanni da Verrazzano ] )", "golden_entities": {"m.0k6d2": "Giovanni da Verrazzano"}, "answer_entities": {"m.0c33cs": "Greve in Chianti"}}, {"question": "what airport is close to daytona beach florida", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rsjf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rsjf ns:location.location.nearby_airports ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , nearby airports ] ) [ Daytona Beach ] )", "golden_entities": {"m.0rsjf": "Daytona Beach"}, "answer_entities": {"m.02w45sm": "Spruce Creek Airport", "m.03byvk1": "Massey Ranch Airpark", "m.07jwl0": "Daytona Beach International Airport"}}, {"question": "what group is aubrey o'day in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dpd2h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dpd2h ns:music.group_member.membership ?y .\n?y ns:music.group_membership.group ?x .\n}\n", "logical_form": "( JOIN ( R [ music , group membership , group ] ) ( JOIN ( R [ music , group member , membership ] ) [ Aubrey O'Day ] ) )", "golden_entities": {"m.0dpd2h": "Aubrey O'Day"}, "answer_entities": {"m.0134hbzj": "Dumblonde", "m.0dtmg6": "Danity Kane"}}, {"question": "who invented arabic alphabet", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xn6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xn6 ns:language.language_writing_system.parent_writing_systems ?x .\n}\n", "logical_form": "( JOIN ( R [ language , language writing system , parent writing systems ] ) [ Arabic alphabet ] )", "golden_entities": {"m.0xn6": "Arabic alphabet"}, "answer_entities": {"m.05gpzl": "Proto-Canaanite alphabet"}}, {"question": "where was president lyndon johnson from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f7fy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f7fy ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Lyndon B. Johnson ] )", "golden_entities": {"m.0f7fy": "Lyndon B. Johnson"}, "answer_entities": {"m.0101sj": "Stonewall"}}, {"question": "what years did barry bonds play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01dk_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01dk_ ns:baseball.baseball_player.batting_stats ?y .\n?y ns:baseball.batting_statistics.season ?x .\n}\n", "logical_form": "( JOIN ( R [ baseball , batting statistics , season ] ) ( JOIN ( R [ baseball , baseball player , batting stats ] ) [ Barry Bonds ] ) )", "golden_entities": {"m.01dk_": "Barry Bonds"}, "answer_entities": {"m.025ygqm": "2004 Major League Baseball season", "m.025ygws": "2003 Major League Baseball season", "m.026fmqm": "2000 Major League Baseball season", "m.027mvrc": "2006 Major League Baseball season", "m.0285r5d": "2007 Major League Baseball season", "m.02h7r_9": "1993 Major League Baseball Season", "m.02h7rz_": "1989 Major League Baseball Season", "m.02h7s0d": "2002 Major League Baseball Season", "m.02h7s15": "1995 Major League Baseball Season", "m.02h7s1b": "1992 Major League Baseball Season", "m.02h7s1z": "1988 Major League Baseball Season", "m.02h7s2l": "1987 Major League Baseball Season", "m.02h7s57": "1991 Major League Baseball Season", "m.02h7s86": "1990 Major League Baseball Season", "m.02h7s8p": "1994 Major League Baseball Season", "m.02h7sbq": "1986 Major League Baseball Season", "m.02h7sbw": "1996 Major League Baseball Season", "m.02h7sch": "1998 Major League Baseball Season", "m.02h7sct": "1999 Major League Baseball Season", "m.02h7sd8": "1997 Major League Baseball Season", "m.02h7sdf": "2001 Major League Baseball Season", "m.0dx84s": "2005 Major League Baseball season"}}, {"question": "who played emma frost", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.033pl2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.033pl2 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Emma Frost ] ) )", "golden_entities": {"m.033pl2": "Emma Frost"}, "answer_entities": {"m.03509l": "Finola Hughes", "m.03v1jf": "January Jones", "m.0fs1sc": "Tahyna Tozzi"}}, {"question": "what clubs has peter crouch played for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03y5_6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03y5_6 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Peter Crouch ] ) )", "golden_entities": {"m.03y5_6": "Peter Crouch"}, "answer_entities": {"m.01cwm1": "Stoke City F.C.", "m.02qhlm": "Portsmouth F.C.", "m.04ltf": "Liverpool F.C.", "m.0bl8l": "Aston Villa F.C.", "m.0hvjr": "Tottenham Hotspur F.C.", "m.0k_l4": "Southampton F.C.", "m.0ljbg": "Queens Park Rangers F.C. in European football"}}, {"question": "where is the syracuse university", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.078bz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.078bz ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Syracuse University ] )", "golden_entities": {"m.078bz": "Syracuse University"}, "answer_entities": {"m.059rby": "New York", "m.071cn": "Syracuse", "m.09c7w0": "United States of America"}}, {"question": "what has mario lopez been in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02w5q6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02w5q6 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Mario Lopez ] ) )", "golden_entities": {"m.02w5q6": "Mario Lopez"}, "answer_entities": {"m.0261c2_": "Saved by the Bell: Wedding in Las Vegas", "m.026mcr5": "Aloha, Scooby-Doo!", "m.02qrsmm": "Saved by the Bell: Hawaiian Style", "m.03grjz7": "Holiday in Handcuffs", "m.03m7584": "Husband for Hire", "m.04j2ftt": "Breaking the Surface: The Greg Louganis Story", "m.04j2k0y": "Killing Mr. Griffin", "m.04j301y": "Eastside", "m.05_5_22": "Get Him to the Greek", "m.06plw2": "Colors", "m.06qxnz": "A Crack in the Floor", "m.09g9kh9": "The Dog Who Saved Christmas", "m.09kk_4": "Fever Lake", "m.0c014wb": "Honey 2", "m.0c3twgr": "Outta Time", "m.0cs08lb": "Depraved", "m.0czc86": "Big Brother Trouble", "m.0dgrklv": "The Dog Who Saved Christmas Vacation", "m.0h4hl9": "King Rikki"}}, {"question": "when did mcdonalds officially open", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07gyp7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07gyp7 ns:organization.organization.date_founded ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , date founded ] ) [ McDonald's ] )", "golden_entities": {"m.07gyp7": "McDonald's"}, "answer_entities": {"value": "1940-05-15"}}, {"question": "where is lake waynoka ohio", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027_7y_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027_7y_ ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Lake Waynoka, Ohio ] )", "golden_entities": {"m.027_7y_": "Lake Waynoka, Ohio"}, "answer_entities": {"m.09c7w0": "United States of America", "m.0n2sv": "Brown County"}}, {"question": "who played emperor palpatine", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_5s0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_5s0 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ The Emperor ] ) )", "golden_entities": {"m.03_5s0": "The Emperor"}, "answer_entities": {"m.03sj0m": "Ian McDiarmid", "m.04f47_": "Clive Revill", "m.090_hs": "Ian Abercrombie", "m.0gbz5p4": "Ron Prather"}}]