[{"question": "where is the world series 2012 being played", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ds8qct)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ds8qct ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ 2012 World Series ] )", "golden_entities": {"m.0ds8qct": "2012 World Series"}, "answer_entities": {"m.01_gsg": "AT&T Park", "m.01wn2j": "Comerica Park"}}, {"question": "what kind of language do irish speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03bkbh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03bkbh ns:people.ethnicity.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ people , ethnicity , languages spoken ] ) [ Irish people ] )", "golden_entities": {"m.03bkbh": "Irish people"}, "answer_entities": {"m.0165vf": "Ulster Scots dialects", "m.01bx1n": "Shelta Language", "m.02h40lc": "English Language", "m.03nyl": "Hiberno-English", "m.03x42": "Irish", "m.0h407": "Scots Language"}}, {"question": "where was dwight howard born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02fg_f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02fg_f ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Dwight Howard ] )", "golden_entities": {"m.02fg_f": "Dwight Howard"}, "answer_entities": {"m.013yq": "Atlanta"}}, {"question": "what timezone is texas san antonio in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f2w0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f2w0 ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ San Antonio ] )", "golden_entities": {"m.0f2w0": "San Antonio"}, "answer_entities": {"m.02fqwt": "Central Time Zone"}}, {"question": "where is alexandria located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.013g3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.013g3 ns:base.biblioness.bibs_location.country ?x .\n}\n", "logical_form": "( JOIN ( R [ base , biblioness , bibs location , country ] ) [ Alexandria ] )", "golden_entities": {"m.013g3": "Alexandria"}, "answer_entities": {"m.02k54": "Egypt"}}, {"question": "when did the raiders win the superbowl", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05l71)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05l71 ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Oakland Raiders ] )", "golden_entities": {"m.05l71": "Oakland Raiders"}, "answer_entities": {"m.0_gt_px": "2003 AFC Championship Game", "m.02r9cp7": "1967 American Football League Championship Game", "m.076ps": "Super Bowl XI", "m.076r4": "Super Bowl XV", "m.076s5": "Super Bowl XVIII"}}, {"question": "where did pixie lott go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05p300p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05p300p ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Pixie Lott ] ) )", "golden_entities": {"m.05p300p": "Pixie Lott"}, "answer_entities": {"m.08tyb_": "Italia Conti Academy of Theatre Arts"}}, {"question": "what date did we invade iraq", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01cpp0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01cpp0 ns:time.event.start_date ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , start date ] ) [ 2003 invasion of Iraq ] )", "golden_entities": {"m.01cpp0": "2003 invasion of Iraq"}, "answer_entities": {"value": "2003-03-20"}}, {"question": "what is the new orleans hornets new name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jm6n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jm6n ns:type.object.name ?x .\n}\n", "logical_form": "( JOIN ( R [ type , object , name ] ) [ New Orleans Pelicans ] )", "golden_entities": {"m.0jm6n": "New Orleans Pelicans"}, "answer_entities": {"value": "New Orleans Pelicans"}}, {"question": "what do the buddha believe in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015k7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015k7 ns:people.person.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , religion ] ) [ Gautama Buddha ] )", "golden_entities": {"m.015k7": "Gautama Buddha"}, "answer_entities": {"m.092bf5": "Buddhism"}}, {"question": "what is the name of walt disney 's son", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081nh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081nh ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , children ] ) [ Walt Disney ] ) )", "golden_entities": {"m.081nh": "Walt Disney", "m.05zppz": "Male"}, "answer_entities": {}}, {"question": "what is yale university mascot", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08815)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08815 ns:education.educational_institution.mascot ?x .\n}\n", "logical_form": "( JOIN ( R [ education , educational institution , mascot ] ) [ University Yale ] )", "golden_entities": {"m.08815": "University Yale"}, "answer_entities": {"m.05ty1h": "Yale University Handsome Dan"}}, {"question": "what is the currency used in tunisia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07fj_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07fj_ ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Tunisia ] )", "golden_entities": {"m.07fj_": "Tunisia"}, "answer_entities": {"m.04z4ml": "Tunisian dinar"}}, {"question": "what language group does polish belong to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qqm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qqm ns:base.rosetta.languoid.parent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , rosetta , languoid , parent ] ) [ Polish Language ] )", "golden_entities": {"m.05qqm": "Polish Language"}, "answer_entities": {"m.013bdx": "Lechitic languages"}}, {"question": "what is the name of the new orleans saints football stadium", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g3v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g3v ns:sports.sports_team.arena_stadium ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ New Orleans Saints ] )", "golden_entities": {"m.05g3v": "New Orleans Saints"}, "answer_entities": {"m.02y3xn": "Mercedes-Benz Superdome"}}, {"question": "what type of music was scott joplin noted for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07b69)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07b69 ns:music.artist.genre ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , genre ] ) [ Scott Joplin ] )", "golden_entities": {"m.07b69": "Scott Joplin"}, "answer_entities": {"m.06m6j": "Ragtime", "m.0cdr_y": "March"}}, {"question": "where is adam smith from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0tfc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0tfc ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Adam Smith ] )", "golden_entities": {"m.0tfc": "Adam Smith"}, "answer_entities": {"m.01zrs_": "Kirkcaldy"}}, {"question": "who became president after harding died", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081t6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081t6 ns:government.us_president.vice_president ?x .\n}\n", "logical_form": "( JOIN ( R [ government , us president , vice president ] ) [ Warren G. Harding ] )", "golden_entities": {"m.081t6": "Warren G. Harding"}, "answer_entities": {"m.01vbl": "Calvin Coolidge"}}, {"question": "what illnesses did george washington have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034rd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034rd ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n", "logical_form": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ George Washington ] )", "golden_entities": {"m.034rd": "George Washington"}, "answer_entities": {"m.0542n": "Malaria", "m.06vr2": "Smallpox", "m.07jwr": "Tuberculosis"}}, {"question": "where is north port florida located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01z_vzm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01z_vzm ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ North Port ] )", "golden_entities": {"m.01z_vzm": "North Port"}, "answer_entities": {"m.0jxkf": "Sarasota County"}}, {"question": "who is abraham maslow", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r_fw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r_fw ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Abraham Maslow ] )", "golden_entities": {"m.01r_fw": "Abraham Maslow"}, "answer_entities": {"m.0cbd2": "Writer", "m.0jgxn": "Psychologist"}}, {"question": "where did the cuban missile crisis happen", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01zxx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01zxx ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ Cuban Missile Crisis ] )", "golden_entities": {"m.01zxx": "Cuban Missile Crisis"}, "answer_entities": {"m.02613": "Caribbean Sea", "m.0d04z6": "Cuba"}}, {"question": "where is port lavaca tx", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0_z4x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0_z4x ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Port Lavaca ] )", "golden_entities": {"m.0_z4x": "Port Lavaca"}, "answer_entities": {"m.0msd9": "Calhoun County"}}, {"question": "what business does raj kundra do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09k687g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09k687g ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Raj Kundra ] )", "golden_entities": {"m.09k687g": "Raj Kundra"}, "answer_entities": {"m.012t_z": "Businessperson", "m.01d_h8": "Film Producer", "m.09x_r": "Entrepreneur"}}, {"question": "what movies is molly ringwald in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wq0_s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wq0_s ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Molly Ringwald ] ) )", "golden_entities": {"m.01wq0_s": "Molly Ringwald"}, "answer_entities": {"m.0_yhrr2": "Seven Sundays", "m.010cn719": "Jem and the Holograms", "m.011v9f35": "Wishin' and Hopin'", "m.0131kchr": "Bad Night", "m.01mr4c": "Malicious", "m.027lcnq": "The Pick-up Artist", "m.027p1_v": "Tempest", "m.02bg6w": "Pretty in Pink", "m.02z1r_c": "Something to Live for: The Alison Gertz Story", "m.02z4r3w": "King Lear", "m.032xrj": "Sixteen Candles", "m.03bxbk": "Teaching Mrs. Tingle", "m.03cc4f1": "Cut", "m.03hnq1p": "The Wives He Forgot", "m.03j0jy": "Some Folks Call It a Sling Blade", "m.04bb7p": "Office Killer", "m.04j0xrf": "Women & Men: Stories of Seduction", "m.04j1g1n": "Daddy Who?", "m.04j1xh2": "Johnny Appleseed", "m.04j28vl": "In the Weeds", "m.04j2trm": "Cowboy Up", "m.04j2xz3": "Requiem for Murder", "m.0502pc": "Fresh Horses", "m.057jzt": "Not Another Teen Movie", "m.05mkgd": "Strike It Rich", "m.069stz": "Spacehunter: Adventures in the Forbidden Zone", "m.06vgnr": "For Keeps", "m.07cfg": "The Breakfast Club", "m.082l0k": "Surviving: A Family in Crisis", "m.08wry6": "Since You've Been Gone", "m.09fc83": "The Stand", "m.0b80p38": "The Translator", "m.0cfw7m_": "Twice Upon a Time", "m.0cprpb": "Betsy's Wedding", "m.0crt1yx": "Shaded Places", "m.0crvk7p": "Life After Tomorrow", "m.0f3wxj": "Molly: An American Girl on the Home Front", "m.0gkrfsx": "Packin' It In", "m.0gksbfh": "PK And The Kid", "m.0h12vrm": "Wax on, F*ck Off"}}, {"question": "what is the northeast of the united states", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027rjr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027rjr ns:location.location.contains ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , contains ] ) [ Northeastern United States ] )", "golden_entities": {"m.027rjr": "Northeastern United States"}, "answer_entities": {"m.0248gz": "Milford", "m.029jpy": "New England", "m.050ks": "Maine", "m.059f4": "New Hampshire", "m.06btq": "Rhode Island", "m.0hz35": "Waltham", "m.0n5yh": "Hillsborough County", "m.0xhjk": "Mason", "m.0xhkl": "Merrimack"}}, {"question": "where is mount vernon virginia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.010m5w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.010m5w ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Mount Vernon ] )", "golden_entities": {"m.010m5w": "Mount Vernon"}, "answer_entities": {"m.0mnz0": "Fairfax County, Virginia"}}, {"question": "where is kia car from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01cytr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01cytr ns:organization.organization.place_founded ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , place founded ] ) [ Kia Motors ] )", "golden_entities": {"m.01cytr": "Kia Motors"}, "answer_entities": {"m.06qd3": "South Korea"}}, {"question": "where do the kansas city chiefs play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0487_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0487_ ns:sports.sports_team.location ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , location ] ) [ Kansas City Chiefs ] )", "golden_entities": {"m.0487_": "Kansas City Chiefs"}, "answer_entities": {"m.04f_d": "Kansas City"}}, {"question": "what countries does the mississippi river run through", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04yf_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04yf_ ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , containedby ] ) [ Mississippi River ] ) )", "golden_entities": {"m.04yf_": "Mississippi River", "m.01mp": "Country"}, "answer_entities": {"m.09c7w0": "United States of America"}}, {"question": "in what modern country is the yucatan peninsula located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lzs8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lzs8 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , containedby ] ) [ Yucat\u00e1n Peninsula ] ) )", "golden_entities": {"m.04lzs8": "Yucat\u00e1n Peninsula", "m.01mp": "Country"}, "answer_entities": {"m.0b90_r": "Mexico"}}, {"question": "what does starbucks sell", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.018c_r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.018c_r ns:dining.restaurant.cuisine ?x .\n}\n", "logical_form": "( JOIN ( R [ dining , restaurant , cuisine ] ) [ Starbucks ] )", "golden_entities": {"m.018c_r": "Starbucks"}, "answer_entities": {"m.01_6hg": "Delicatessen", "m.01fb_0": "Bagel", "m.01z1bzt": "Coffeehouse", "m.01z1jf2": "American food", "m.02wv6th": "Bakery"}}, {"question": "who is lincoln steffens", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bw1c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bw1c ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Lincoln Steffens ] )", "golden_entities": {"m.01bw1c": "Lincoln Steffens"}, "answer_entities": {"m.0d8qb": "Journalist"}}, {"question": "what are all the movies channing tatum has been in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06lvlf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06lvlf ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Channing Tatum ] ) )", "golden_entities": {"m.06lvlf": "Channing Tatum"}, "answer_entities": {"m.0_4654w": "X-Men: Apocalypse", "m.0125kvm9": "23 Jump Street", "m.028bfsc": "Stop-Loss", "m.02mmwk": "War of the Worlds", "m.02r4475": "Step Up 2: The Streets", "m.02z242q": "Poor Things", "m.03gwvd7": "The Trap", "m.03qcfvw": "G.I. Joe: The Rise of Cobra", "m.04xx9s": "Coach Carter", "m.05b08zq": "Dear John", "m.05b2s45": "Fighting", "m.06z1ht": "Havoc", "m.07k88kp": "The Eagle", "m.07mj6x": "Supercross", "m.0818gg": "She's the Man", "m.0b_rqq": "Hail, Caesar!", "m.0b73wst": "Step Up", "m.0bq8tmw": "21 Jump Street", "m.0c3_662": "The Dilemma", "m.0c40vxk": "Haywire", "m.0czcycf": "Morgan and Destiny's Eleventeenth Date: The Zeppelin Zoo", "m.0dscrwf": "The Vow", "m.0f93zm": "A Guide to Recognizing Your Saints", "m.0fq33vs": "10 Years", "m.0g3zrd": "Public Enemies", "m.0g55blx": "The Son of No One", "m.0gwlfnb": "G.I. Joe: Retaliation", "m.0gy_8n": "Battle in Seattle", "m.0h_f20b": "Side Effects", "m.0h63gl9": "Magic Mike", "m.0hz4j2j": "This Is the End", "m.0kd0k5k": "Don Jon", "m.0n4blqr": "White House Down", "m.0n4g1dj": "The Lego Movie", "m.0n8yg3l": "Foxcatcher", "m.0t513_x": "Jupiter Ascending", "m.0v_w91n": "22 Jump Street", "m.0v_w9cw": "The Contortionist's Handbook", "m.0y4jvvn": "Magic Mike XXL", "m.0ynxx40": "The Book of Life"}}, {"question": "where is the country of panama located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qx1 ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Panama ] )", "golden_entities": {"m.05qx1": "Panama"}, "answer_entities": {"m.059g4": "North America"}}, {"question": "where is university of alabama located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wdl3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wdl3 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ University of Alabama ] )", "golden_entities": {"m.01wdl3": "University of Alabama"}, "answer_entities": {"m.09c7w0": "United States of America", "m.0gyh": "Alabama", "m.0qc7l": "Tuscaloosa"}}, {"question": "who was arthur miller influenced by", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0yfp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0yfp ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Arthur Miller ] )", "golden_entities": {"m.0yfp": "Arthur Miller"}, "answer_entities": {"m.03pm9": "Henrik Ibsen", "m.06pzl": "Sophocles", "m.081k8": "William Shakespeare"}}, {"question": "where is el salvador located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02k8k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02k8k ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ El Salvador ] )", "golden_entities": {"m.02k8k": "El Salvador"}, "answer_entities": {"m.01tzh": "Central America", "m.04pnx": "Latin America", "m.059g4": "North America", "m.07c5l": "Americas"}}, {"question": "what year was kevin durant drafted", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gxrc1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gxrc1 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Kevin Durant ] ) )", "golden_entities": {"m.0gxrc1": "Kevin Durant"}, "answer_entities": {"m.0f4vx0": "2007 NBA draft"}}, {"question": "what happened to nina simone", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03f3_p3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03f3_p3 ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Nina Simone ] )", "golden_entities": {"m.03f3_p3": "Nina Simone"}, "answer_entities": {"m.0j8hd": "Breast cancer", "m.0qcr0": "Cancer"}}, {"question": "where is wellsville missouri", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0wy41)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0wy41 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Wellsville ] )", "golden_entities": {"m.0wy41": "Wellsville"}, "answer_entities": {"m.04ych": "Missouri", "m.09c7w0": "United States of America", "m.0fwvj": "Montgomery County"}}, {"question": "who is the current queen of australia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chghy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chghy ns:royalty.kingdom.rulers ?x .\n?x ns:common.topic.notable_types ns:m.04fnrhx .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Monarch ] ) ( JOIN ( R [ royalty , kingdom , rulers ] ) [ Australia ] ) )", "golden_entities": {"m.0chghy": "Australia", "m.04fnrhx": "Monarch"}, "answer_entities": {"m.0d1_f": "Elizabeth II"}}, {"question": "where did galileo go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034ks)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034ks ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Galileo Galilei ] ) )", "golden_entities": {"m.034ks": "Galileo Galilei"}, "answer_entities": {"m.02bbyw": "University of Pisa"}}, {"question": "who did david villa play for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08zpzz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08zpzz ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ David Villa ] ) )", "golden_entities": {"m.08zpzz": "David Villa"}, "answer_entities": {"m.0270my1": "Asturias autonomous football team", "m.02w64f": "Spain national football team", "m.03wftzq": "Sporting de Gij\u00f3n B", "m.07kbtr4": "Melbourne City FC", "m.080_y": "Valencia CF", "m.0hvgt": "FC Barcelona", "m.0kr10": "Sporting de Gij\u00f3n", "m.0lg7v": "Atl\u00e9tico Madrid", "m.0lhp1": "Real Zaragoza", "m.0t_f17t": "New York City FC"}}, {"question": "what 's jamaica country code", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_r3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_r3 ns:base.aareas.schema.administrative_area.short_name ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , short name ] ) [ Jamaica ] )", "golden_entities": {"m.03_r3": "Jamaica"}, "answer_entities": {"value": "jm"}}, {"question": "where robert frost went to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06gq_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06gq_ ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Robert Frost ] ) )", "golden_entities": {"m.06gq_": "Robert Frost"}, "answer_entities": {"m.02bqy": "Dartmouth College", "m.03ksy": "Harvard University"}}, {"question": "what county is plainfield il in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0sjdw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0sjdw ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Plainfield ] )", "golden_entities": {"m.0sjdw": "Plainfield"}, "answer_entities": {"m.0l3kx": "Will County"}}, {"question": "what country is the mekong river located in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j0g5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j0g5 ns:location.location.partially_containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , partially containedby ] ) [ Mekong ] )", "golden_entities": {"m.0j0g5": "Mekong"}, "answer_entities": {"m.01crd5": "Vietnam", "m.01xbgx": "Cambodia", "m.04hhv": "Laos", "m.04xn_": "Myanmar", "m.07f1x": "Thailand", "m.0d05w3": "China"}}, {"question": "who founded the sisters of saint joseph", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06jc5d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06jc5d ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ Sisters of St. Joseph ] )", "golden_entities": {"m.06jc5d": "Sisters of St. Joseph"}, "answer_entities": {"m.06jb6m": "Mary MacKillop", "m.06jc3_": "Julian Tenison-Woods"}}, {"question": "who shot and killed president john f kennedy", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:user.alexander.misc.murdered_person.murdered_by ?x .\n}\n", "logical_form": "( JOIN ( R [ user , alexander , misc , murdered person , murdered by ] ) [ John F. Kennedy ] )", "golden_entities": {"m.0d3k14": "John F. Kennedy"}, "answer_entities": {"m.04gwy": "Lee Harvey Oswald"}}, {"question": "what do people in south africa speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hzlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hzlz ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ South Africa ] )", "golden_entities": {"m.0hzlz": "South Africa"}, "answer_entities": {"m.0121sr": "Gujarati Language", "m.02bv9": "Dutch Language", "m.02h40lc": "English Language", "m.02hwn8h": "Nama Language", "m.02hxcvy": "Urdu Language", "m.0349s": "Greek Language", "m.03hkp": "Hebrew Language", "m.03k50": "Hindi Language", "m.04306rv": "German Language", "m.05zjd": "Portuguese Language", "m.06x06": "Sanskrit Language", "m.070gc6": "Phuthi language", "m.070gkn": "South African Sign Language", "m.071dl": "South African English", "m.07c9s": "Tamil Language", "m.09s02": "Telugu language", "m.0jzc": "Arabic Language", "m.0nl8g": "Xhosa Language"}}, {"question": "where great britain located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034cm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034cm ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Great Britain ] )", "golden_entities": {"m.034cm": "Great Britain"}, "answer_entities": {"m.02j9z": "Europe", "m.07ssc": "United Kingdom"}}]