[{"question": "what are the names of all the countries in africa", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dg3n1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dg3n1 ns:base.locations.continents.countries_within ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , continents , countries within ] ) [ Africa ] )", "golden_entities": {"m.0dg3n1": "Africa"}, "answer_entities": {"m.0164v": "Benin", "m.0166v": "Botswana", "m.01699": "Burkina Faso", "m.0169t": "Burundi", "m.019pcs": "Ethiopia", "m.019rg5": "Kenya", "m.01n6c": "Comoros", "m.01nln": "Cameroon", "m.01nqj": "Cape Verde", "m.01nyl": "Central African Republic", "m.01p1b": "Chad", "m.01rxw": "Congo", "m.027jk": "Djibouti", "m.02k54": "Egypt", "m.02kcz": "Equatorial Guinea", "m.02khs": "Eritrea", "m.03548": "Gabon", "m.035dk": "Ghana", "m.03676": "Guinea", "m.036b_": "Guinea-Bissau", "m.04gqr": "Libya", "m.04hvw": "Lesotho", "m.04hzj": "Liberia", "m.04sj3": "Madagascar", "m.04tr1": "Malawi", "m.04v09": "Mali", "m.04vjh": "Mauritania", "m.04vs9": "Mauritius", "m.04wgh": "Morocco", "m.04wlh": "Mozambique", "m.05bmq": "Namibia", "m.05cc1": "Niger", "m.05cgv": "Nigeria", "m.05rznz": "South Sudan", "m.06dfg": "Rwanda", "m.06s_2": "Sierra Leone", "m.06srk": "Senegal", "m.06sw9": "Seychelles", "m.06tgw": "Somalia", "m.06tw8": "Sudan", "m.06v36": "Swaziland", "m.07dzf": "Tanzania", "m.07f5x": "Togo", "m.07fj_": "Tunisia", "m.07tp2": "Uganda", "m.088q4": "Zimbabwe", "m.088vb": "Zambia", "m.088xp": "Democratic Republic of the Congo", "m.0fv4v": "Ivory Coast", "m.0h3y": "Algeria", "m.0hdx8": "Gambia", "m.0hzlz": "South Africa", "m.0j4b": "Angola", "m.0j681": "S\u00e3o Tom\u00e9 and Pr\u00edncipe"}}, {"question": "where was nicki minaj born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.047sxrj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.047sxrj ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Nicki Minaj ] )", "golden_entities": {"m.047sxrj": "Nicki Minaj"}, "answer_entities": {"m.0gplfm": "Saint James, Trinidad and Tobago"}}, {"question": "who plays spike in buffy the vampire slayer", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jz06)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jz06 ns:tv.tv_character.appeared_in_tv_episodes ?y .\n?y ns:tv.tv_guest_role.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , tv guest role , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv episodes ] ) [ Spike ] ) )", "golden_entities": {"m.0jz06": "Spike"}, "answer_entities": {"m.01f9mq": "James Marsters"}}, {"question": "where was emperor hadrian born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jxc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jxc ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Hadrian ] )", "golden_entities": {"m.03jxc": "Hadrian"}, "answer_entities": {"m.05dn72": "Italica"}}, {"question": "where did martin luther king went to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Martin Luther King, Jr. ] ) )", "golden_entities": {"m.051cc": "Martin Luther King, Jr."}, "answer_entities": {"m.01_r9k": "Morehouse College", "m.0479w_2": "Washington High School", "m.06yr21": "Crozer Theological Seminary", "m.0gl5_": "Boston University"}}, {"question": "what airport is closest to ithaca ny", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03v_5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03v_5 ns:location.location.nearby_airports ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , nearby airports ] ) [ Ithaca ] )", "golden_entities": {"m.03v_5": "Ithaca"}, "answer_entities": {"m.01vs0p": "Ithaca Tompkins Regional Airport"}}, {"question": "where did kurt cobain die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0484q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0484q ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Kurt Cobain ] )", "golden_entities": {"m.0484q": "Kurt Cobain"}, "answer_entities": {"m.0d9jr": "Seattle"}}, {"question": "what county is jackson michigan in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042tq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042tq ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Jackson ] )", "golden_entities": {"m.042tq": "Jackson"}, "answer_entities": {"m.043z0": "Jackson County"}}, {"question": "where was the battle of verdun held", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dl4g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dl4g ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ Battle of Verdun ] )", "golden_entities": {"m.0dl4g": "Battle of Verdun"}, "answer_entities": {"m.0ny95": "Verdun"}}, {"question": "what religion is king henry viii", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03p77)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03p77 ns:people.person.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , religion ] ) [ Henry VIII of England ] )", "golden_entities": {"m.03p77": "Henry VIII of England"}, "answer_entities": {"m.01spm": "Church of England", "m.0c8wxp": "Catholicism", "m.0g9vs": "Anglo-Catholicism", "m.0n2g": "Anglicanism"}}, {"question": "where did james baldwin go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.017_pb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.017_pb ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ James Baldwin ] ) )", "golden_entities": {"m.017_pb": "James Baldwin"}, "answer_entities": {"m.06thjt": "The New School", "m.09r4xx": "DeWitt Clinton High School"}}, {"question": "who was joseph pulitzer and what did he do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019541)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019541 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Joseph Pulitzer ] )", "golden_entities": {"m.019541": "Joseph Pulitzer"}, "answer_entities": {"m.02h668d": "Publisher", "m.04gc2": "Lawyer", "m.0d8qb": "Journalist", "m.0fj9f": "Politician"}}, {"question": "where did jane austen grow up", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.040dv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.040dv ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Jane Austen ] )", "golden_entities": {"m.040dv": "Jane Austen"}, "answer_entities": {"m.06ybhf": "Steventon"}}, {"question": "what was basketball player michael jordan 's major in college", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.054c1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.054c1 ns:people.person.education ?y .\n?y ns:education.education.major_field_of_study ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , major field of study ] ) ( JOIN ( R [ people , person , education ] ) [ Michael Jordan ] ) )", "golden_entities": {"m.054c1": "Michael Jordan"}, "answer_entities": {"m.07xc_j": "Cultural geography"}}, {"question": "who made the american red cross", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0by8vb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0by8vb ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ American Red Cross ] )", "golden_entities": {"m.0by8vb": "American Red Cross"}, "answer_entities": {"m.0bww9": "Clara Barton"}}, {"question": "who played daniel larusso", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fvbly3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fvbly3 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Daniel Larusso ] ) )", "golden_entities": {"m.0fvbly3": "Daniel Larusso"}, "answer_entities": {"m.02rv8m": "Ralph Macchio"}}, {"question": "what happened to umaga wwe", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03s95m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03s95m ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Umaga ] )", "golden_entities": {"m.03s95m": "Umaga"}, "answer_entities": {"m.0gk4g": "heart attack"}}, {"question": "what movies did jj abrams direct", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xndd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xndd ns:film.director.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , director , film ] ) [ J.J. Abrams ] )", "golden_entities": {"m.01xndd": "J.J. Abrams"}, "answer_entities": {"m.05zysr7": "Anatomy of Hope", "m.06fqlk": "Mission: Impossible III", "m.08phg9": "Star Trek", "m.0bwfwpj": "Super 8", "m.0hhqv27": "Star Trek Into Darkness", "m.0nb2r_p": "Star Wars: The Force Awakens"}}, {"question": "what two countries speak italian", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02bjrlw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02bjrlw ns:language.human_language.main_country ?x .\n}\n", "logical_form": "( JOIN ( R [ language , human language , main country ] ) [ Italian Language ] )", "golden_entities": {"m.02bjrlw": "Italian Language"}, "answer_entities": {"m.03rjj": "Italy", "m.06t8v": "Slovenia"}}, {"question": "where did macho camacho got shot at", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lxcw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lxcw ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ H\u00e9ctor Camacho ] )", "golden_entities": {"m.0lxcw": "H\u00e9ctor Camacho"}, "answer_entities": {"m.0fw4v": "San Juan"}}, {"question": "who is andrew carnegie and what did he do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0vdk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0vdk ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Andrew Carnegie ] )", "golden_entities": {"m.0vdk": "Andrew Carnegie"}, "answer_entities": {"m.012t_z": "Businessperson", "m.025spv": "Business magnate", "m.09x_r": "Entrepreneur"}}, {"question": "who plays lorne on angel", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03466b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03466b ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Lorne ] ) )", "golden_entities": {"m.03466b": "Lorne"}, "answer_entities": {"m.01vq3nl": "Andy Hallett"}}, {"question": "what influenced abraham lincoln to become president", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Abraham Lincoln ] )", "golden_entities": {"m.0gzh": "Abraham Lincoln"}, "answer_entities": {"m.027549": "Theodore Parker", "m.07kwl": "Thomas Paine", "m.0ct18": "Henry Clay"}}, {"question": "who is jeremy sumpter", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.024xw1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.024xw1 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Jeremy Sumpter ] )", "golden_entities": {"m.024xw1": "Jeremy Sumpter"}, "answer_entities": {"m.02hrh1q": "Actor"}}, {"question": "where was san gabriel arcangel located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g8r5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g8r5 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Mission San Gabriel Arc\u00e1ngel ] )", "golden_entities": {"m.0g8r5": "Mission San Gabriel Arc\u00e1ngel"}, "answer_entities": {"m.01n7q": "California", "m.0r0xb": "San Gabriel"}}, {"question": "who was the emperor before nero", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05fc1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05fc1 ns:user.robert.roman_empire.roman_emperor.prececessor ?x .\n}\n", "logical_form": "( JOIN ( R [ user , robert , roman empire , roman emperor , prececessor ] ) [ Nero ] )", "golden_entities": {"m.05fc1": "Nero"}, "answer_entities": {"m.01v34": "Claudius"}}, {"question": "what is gibby 's mom 's name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07wy5s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07wy5s ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , parents ] ) [ Gibby Haynes ] ) )", "golden_entities": {"m.07wy5s": "Gibby Haynes", "m.02zsn": "Female"}, "answer_entities": {"m.0j6c612": "Doris Haynes"}}, {"question": "what type of music does ella fitzgerald sing", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d9xq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d9xq ns:music.artist.genre ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , genre ] ) [ Ella Fitzgerald ] )", "golden_entities": {"m.0d9xq": "Ella Fitzgerald"}, "answer_entities": {"m.0155w": "Blues", "m.015y_n": "Swing music", "m.01gjw": "Ballad", "m.03_d0": "Jazz", "m.08lpkq": "Vocal jazz", "m.0cx6f": "Bebop", "m.0m40d": "Traditional pop music"}}, {"question": "what movies are directed by steven spielberg", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06pj8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06pj8 ns:film.director.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , director , film ] ) [ Steven Spielberg ] )", "golden_entities": {"m.06pj8": "Steven Spielberg"}, "answer_entities": {"m.011v6djn": "Bridge of Spies", "m.011wtv": "Minority Report", "m.011xg5": "A.I. Artificial Intelligence", "m.012mrr": "Close Encounters of the Third Kind", "m.0130x37n": "The BFG", "m.01flv_": "Catch Me If You Can", "m.01l5j2": "Duel", "m.025rvx0": "Empire of the Sun", "m.0260bz": "Amistad", "m.0295sy": "Hook", "m.02mmwk": "War of the Worlds", "m.02rb84n": "The Adventures of Tintin: The Secret of the Unicorn", "m.02rml0k": "The Attack of the Mummies", "m.02rrfdw": "Slipstream", "m.02ww_d1": "Amazing Stories: Book One", "m.0315rp": "The Lost World: Jurassic Park", "m.0322yj": "The Terminal", "m.03gtd4": "Always", "m.04mcw4": "Indiana Jones and the Kingdom of the Crystal Skull", "m.04sh80": "Twilight Zone: The Movie", "m.04t6fk": "1941", "m.05k8zz": "The Sugarland Express", "m.05p8qvv": "Something Evil", "m.07024": "Saving Private Ryan", "m.072x7s": "Munich", "m.08xvpn": "The Color Purple", "m.0cc5qkt": "War Horse", "m.0f4yh": "Indiana Jones and the Raiders of the Lost Ark", "m.0fgrln": "Amblin", "m.0fq8jmb": "Savage", "m.0gmgwnv": "Lincoln", "m.0h_b6x1": "Indiana Jones and the Last Crusade", "m.0hfzr": "Schindler's List", "m.0hhghzl": "Robopocalypse", "m.0hx4y": "Jurassic Park", "m.0jqn5": "E.T. the Extra-Terrestrial", "m.0jyb4": "Jaws", "m.0k_9j": "Indiana Jones and the Temple of Doom", "m.0kv8sl": "Firelight"}}, {"question": "what instrument does mike huckabee play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01rxqd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01rxqd ns:music.group_member.instruments_played ?x .\n}\n", "logical_form": "( JOIN ( R [ music , group member , instruments played ] ) [ Mike Huckabee ] )", "golden_entities": {"m.01rxqd": "Mike Huckabee"}, "answer_entities": {"m.018vs": "Bass guitar"}}, {"question": "where is basque located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dwvx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dwvx1 ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , administrative parent ] ) [ Basque Country ] )", "golden_entities": {"m.0dwvx1": "Basque Country"}, "answer_entities": {"m.06mkj": "Spain"}}, {"question": "what movies does alyson stoner play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02bwjv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02bwjv ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Alyson Stoner ] ) )", "golden_entities": {"m.02bwjv": "Alyson Stoner"}, "answer_entities": {"m.01yzvd": "Garfield: The Movie", "m.026k503": "Holly Hobbie and Friends: Christmas Wishes", "m.02bqvs": "Cheaper by the Dozen", "m.02w4by3": "Camp Rock", "m.047f43s": "Alice Upside Down", "m.04crzpz": "Alyson Stoner Project", "m.064016d": "Step Up 3D", "m.066b_n": "Cheaper by the Dozen 2", "m.080b54x": "Camp Rock 2: The Final Jam", "m.09v9fw5": "Kung Fu Magoo", "m.0b73wst": "Step Up", "m.0bh9n8g": "Phineas and Ferb the Movie: Across the 2nd Dimension", "m.0bnns7": "Holly Hobbie and Friends: Surprise Party", "m.0by1x51": "Yin Yang Yo! The Movie", "m.0gj8r0x": "The Little Engine That Could", "m.0gky0pl": "A Cinderella Story: Once Upon a Song", "m.0wq4q7j": "Super Buddies", "m.0ztfxbv": "Step Up: All In"}}, {"question": "what region is czech republic in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mjq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mjq ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Czech Republic ] )", "golden_entities": {"m.01mjq": "Czech Republic"}, "answer_entities": {"m.01lkr": "Central Europe", "m.02j9z": "Europe", "m.02qkt": "Eurasia"}}, {"question": "what to see in staten island new york", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0y62n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0y62n ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Staten Island ] )", "golden_entities": {"m.0y62n": "Staten Island"}, "answer_entities": {"m.01q6lq": "Verrazano\u2013Narrows Bridge", "m.02r7jcf": "Staten Island Children's Museum", "m.02z0qbn": "Voorlezer's House", "m.02zt_l": "Staten Island Museum", "m.02zw2b": "Staten Island Zoo", "m.04jd3v3": "The Stephens-Black House", "m.04n4tlq": "Third County Courthouse", "m.06k8z8": "Snug Harbor Cultural Center and Botanical Garden", "m.0ch45b0": "The Christopher House"}}, {"question": "what continent is greenland located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035v3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035v3 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mh .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Continent ] ) ( JOIN ( R [ location , location , containedby ] ) [ Greenland ] ) )", "golden_entities": {"m.035v3": "Greenland", "m.01mh": "Continent"}, "answer_entities": {"m.059g4": "North America"}}, {"question": "what teams did gretzky play on", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0839s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0839s ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Wayne Gretzky ] ) )", "golden_entities": {"m.0839s": "Wayne Gretzky"}, "answer_entities": {"m.0jnmj": "Edmonton Oilers"}}, {"question": "where did the battle of new orleans start", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012vkj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012vkj ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ Battle of New Orleans ] )", "golden_entities": {"m.012vkj": "Battle of New Orleans"}, "answer_entities": {"m.01_gtcg": "Chalmette"}}, {"question": "what does the dominican republic speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027rn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027rn ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Dominican Republic ] )", "golden_entities": {"m.027rn": "Dominican Republic"}, "answer_entities": {"m.02dhwl": "Haitian Creole", "m.06jsg0": "Saman\u00e1 English", "m.06nm1": "Spanish Language"}}, {"question": "who is paul revere and what did he do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0db0x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0db0x ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Paul Revere ] )", "golden_entities": {"m.0db0x": "Paul Revere"}, "answer_entities": {"g.125_hzb47": "Spy", "m.012t_z": "Businessperson", "m.01vs_x": "Silversmith", "m.09x_r": "Entrepreneur"}}, {"question": "what airlines hub in phoenix", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d35y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d35y ns:location.location.nearby_airports ?x .\n?x ns:aviation.airport.focus_city_for ns:m.0gztl .\n}\n", "logical_form": "( AND ( JOIN [ aviation , airport , focus city for ] [ Southwest Airlines ] ) ( JOIN ( R [ location , location , nearby airports ] ) [ Phoenix ] ) )", "golden_entities": {"m.0d35y": "Phoenix", "m.0gztl": "Southwest Airlines"}, "answer_entities": {"m.0syvm": "Phoenix Sky Harbor International Airport"}}, {"question": "where did cutler jay go to college", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.097hft)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.097hft ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jay Cutler ] ) )", "golden_entities": {"m.097hft": "Jay Cutler"}, "answer_entities": {"m.01pq4w": "Vanderbilt University", "m.02q6v42": "Heritage Hills High School"}}, {"question": "where is ann romney from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02wvk7d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02wvk7d ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Ann Romney ] )", "golden_entities": {"m.02wvk7d": "Ann Romney"}, "answer_entities": {"m.02dtg": "Detroit"}}, {"question": "what school did bill gates go to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.017nt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.017nt ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Bill Gates ] ) )", "golden_entities": {"m.017nt": "Bill Gates"}, "answer_entities": {"m.01jv5g": "Lakeside School", "m.01mpwj": "Harvard College"}}, {"question": "what country does dubai come under", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01f08r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01f08r ns:base.biblioness.bibs_location.country ?x .\n}\n", "logical_form": "( JOIN ( R [ base , biblioness , bibs location , country ] ) [ Dubai ] )", "golden_entities": {"m.01f08r": "Dubai"}, "answer_entities": {"m.0j1z8": "United Arab Emirates"}}, {"question": "where does the panama canal run through", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.066rl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.066rl ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Panama Canal ] )", "golden_entities": {"m.066rl": "Panama Canal"}, "answer_entities": {"m.059g4": "North America", "m.05qx1": "Panama"}}, {"question": "what years did jackie robinson play baseball", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0443c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0443c ns:baseball.baseball_player.batting_stats ?y .\n?y ns:baseball.batting_statistics.season ?x .\n}\n", "logical_form": "( JOIN ( R [ baseball , batting statistics , season ] ) ( JOIN ( R [ baseball , baseball player , batting stats ] ) [ Jackie Robinson ] ) )", "golden_entities": {"m.0443c": "Jackie Robinson"}, "answer_entities": {"m.02h7s7l": "1949 Major League Baseball Season", "m.02h7sfp": "1956 Major League Baseball Season", "m.041105l": "1947 Major League Baseball season", "m.041108j": "1950 Major League Baseball season", "m.041108x": "1951 Major League Baseball season", "m.041109n": "1955 Major League Baseball season", "m.04110b0": "1954 Major League Baseball season", "m.04110f5": "1953 Major League Baseball season", "m.04110y2": "1948 Major League Baseball season", "m.04110yg": "1952 Major League Baseball season"}}, {"question": "who all has steve nash played for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01yqrk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01yqrk ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Steve Nash ] ) )", "golden_entities": {"m.01yqrk": "Steve Nash"}, "answer_entities": {"m.0jmcv": "Dallas Mavericks", "m.0jmk7": "Los Angeles Lakers", "m.0jml5": "Phoenix Suns"}}, {"question": "where does jason statham live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034hyc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034hyc ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Jason Statham ] ) )", "golden_entities": {"m.034hyc": "Jason Statham"}, "answer_entities": {"m.0ncb9": "Sydenham", "m.0p98z": "Great Yarmouth"}}, {"question": "what language is cyprus using", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ppq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ppq ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Cyprus ] )", "golden_entities": {"m.01ppq": "Cyprus"}, "answer_entities": {"m.012psb": "Romani language", "m.02h40lc": "English Language", "m.02hwj5j": "Cypriot Maronite Arabic", "m.02hwyss": "Turkish Language", "m.0349s": "Greek Language", "m.04306rv": "German Language", "m.064_8sq": "French", "m.0xrg": "Armenian Language"}}, {"question": "what to do in roatan bay", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03djmd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03djmd ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Roat\u00e1n ] )", "golden_entities": {"m.03djmd": "Roat\u00e1n"}, "answer_entities": {"m.0j1h1lh": "Enomis Divers", "m.0j1h1lq": "Sante' Wellness Center", "m.0jz3_57": "Gumbalimba Park", "m.0jz31x5": "French Harbour Iguana Reserve", "m.0jz325w": "Roat\u00e1n Butterfly Garden"}}]