[{"question": "who speaks farsi", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.032f6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.032f6 ns:language.human_language.countries_spoken_in ?x .\n}\n", "logical_form": "( JOIN ( R [ language , human language , countries spoken in ] ) [ Persian Language ] )", "golden_entities": {"m.032f6": "Persian Language"}, "answer_entities": {"m.0161c": "Bahrain", "m.02z62v1": "Seljuk Empire", "m.03shp": "Iran", "m.05l8y": "Oman", "m.07dvs": "Tajikistan", "m.07t_x": "Uzbekistan", "m.0d05q4": "Iraq", "m.0d060g": "Canada"}}, {"question": "who was neptune discovered by", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c31h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c31h ns:astronomy.astronomical_discovery.discoverer ?x .\n}\n", "logical_form": "( JOIN ( R [ astronomy , astronomical discovery , discoverer ] ) [ Neptune ] )", "golden_entities": {"m.0c31h": "Neptune"}, "answer_entities": {"m.017xvy": "Urbain Le Verrier", "m.017xwf": "John Couch Adams", "m.01d9_n": "Johann Gottfried Galle", "m.02bw8x": "Heinrich Louis d'Arrest"}}, {"question": "what did corey haim really die of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kyn0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kyn0 ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Corey Haim ] )", "golden_entities": {"m.01kyn0": "Corey Haim"}, "answer_entities": {"m.01tf_6": "Drug overdose", "m.0dq9p": "Pneumonia"}}, {"question": "where did pavlova originate", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hp3n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hp3n ns:food.dish.cuisine ?x .\n}\n", "logical_form": "( JOIN ( R [ food , dish , cuisine ] ) [ Pavlova ] )", "golden_entities": {"m.0hp3n": "Pavlova"}, "answer_entities": {"m.04bf68": "New Zealand cuisine"}}, {"question": "where did nathaniel hawthorne die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05gpy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05gpy ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Nathaniel Hawthorne ] )", "golden_entities": {"m.05gpy": "Nathaniel Hawthorne"}, "answer_entities": {"m.01m96h": "Plymouth"}}, {"question": "what are buddhist gods", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.092bf5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.092bf5 ns:religion.religion.deities ?x .\n}\n", "logical_form": "( JOIN ( R [ religion , religion , deities ] ) [ Buddhism ] )", "golden_entities": {"m.092bf5": "Buddhism"}, "answer_entities": {"m.018q6f": "Hariti", "m.02lxg9": "Acala", "m.03vh65": "Yaksha", "m.04fckk": "N\u0101ga", "m.0czf7z": "Yama", "m.0dd2j3": "Asura"}}, {"question": "who influenced wolfgang amadeus mozart", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.082db)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.082db ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Wolfgang Amadeus Mozart ] )", "golden_entities": {"m.082db": "Wolfgang Amadeus Mozart"}, "answer_entities": {"m.014t6l": "Michael Haydn", "m.03_f0": "Johann Sebastian Bach", "m.03bxh": "George Frideric Handel", "m.043d4": "Joseph Haydn", "m.0fyv0": "Carl Philipp Emanuel Bach"}}, {"question": "when was blessed kateri born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01zql6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01zql6 ns:people.person.date_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , date of birth ] ) [ Kateri Tekakwitha ] )", "golden_entities": {"m.01zql6": "Kateri Tekakwitha"}, "answer_entities": {"value": "1656"}}, {"question": "when did the bali bombings occur", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0q06c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0q06c ns:time.event.start_date ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , start date ] ) [ 2002 Bali bombings ] )", "golden_entities": {"m.0q06c": "2002 Bali bombings"}, "answer_entities": {"value": "2002-10-12"}}, {"question": "where is the nation of palestine", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.047876)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.047876 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Palestine ] )", "golden_entities": {"m.047876": "Palestine"}, "answer_entities": {"m.01ffbn": "Near East", "m.02qkt": "Eurasia", "m.04l_r": "Levant", "m.04wsz": "Middle East", "m.04zy7t9": "Eastern Mediterranean"}}, {"question": "what is in liverpool england", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lh6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lh6 ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Liverpool ] )", "golden_entities": {"m.04lh6": "Liverpool"}, "answer_entities": {"m.019gnm": "251 Menlove Avenue", "m.02c3ll": "Walker Art Gallery", "m.02vvzf": "World Museum", "m.02vw4c": "Merseyside Maritime Museum", "m.036gxj": "Royal Liver Building", "m.040gbq": "Albert Dock", "m.040gw4": "Bluecoat Chambers", "m.04150b": "St George's Hall, Liverpool", "m.04bz00": "The Oratory, Liverpool", "m.05d5yy": "Liverpool Cathedral", "m.06h8xk": "New Pleasureland Southport"}}, {"question": "what state is harvard college located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mpwj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mpwj ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.0kpys4 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ US State ] ) ( JOIN ( R [ location , location , containedby ] ) [ Harvard College ] ) )", "golden_entities": {"m.01mpwj": "Harvard College", "m.0kpys4": "US State"}, "answer_entities": {"m.05k7sb": "Massachusetts"}}, {"question": "where was leonardo da vinci when he died", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lg6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lg6 ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Leonardo da Vinci ] )", "golden_entities": {"m.04lg6": "Leonardo da Vinci"}, "answer_entities": {"m.01jvvc": "Amboise"}}, {"question": "what is the time zone in oklahoma city", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fvzg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fvzg ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Oklahoma City ] )", "golden_entities": {"m.0fvzg": "Oklahoma City"}, "answer_entities": {"m.02fqwt": "Central Time Zone"}}, {"question": "what killed whitney houston", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.086qd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.086qd ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Whitney Houston ] )", "golden_entities": {"m.086qd": "Whitney Houston"}, "answer_entities": {"m.01g27f": "Drowning", "m.01s1m": "Coronary artery disease", "m.02nx6jb": "Cocaine overdose"}}, {"question": "what is mount st helens", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.094xz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.094xz ns:geography.mountain.mountain_type ?x .\n}\n", "logical_form": "( JOIN ( R [ geography , mountain , mountain type ] ) [ Mount St. Helens ] )", "golden_entities": {"m.094xz": "Mount St. Helens"}, "answer_entities": {"m.015kp7": "Stratovolcano", "m.07_9_": "Volcano"}}, {"question": "what airport is closest to sandals grande in st lucia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06s0l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06s0l ns:location.location.nearby_airports ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , nearby airports ] ) [ Saint Lucia ] )", "golden_entities": {"m.06s0l": "Saint Lucia"}, "answer_entities": {"m.02zrg2": "George F. L. Charles Airport"}}, {"question": "who is esther hicks", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06_0rt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06_0rt ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Esther Hicks ] )", "golden_entities": {"m.06_0rt": "Esther Hicks"}, "answer_entities": {"m.0cbd2": "Writer", "m.0kyk": "Author"}}, {"question": "what does michael vick do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027f42)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027f42 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Michael Vick ] )", "golden_entities": {"m.027f42": "Michael Vick"}, "answer_entities": {"m.01xr66": "Spokesperson", "m.02h665k": "American football player"}}, {"question": "what to do in laughlin nevada", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.020bkmh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.020bkmh ns:location.location.contains ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , contains ] ) [ Laughlin ] )", "golden_entities": {"m.020bkmh": "Laughlin"}, "answer_entities": {"m.092v_6": "Riverside Resort Hotel & Casino", "m.092zr1": "Edgewater Hotel and Casino", "m.093h23": "Harrah's Laughlin"}}, {"question": "who plays princess padme in star wars", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0drf_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0drf_ ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Padm\u00e9 Amidala ] ) )", "golden_entities": {"m.0drf_": "Padm\u00e9 Amidala"}, "answer_entities": {"m.041fcq": "Catherine Taber", "m.09l3p": "Natalie Portman"}}, {"question": "who was louis riel", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04qqn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04qqn ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Louis Riel ] )", "golden_entities": {"m.04qqn": "Louis Riel"}, "answer_entities": {"m.0fj9f": "Politician"}}, {"question": "where is abraham lincoln hometown", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Abraham Lincoln ] )", "golden_entities": {"m.0gzh": "Abraham Lincoln"}, "answer_entities": {"m.0tgmk": "Hodgenville"}}, {"question": "what disease did helen keller", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03ppx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03ppx ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n", "logical_form": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ Helen Keller ] )", "golden_entities": {"m.03ppx": "Helen Keller"}, "answer_entities": {"m.014wq_": "Hearing loss"}}, {"question": "what is the atlanta braves mascot", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0x2p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0x2p ns:sports.sports_team.team_mascot ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , team mascot ] ) [ Atlanta Braves ] )", "golden_entities": {"m.0x2p": "Atlanta Braves"}, "answer_entities": {"m.07vbb7": "Homer", "m.07vbfd": "Rally", "m.07vbvp": "Chief Noc-A-Homa"}}, {"question": "where was greenpeace an international environmental organization founded", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.036qv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.036qv ns:organization.organization.place_founded ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , place founded ] ) [ Greenpeace ] )", "golden_entities": {"m.036qv": "Greenpeace"}, "answer_entities": {"m.080h2": "Vancouver"}}, {"question": "what was the first name of the washington redskins", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.084l5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.084l5 ns:sports.sports_team.previously_known_as ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , previously known as ] ) [ Washington Redskins ] )", "golden_entities": {"m.084l5": "Washington Redskins"}, "answer_entities": {"m.06mp_z5": "Boston Redskins"}}, {"question": "what sports do they do in canada", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d060g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d060g ns:sports.sports_team_location.teams ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team location , teams ] ) [ Canada ] )", "golden_entities": {"m.0d060g": "Canada"}, "answer_entities": {"m.02py_tx": "Canada Davis Cup team", "m.02r0htt": "Canada Fed Cup team", "m.02z6d6n": "Canada women's national rugby union team", "m.035tjy": "Canada men's national soccer team", "m.037qf6": "Canadian National Men's Hockey Team", "m.03hggnl": "Canada men's national junior ice hockey team", "m.03qkv16": "Canada men's national volleyball team", "m.03qnf8s": "Canada women's national volleyball team", "m.03y8wtx": "Canada women's national water polo team", "m.043q413": "Canada men's national water polo team", "m.0478z33": "Canada men's national floorball team", "m.04cys3k": "Canada men's national inline hockey team", "m.04g1h9d": "Canada national badminton team", "m.04jfltf": "Canada women's national softball team", "m.04t88g": "Canadian National Women's Hockey Team", "m.053r9v9": "Canada women's national under-18 ice hockey team", "m.055_233": "Canada men's national under-19 floorball team", "m.05b__p7": "Canada national handball team", "m.05zf1x": "Canada women's national soccer team", "m.06_8jv": "Canada national rugby league team", "m.0639sd": "Canada national cricket team", "m.096fft": "Northwind", "m.0blnl8": "Canada national baseball team", "m.0bmkh28": "SpiderTech-C10", "m.0dq638": "Canada men's national basketball team", "m.0fkjqy": "Canada national bandy team", "m.0gf59h": "Canada national rugby union team", "m.0h2rrm": "Canada women's national cricket team", "m.0h6125": "Canada men's national field hockey team", "m.0h625n": "Canada women's national field hockey team"}}, {"question": "who is the arizona cardinals football coach", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ws7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ws7 ns:american_football.football_team.current_head_coach ?x .\n}\n", "logical_form": "( JOIN ( R [ american football , football team , current head coach ] ) [ Arizona Cardinals ] )", "golden_entities": {"m.0ws7": "Arizona Cardinals"}, "answer_entities": {"m.027wt58": "Bruce Arians"}}, {"question": "what was marilyn monroe known for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wqr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wqr ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Marilyn Monroe ] )", "golden_entities": {"m.04wqr": "Marilyn Monroe"}, "answer_entities": {"m.01d_h8": "Film Producer", "m.02hrh1q": "Actor", "m.05mwvd": "Showgirl", "m.09l65": "Singer", "m.0d1pc": "Model"}}, {"question": "who are the colorado eagles", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.068_gr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.068_gr ns:common.topic.notable_for ?y .\n?y ns:common.notable_for.notable_object ?x .\n}\n", "logical_form": "( JOIN ( R [ common , notable for , notable object ] ) ( JOIN ( R [ common , topic , notable for ] ) [ Colorado Eagles ] ) )", "golden_entities": {"m.068_gr": "Colorado Eagles"}, "answer_entities": {"m.025698k": "Ice hockey team"}}, {"question": "what currency do they accept in kenya", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019rg5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019rg5 ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Kenya ] )", "golden_entities": {"m.019rg5": "Kenya"}, "answer_entities": {"m.05yxpb": "Kenyan shilling"}}, {"question": "where is the best place to vacation in the dominican republic", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027rn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027rn ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Dominican Republic ] )", "golden_entities": {"m.027rn": "Dominican Republic"}, "answer_entities": {"m.025vdyx": "Saman\u00e1 Bay", "m.03yhz4z": "Los Haitises National Park", "m.04qjzz": "Pico Duarte", "m.04vwf5x": "Punta Espada Golf Course", "m.064nfcw": "Columbus Lighthouse", "m.09v9100": "National Palace", "m.0j5ymqb": "Macao Beach", "m.0jsr82_": "Haitian Batey", "m.0jy_b9f": "Damajaqua Cascades", "m.0jy_b9n": "Playa Fronton"}}, {"question": "where was brad pitt born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c6qh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c6qh ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Brad Pitt ] )", "golden_entities": {"m.0c6qh": "Brad Pitt"}, "answer_entities": {"m.0z9lj": "Shawnee"}}, {"question": "what position does vernon davis play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0br8m3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0br8m3 ns:american_football.football_player.position_s ?x .\n}\n", "logical_form": "( JOIN ( R [ american football , football player , position s ] ) [ Vernon Davis ] )", "golden_entities": {"m.0br8m3": "Vernon Davis"}, "answer_entities": {"m.02g_7z": "Tight end"}}, {"question": "where is the euro 2012 tournament", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06t1s0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06t1s0 ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ UEFA Euro 2012 ] )", "golden_entities": {"m.06t1s0": "UEFA Euro 2012"}, "answer_entities": {"m.02qbpd": "Donetsk", "m.02sn34": "Kiev", "m.035m6": "Gda\u0144sk", "m.05xnv": "Pozna\u0144", "m.081m_": "Warsaw", "m.082sy9": "Kharkiv", "m.0845b": "Wroc\u0142aw", "m.0d7_n": "Lviv"}}, {"question": "what to see and do in malta", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04v3q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04v3q ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Malta ] )", "golden_entities": {"m.04v3q": "Malta"}, "answer_entities": {"m.025tp71": "Megalithic Temples of Malta", "m.02r4lsr": "National Museum of Fine Arts, Malta", "m.0497sp": "Casa Rocca Piccola", "m.04kl4s": "Fort Rinella", "m.05p2xz0": "National Museum of Archaeology, Malta", "m.0bhbzxt": "St. Paul's Catacombs", "m.0h5ffz": "Manoel Theatre", "m.0j1hrfj": "Gozo 360\u00b0 Multivision Show", "m.0jz58y5": "Dingli Cliffs", "m.0jz59fs": "The Armoury and the Maritime Museum"}}, {"question": "what state is rick santorum from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01fgd3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01fgd3 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Rick Santorum ] )", "golden_entities": {"m.01fgd3": "Rick Santorum"}, "answer_entities": {"m.0mmzt": "Winchester"}}, {"question": "what is jonas brothers names", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cbm64)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cbm64 ns:music.musical_group.member ?y .\n?y ns:music.group_membership.member ?x .\n}\n", "logical_form": "( JOIN ( R [ music , group membership , member ] ) ( JOIN ( R [ music , musical group , member ] ) [ Jonas Brothers ] ) )", "golden_entities": {"m.0cbm64": "Jonas Brothers"}, "answer_entities": {"m.0417yh9": "Jack Lawless", "m.04cr6qv": "Joe Jonas", "m.04d_mtq": "Kevin Jonas", "m.04f7c55": "Nick Jonas"}}, {"question": "what are some famous tourist attractions in germany", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0345h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0345h ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Germany ] )", "golden_entities": {"m.0345h": "Germany"}, "answer_entities": {"m.012vvtp_": "Travefy", "m.05mw0": "Oktoberfest", "m.066tl8": "Tropical Islands Resort", "m.0djmy_": "Topography of Terror", "m.0h1f0zf": "Bochum Total"}}, {"question": "who 's kobe bryant", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kmd4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kmd4 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Kobe Bryant ] )", "golden_entities": {"m.01kmd4": "Kobe Bryant"}, "answer_entities": {"m.01445t": "Athlete", "m.02h664x": "Basketball player"}}, {"question": "what songs did richard marx write", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03t852)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03t852 ns:music.composer.compositions ?x .\n}\n", "logical_form": "( JOIN ( R [ music , composer , compositions ] ) [ Richard Marx ] )", "golden_entities": {"m.03t852": "Richard Marx"}, "answer_entities": {"m.0_6bp36": "Big Boy Now", "m.0_6cmss": "Treated This Way", "m.0_6mdny": "So Long in Love", "m.0_74q0_": "Playing With Fire", "m.0_h_cgt": "I Won't Be the One to Let Go", "m.0_hzrs3": "Chains Around My Heart", "m.0_j2s_6": "The Only Thing That Matters", "m.0_j49rz": "I Get No Sleep", "m.0_j6fdq": "The Reasons Why", "m.0_jl7zs": "Best of Me", "m.0_jy97f": "You Never Let Me Down", "m.0_k6tx4": "Calling You", "m.0_k8qmn": "Superstar", "m.0_kc6_d": "If You Ever Leave Me", "m.0_kfk35": "Til Tomorrow", "m.0_kl558": "Your World", "m.026z037": "Satisfied", "m.027nkrj": "Hazard", "m.027z3k2": "Hold on to the Nights", "m.02w8bnn": "The Best of Me", "m.02z693m": "This I Promise You", "m.02z8wxt": "Everybody", "m.047dns6": "Take This Heart", "m.047sv3_": "Now and Forever", "m.04f_5cs": "What About Me?", "m.0660y6p": "Don't Mean Nothing", "m.06w85_m": "To Where You Are", "m.06ztdrs": "Keep Coming Back", "m.080c98w": "Endless Summer Nights", "m.090b3g": "Better Life", "m.09v6mpn": "Crazy", "m.0dljzzm": "One More Time", "m.0dlk7dr": "Nothin' You Can Do About It", "m.0dnw07": "Right Here Waiting", "m.0gctfn": "Suddenly", "m.0gkn6l": "Dance with My Father", "m.0h3rvsp": "Long Hot Summer", "m.0j2572m": "Surrender to Me", "m.0j7ks26": "Should've Known Better", "m.0jyh___": "Angelia", "m.0n8gs8y": "Children of the Night", "m.0zh2zr8": "Streets of Pain", "m.0zj1mbm": "Every Year, Every Christmas", "m.0zjsk2p": "Hands in Your Pocket", "m.0zkpb0k": "Love Unemotional", "m.0zlwgbd": "Talent for Fame"}}, {"question": "what did ryan dunn died from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04sdsv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04sdsv ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Ryan Dunn ] )", "golden_entities": {"m.04sdsv": "Ryan Dunn"}, "answer_entities": {"m.08q1tg": "Traffic collision"}}, {"question": "where did al capone go to jail", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.014gr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.014gr ns:base.prison.prisoner.imprisoned ?y .\n?y ns:base.prison.imprisonment.prison ?x .\n}\n", "logical_form": "( JOIN ( R [ base , prison , imprisonment , prison ] ) ( JOIN ( R [ base , prison , prisoner , imprisoned ] ) [ Al Capone ] ) )", "golden_entities": {"m.014gr": "Al Capone"}, "answer_entities": {"m.027z7s": "Federal Correctional Institution, Terminal Island", "m.0ffk70": "United States Penitentiary, Atlanta", "m.0m0j7_8": "Alcatraz Federal Penitentiary"}}, {"question": "what type of music did richard wagner play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c44)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c44 ns:music.artist.genre ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , genre ] ) [ Richard Wagner ] )", "golden_entities": {"m.06c44": "Richard Wagner"}, "answer_entities": {"m.05lls": "Opera", "m.06gk7": "Romantic music", "m.0ggq0m": "Classical music"}}, {"question": "what airport in paris", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qtj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qtj ns:location.location.nearby_airports ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , nearby airports ] ) [ Paris ] )", "golden_entities": {"m.05qtj": "Paris"}, "answer_entities": {"m.01l525": "Paris Orly Airport", "m.02pp90s": "Orly Air Base", "m.03tjk2": "Beauvais\u2013Till\u00e9 Airport", "m.0qk79": "Charles de Gaulle Airport"}}, {"question": "what nationality was andy williams", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lvtb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lvtb ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Andy Williams ] )", "golden_entities": {"m.02lvtb": "Andy Williams"}, "answer_entities": {"m.09c7w0": "United States of America"}}, {"question": "where did matthew brady live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.028vw5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.028vw5 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Mathew Brady ] ) )", "golden_entities": {"m.028vw5": "Mathew Brady"}, "answer_entities": {"m.02_286": "New York City"}}, {"question": "in what country do they speak basque", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.017k6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.017k6 ns:language.human_language.countries_spoken_in ?x .\n}\n", "logical_form": "( JOIN ( R [ language , human language , countries spoken in ] ) [ Basque Language ] )", "golden_entities": {"m.017k6": "Basque Language"}, "answer_entities": {"m.06mkj": "Spain", "m.0f8l9c": "France"}}, {"question": "where is belgium at", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0154j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0154j ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Belgium ] )", "golden_entities": {"m.0154j": "Belgium"}, "answer_entities": {"m.02j9z": "Europe", "m.02qkt": "Eurasia", "m.0852h": "Western Europe"}}, {"question": "what did einstein do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jcx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jcx ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Albert Einstein ] )", "golden_entities": {"m.0jcx": "Albert Einstein"}, "answer_entities": {"m.01d30f": "Teacher", "m.02h6fbs": "Philosopher", "m.02ktm6n": "Theoretical Physicist", "m.04s2z": "Mathematician", "m.05snw": "Physicist", "m.06q2q": "Scientist", "m.0cbd2": "Writer", "m.0kyk": "Author"}}, {"question": "in what country is amsterdam", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k3p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k3p ns:base.biblioness.bibs_location.country ?x .\n}\n", "logical_form": "( JOIN ( R [ base , biblioness , bibs location , country ] ) [ Amsterdam ] )", "golden_entities": {"m.0k3p": "Amsterdam"}, "answer_entities": {"m.059j2": "Netherlands"}}]