[{"question": "on which continent is the usa located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09c7w0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09c7w0 ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ United States of America ] )", "golden_entities": {"m.09c7w0": "United States of America"}, "answer_entities": {"m.059g4": "North America"}}, {"question": "where is singapore on a world map", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06t2t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06t2t ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Singapore ] )", "golden_entities": {"m.06t2t": "Singapore"}, "answer_entities": {"m.0j0k": "Asia"}}, {"question": "what did bob ross die of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02hv0w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02hv0w ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Bob Ross ] )", "golden_entities": {"m.02hv0w": "Bob Ross"}, "answer_entities": {"m.0jdk0": "Lymphoma"}}, {"question": "where did martin luther live in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04yd_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04yd_ ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Martin Luther ] ) )", "golden_entities": {"m.04yd_": "Martin Luther"}, "answer_entities": {"m.044dng": "Eisleben", "m.0577d": "Magdeburg", "m.0cz504": "Mansfeld", "m.0g8gq": "Eisenach"}}, {"question": "what did george eastman make", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gc5r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gc5r ns:law.inventor.inventions ?x .\n}\n", "logical_form": "( JOIN ( R [ law , inventor , inventions ] ) [ George Eastman ] )", "golden_entities": {"m.0gc5r": "George Eastman"}, "answer_entities": {"m.017zc4": "Roll film"}}, {"question": "what movies has billy burke been in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fqv_3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fqv_3 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Billy Burke ] ) )", "golden_entities": {"m.0fqv_3": "Billy Burke"}, "answer_entities": {"m.026k37r": "Fracture", "m.02q0v8n": "Along Came a Spider", "m.02qh9tj": "Untraceable", "m.02rdvz1": "Feast of Love", "m.02vl04p": "Gone in the Night", "m.03__xl": "Ladder 49", "m.03nm_fh": "Twilight", "m.043p9_t": "Don't Look Down", "m.04j07_v": "Forfeit", "m.04j275n": "After Image", "m.05pdh86": "The Twilight Saga: New Moon", "m.06r6r_": "The Independent", "m.075wx7_": "Eclipse", "m.075wx89": "The Twilight Saga: Breaking Dawn - Part 1", "m.0b_w5w": "Komodo", "m.0b6rpt": "Mafia!", "m.0bh95g3": "Drive Angry", "m.0c241c_": "Red Riding Hood", "m.0c8nn5": "Without Limits", "m.0crtvd_": "To Cross The Rubicon", "m.0djz0rc": "The Twilight Saga: Breaking Dawn - Part 2", "m.0fbqqp": "Lost Junction", "m.0fwgv9": "Dill Scallion", "m.0g4fsqy": "Highland Park", "m.0gm1fy3": "Removal", "m.0gwsjv4": "Luster", "m.0gxm2g6": "David and Goliath", "m.0h15vfr": "The Grift", "m.0h28ldr": "Ticket Out", "m.0h2hcbj": "Freaky Deaky", "m.0ll2vtl": "Angels in Stardust"}}, {"question": "who was rudolf virchow", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.011kz4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.011kz4 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Rudolf Virchow ] )", "golden_entities": {"m.011kz4": "Rudolf Virchow"}, "answer_entities": {"m.03gq2jw": "Pathologist", "m.05t4q": "Physician", "m.06q2q": "Scientist", "m.0fj9f": "Politician"}}, {"question": "where did jennifer hudson go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ktrs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ktrs ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jennifer Hudson ] ) )", "golden_entities": {"m.02ktrs": "Jennifer Hudson"}, "answer_entities": {"m.01lgjy": "Langston University", "m.09v6gkq": "Dunbar Vocational High School"}}, {"question": "when did toronto blue jays become a team", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07l4z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07l4z ns:sports.sports_team.founded ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , founded ] ) [ Toronto Blue Jays ] )", "golden_entities": {"m.07l4z": "Toronto Blue Jays"}, "answer_entities": {"value": "1977"}}, {"question": "what is the zip code for moorpark ca", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0r87z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0r87z ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ Moorpark ] )", "golden_entities": {"m.0r87z": "Moorpark"}, "answer_entities": {"m.01zjg2j": "93021", "m.07nq1bc": "93020"}}, {"question": "what did mozart do to become famous", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.082db)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.082db ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Wolfgang Amadeus Mozart ] )", "golden_entities": {"m.082db": "Wolfgang Amadeus Mozart"}, "answer_entities": {"m.012vv0": "Violist", "m.01c72t": "Composer", "m.05vyk": "Pianist", "m.09jwl": "Musician"}}, {"question": "where was avril lavigne born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0161c2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0161c2 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Avril Lavigne ] )", "golden_entities": {"m.0161c2": "Avril Lavigne"}, "answer_entities": {"m.018dhx": "Belleville"}}, {"question": "what county is tampa located in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0n1rj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0n1rj ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Tampa ] )", "golden_entities": {"m.0n1rj": "Tampa"}, "answer_entities": {"m.0jj6k": "Hillsborough County"}}, {"question": "where are they now jessica mcclure", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_fvt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_fvt ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Jessica McClure ] ) )", "golden_entities": {"m.01_fvt": "Jessica McClure"}, "answer_entities": {"m.013n2h": "Midland"}}, {"question": "what other cars does gm make", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035nm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035nm ns:automotive.company.make_s ?x .\n?x ns:common.topic.notable_types ns:m.02ht342 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Automobile Make ] ) ( JOIN ( R [ automotive , company , make s ] ) [ General Motors ] ) )", "golden_entities": {"m.035nm": "General Motors", "m.02ht342": "Automobile Make"}, "answer_entities": {"m.0_knrlq": "GM Korea", "m.02_ty_": "Geo", "m.02mz1s": "LaSalle", "m.03h0wb": "Acadian", "m.03qyv": "Hummer", "m.056d3_": "Oakland Motor Car Company", "m.05pv27x": "GM PUMA", "m.0blvz": "Buick", "m.0dppm": "Oldsmobile", "m.0h734p8": "Holden", "m.0j68wwy": "Vauxhall", "m.0j6nb27": "HSV", "m.0j726ql": "General Motors", "m.0j72pxm": "GMC", "m.0xmf42g": "Pontiac", "m.0xmqcwb": "Terex"}}, {"question": "what movies does leo howard play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05sqlp_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05sqlp_ ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Leo Howard ] ) )", "golden_entities": {"m.05sqlp_": "Leo Howard"}, "answer_entities": {"m.03qcfvw": "G.I. Joe: The Rise of Cobra", "m.05qpqj6": "Shorts", "m.07k983r": "Logan", "m.0807n3z": "Children of the Corn", "m.0bhc5kw": "Conan the Barbarian", "m.0crrk72": "Aussie & Ted's Great Adventure"}}, {"question": "what instruments does john williams use", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0146pz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0146pz ns:music.group_member.instruments_played ?x .\n}\n", "logical_form": "( JOIN ( R [ music , group member , instruments played ] ) [ John Williams ] )", "golden_entities": {"m.0146pz": "John Williams"}, "answer_entities": {"m.0342h": "Guitar"}}, {"question": "what was the milwaukee brewers old name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051vz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051vz ns:sports.sports_team.previously_known_as ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , previously known as ] ) [ Milwaukee Brewers ] )", "golden_entities": {"m.051vz": "Milwaukee Brewers"}, "answer_entities": {"m.0fq2vj2": "Seattle Pilots"}}, {"question": "what airport is in kauai hawaii", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.014wxc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.014wxc ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01xpjyz .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Airport ] ) ( JOIN ( R [ location , location , contains ] ) [ Hawaiian Islands ] ) )", "golden_entities": {"m.014wxc": "Hawaiian Islands", "m.01xpjyz": "Airport"}, "answer_entities": {"m.0_rq2": "Lihue Airport", "m.01n5fw": "Honolulu International Airport", "m.01r3l2": "Kahului Airport", "m.02k5j7": "Kona International Airport", "m.0398q8": "Dillingham Airfield", "m.0398qm": "Hana Airport", "m.0398qz": "Kalaupapa Airport", "m.0398r_": "Molokai Airport", "m.0398r9": "Kapalua Airport", "m.0398rn": "Lanai Airport", "m.0398sb": "Hilo International Airport", "m.0398sq": "Waimea-Kohala Airport", "m.039g2f": "Kalaeloa Airport", "m.039ggn": "Port Allen Airport", "m.039ghr": "Upolu Airport", "m.03cybt3": "Marine Corps Air Station Kaneohe Bay", "m.03gddb": "Pacific Missile Range Facility", "m.07kd9xk": "French Frigate Shoals Airport", "m.08jyt_": "Princeville Airport", "m.09gkgdn": "Kaanapali Airport", "m.0hhhg6t": "Waikoloa Airport", "m.0s059": "Wheeler Army Airfield"}}, {"question": "what teams has lionel messi played for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06qjgc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06qjgc ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Lionel Messi ] ) )", "golden_entities": {"m.06qjgc": "Lionel Messi"}, "answer_entities": {"m.0276tq4": "FC Barcelona C", "m.02bh_v": "Argentina national football team", "m.096cw_": "FC Barcelona B", "m.0hvgt": "FC Barcelona"}}, {"question": "what countries in north america continent", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059g4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059g4 ns:base.locations.continents.countries_within ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , continents , countries within ] ) [ North America ] )", "golden_entities": {"m.059g4": "North America"}, "answer_entities": {"m.0160w": "Bahamas", "m.0162v": "Barbados", "m.0164b": "Belize", "m.01p8s": "Costa Rica", "m.027nb": "Dominica", "m.027rn": "Dominican Republic", "m.02k8k": "El Salvador", "m.03_r3": "Jamaica", "m.0345_": "Guatemala", "m.035yg": "Grenada", "m.03gyl": "Haiti", "m.03h2c": "Honduras", "m.05c74": "Nicaragua", "m.05qx1": "Panama", "m.06ryl": "Saint Kitts and Nevis", "m.06s0l": "Saint Lucia", "m.06s6l": "Saint Vincent and the Grenadines", "m.09c7w0": "United States of America", "m.09lxtg": "Trinidad and Tobago", "m.0b90_r": "Mexico", "m.0d04z6": "Cuba", "m.0d060g": "Canada", "m.0l3h": "Antigua and Barbuda"}}, {"question": "what time zone is colorado springs co", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vsl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vsl ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Colorado Springs ] )", "golden_entities": {"m.01vsl": "Colorado Springs"}, "answer_entities": {"m.02hczc": "Mountain Time Zone"}}, {"question": "what school did sergio romo go to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04cyz8g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04cyz8g ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Sergio Romo ] ) )", "golden_entities": {"m.04cyz8g": "Sergio Romo"}, "answer_entities": {"m.02hscq": "University of North Alabama"}}, {"question": "who play luke skywalker", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f1bg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f1bg ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Luke Skywalker ] ) )", "golden_entities": {"m.0f1bg": "Luke Skywalker"}, "answer_entities": {"m.0154d7": "Mark Hamill", "m.07l4yc": "Bob Bergen"}}, {"question": "where did john howard live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chh05)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chh05 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ John Howard ] ) )", "golden_entities": {"m.0chh05": "John Howard"}, "answer_entities": {"m.06y57": "Sydney"}}, {"question": "what does the name rome mean", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c62)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c62 ns:symbols.namesake.named_after ?x .\n}\n", "logical_form": "( JOIN ( R [ symbols , namesake , named after ] ) [ Rome ] )", "golden_entities": {"m.06c62": "Rome"}, "answer_entities": {"m.0ghqr": "Romulus and Remus"}}, {"question": "what inspired scott fitzgerald", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02zjd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02zjd ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ F. Scott Fitzgerald ] )", "golden_entities": {"m.02zjd": "F. Scott Fitzgerald"}, "answer_entities": {"m.0154x6": "Edith Wharton", "m.023jy9": "Sherwood Anderson", "m.0249ld": "R. D. Blackmore", "m.03p_bz": "Sara Murphy", "m.040dxk": "Shane Leslie", "m.0465_": "John Keats", "m.05nj0": "Oswald Spengler", "m.07g2b": "T. S. Eliot"}}, {"question": "what did george steinbrenner do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01q5t3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01q5t3 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ George Steinbrenner ] )", "golden_entities": {"m.01q5t3": "George Steinbrenner"}, "answer_entities": {"m.012t_z": "Businessperson", "m.025sppp": "Investor", "m.05sxg2": "Theatrical producer", "m.09x_r": "Entrepreneur"}}, {"question": "where did pablo picasso die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.060_7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.060_7 ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Pablo Picasso ] )", "golden_entities": {"m.060_7": "Pablo Picasso"}, "answer_entities": {"m.0cy97d": "Mougins"}}, {"question": "what do they speak in cambodia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xbgx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xbgx ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Cambodia ] )", "golden_entities": {"m.01xbgx": "Cambodia"}, "answer_entities": {"m.01lqm": "Khmer language", "m.04pp56": "Cambodian French", "m.064_8sq": "French"}}, {"question": "what kind of insurance does geico offer", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02r95v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02r95v ns:business.business_operation.industry ?x .\n}\n", "logical_form": "( JOIN ( R [ business , business operation , industry ] ) [ GEICO ] )", "golden_entities": {"m.02r95v": "GEICO"}, "answer_entities": {"m.03qbn81": "Insurance Carriers", "m.03qth54": "Fire, Marine, and Casualty Insurance"}}, {"question": "what time is nebraska now", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05fhy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05fhy ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Nebraska ] )", "golden_entities": {"m.05fhy": "Nebraska"}, "answer_entities": {"m.02fqwt": "Central Time Zone", "m.02hczc": "Mountain Time Zone"}}, {"question": "who is james dean", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01w32s8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01w32s8 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ James Dean ] )", "golden_entities": {"m.01w32s8": "James Dean"}, "answer_entities": {"m.02hrh1q": "Actor"}}, {"question": "where did bob dylan live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vrncs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vrncs ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Bob Dylan ] ) )", "golden_entities": {"m.01vrncs": "Bob Dylan"}, "answer_entities": {"m.02_286": "New York City", "m.0fpzwf": "Minneapolis", "m.0h1k6": "Duluth", "m.0r0m6": "Malibu", "m.0wjjx": "Hibbing"}}, {"question": "what is there to see in barcelona", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01f62)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01f62 ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Barcelona ] )", "golden_entities": {"m.01f62": "Barcelona"}, "answer_entities": {"m.01ggjl": "Camp Nou", "m.02rm8r0": "Pla\u00e7a d'Espanya, Barcelona", "m.03q84k": "La Rambla, Barcelona", "m.03q89c": "Gothic Quarter, Barcelona", "m.0422md": "Casa Vicens", "m.04cwdhr": "Montju\u00efc Cemetery", "m.05f62w4": "Parc del Laberint d'Horta", "m.09lb0y": "Museu Nacional d'Art de Catalunya", "m.0bdrf9": "Museu Picasso", "m.0bjy6x": "Arc de Triomf", "m.0bwhyzp": "Cursa de Bombers", "m.0bwl_hx": "Magic Fountain of Montju\u00efc", "m.0cgk4g": "Barcelona Museum of Contemporary Art", "m.0g6n3": "Sagrada Fam\u00edlia", "m.0g7wh": "Montserrat", "m.0j9nnpr": "Design Museum of Barcelona", "m.0kc62": "Tibidabo", "m.0kc7c": "Montju\u00efc", "m.0nvs": "Park G\u00fcell", "m.0nw8": "Casa Mil\u00e0", "m.0qlm2": "Palau de la M\u00fasica Catalana"}}, {"question": "who is larry ellison oracle", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01762z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01762z ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Larry Ellison ] )", "golden_entities": {"m.01762z": "Larry Ellison"}, "answer_entities": {"m.012t_z": "Businessperson", "m.025sppp": "Investor", "m.09x_r": "Entrepreneur"}}, {"question": "what is the zip code for fort stockton texas", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0107qn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0107qn ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ Fort Stockton ] )", "golden_entities": {"m.0107qn": "Fort Stockton"}, "answer_entities": {"m.0211sw9": "79735"}}, {"question": "what did egyptians speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02k54)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02k54 ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Egypt ] )", "golden_entities": {"m.02k54": "Egypt"}, "answer_entities": {"m.012zfy": "Siwi Language", "m.025rvv7": "Modern Standard Arabic", "m.02hx2cr": "Egyptian Arabic", "m.02hxbhg": "Sa'idi Arabic", "m.035t_3": "Arabic, Sudanese Spoken Language", "m.03wc2kf": "Bedawi Arabic", "m.051bnt": "Nobiin Language", "m.0c4chg": "Domari Language", "m.0jzc": "Arabic Language"}}, {"question": "what is vanderbilt 's mascot", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pq4w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pq4w ns:education.educational_institution.mascot ?x .\n}\n", "logical_form": "( JOIN ( R [ education , educational institution , mascot ] ) [ Vanderbilt University ] )", "golden_entities": {"m.01pq4w": "Vanderbilt University"}, "answer_entities": {"m.05k6hxh": "Vanderbilt University Mr. Commodore"}}, {"question": "what are the airports in chicago", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_d4 ns:location.location.nearby_airports ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , nearby airports ] ) [ Chicago ] )", "golden_entities": {"m.01_d4": "Chicago"}, "answer_entities": {"m.01ky66": "O'Hare International Airport", "m.01l1jx": "Chicago Midway International Airport", "m.026qfyq": "Aurora Municipal Airport", "m.027hrnx": "Lansing Municipal Airport", "m.0288msl": "Schaumburg Regional Airport", "m.02z431v": "Waukegan Regional Airport", "m.04rjc8": "Gary/Chicago International Airport", "m.08qt9p": "Chicago Executive Airport", "m.0d4v7r": "Lewis University Airport"}}, {"question": "what was van gogh famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m2 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Vincent van Gogh ] )", "golden_entities": {"m.07_m2": "Vincent van Gogh"}, "answer_entities": {"m.02nxqmh": "Painter", "m.03hz6vv": "Visual Artist", "m.0n1h": "Artist"}}, {"question": "where did jane goodall go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cbqk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cbqk ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jane Goodall ] ) )", "golden_entities": {"m.0cbqk": "Jane Goodall"}, "answer_entities": {"m.02hmw9": "Newnham College, Cambridge", "m.02hqqm": "Darwin College, Cambridge"}}, {"question": "who won 2012 presidential election in france", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05_5pmw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05_5pmw ns:government.election.winner ?x .\n}\n", "logical_form": "( JOIN ( R [ government , election , winner ] ) [ French presidential election, 2012 ] )", "golden_entities": {"m.05_5pmw": "French presidential election, 2012"}, "answer_entities": {"m.02qg4z": "Fran\u00e7ois Hollande"}}, {"question": "where did emily murphy go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.033_v2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.033_v2 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Emily Murphy ] ) )", "golden_entities": {"m.033_v2": "Emily Murphy"}, "answer_entities": {"m.05n93p": "Bishop Strachan School"}}, {"question": "where president nixon was born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c97)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c97 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Richard Nixon ] )", "golden_entities": {"m.06c97": "Richard Nixon"}, "answer_entities": {"m.0r2rk": "Yorba Linda"}}, {"question": "what else did eli whitney invent", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ncr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ncr ns:law.inventor.inventions ?x .\n}\n", "logical_form": "( JOIN ( R [ law , inventor , inventions ] ) [ Eli Whitney ] )", "golden_entities": {"m.02ncr": "Eli Whitney"}, "answer_entities": {"m.01ng1x": "Milling", "m.03ny5l": "Interchangeable parts", "m.0ctvd": "Cotton gin"}}, {"question": "who founded collegehumor", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05_s3l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05_s3l ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ CollegeHumor ] )", "golden_entities": {"m.05_s3l": "CollegeHumor"}, "answer_entities": {"m.03bvkch": "Josh Abramson", "m.04n5ycy": "Ricky Van Veen"}}, {"question": "what are the names of michael jackson movies", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Michael Jackson ] ) )", "golden_entities": {"m.09889g": "Michael Jackson"}, "answer_entities": {"m.0_cdzjp": "Michael Jackson Unmasked", "m.027fwmt": "The Wiz", "m.02qsfv": "Captain EO", "m.031t2d": "Men in Black II", "m.036ytw": "Moonwalker", "m.05f5tq": "Motown 25: Yesterday, Today, Forever", "m.065mvrb": "Free to Be\u2026 You and Me", "m.07hqvg": "Michael Jackson's Ghosts", "m.0djb05y": "Miss Cast Away", "m.0v435l3": "Captain EO Promo & Pre-show", "m.0v43grn": "Wiz on Down the Road"}}, {"question": "what timezone is illinois on", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03v0t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03v0t ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Illinois ] )", "golden_entities": {"m.03v0t": "Illinois"}, "answer_entities": {"m.02fqwt": "Central Time Zone"}}, {"question": "where was martin cooper from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bt6kc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bt6kc ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Martin Cooper ] )", "golden_entities": {"m.0bt6kc": "Martin Cooper"}, "answer_entities": {"m.01_d4": "Chicago"}}, {"question": "where is spain exactly located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mkj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mkj ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Spain ] )", "golden_entities": {"m.06mkj": "Spain"}, "answer_entities": {"m.02j9z": "Europe"}}]