[{"question": "where to visit near bangkok", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fn2g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fn2g ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Bangkok ] )", "golden_entities": {"m.0fn2g": "Bangkok"}, "answer_entities": {"m.01c1gj": "Wat Phra Kaew", "m.01d1vz": "Thonburi", "m.02816l2": "Bangkok Aquarium", "m.02jh89": "Grand Palace", "m.02pksll": "Samutprakarn Crocodile Farm and Zoo", "m.02vnrfw": "Bangkok National Museum", "m.02wwf3f": "Dusit Zoo", "m.03300t": "Khaosan Road", "m.03hlbr1": "Jim Thompson House", "m.03hp67d": "Ananta Samakhom Throne Hall", "m.03nr91r": "Siam Park City", "m.03t0m6": "Democracy Monument", "m.047sllp": "Safari World", "m.04q452": "Wat Pho", "m.05s69t": "Wat Arun", "m.06nynb": "Wat Benchamabophit", "m.07_w5j": "Vimanmek Mansion", "m.07cz23": "Erawan Shrine", "m.07dj1f": "Wat Ratchanatdaram", "m.07qb9k": "Wat Suthat", "m.080c8kl": "Golden Buddha", "m.09dnj5": "Chatuchak Park", "m.09qjqb": "Bangkok International Trade and Exhibition Centre", "m.09rxcz": "Lumphini Park", "m.0fp635": "Rajamangala Stadium", "m.0h6w70": "Wat Saket", "m.0vb3kfz": "Magic Land"}}, {"question": "what year did tut became king", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07hcc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07hcc ns:base.ancientegypt.pharaoh.reign ?y .\n?y ns:measurement_unit.time_interval.start ?x .\n}\n", "logical_form": "( JOIN ( R [ measurement unit , time interval , start ] ) ( JOIN ( R [ base , ancientegypt , pharaoh , reign ] ) [ Tutankhamun ] ) )", "golden_entities": {"m.07hcc": "Tutankhamun"}, "answer_entities": {"value": "-1332"}}, {"question": "where do baltimore ravens play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ct6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ct6 ns:sports.sports_team.arena_stadium ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Baltimore Ravens ] )", "golden_entities": {"m.01ct6": "Baltimore Ravens"}, "answer_entities": {"m.01yq7r": "M&T Bank Stadium"}}, {"question": "what is the dominant language in israel", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03spz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03spz ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ Israel ] )", "golden_entities": {"m.03spz": "Israel"}, "answer_entities": {"m.03hkp": "Hebrew Language", "m.0jzc": "Arabic Language"}}, {"question": "what are the main languages of nigeria", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05cgv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05cgv ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ Nigeria ] )", "golden_entities": {"m.05cgv": "Nigeria"}, "answer_entities": {"m.02h40lc": "English Language"}}, {"question": "what jobs did ben franklin do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019fz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019fz ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Benjamin Franklin ] )", "golden_entities": {"m.019fz": "Benjamin Franklin"}, "answer_entities": {"m.016fc2": "Statesman", "m.01l5t6": "Librarian", "m.02kv97_": "Satirist", "m.03sbb": "Inventor", "m.05r6c": "Printer", "m.05svgpc": "Political activist", "m.06q2q": "Scientist", "m.080ntlp": "Diplomat", "m.09jwl": "Musician", "m.0cbd2": "Writer", "m.0fj9f": "Politician", "m.0kyk": "Author"}}, {"question": "what bible does the catholic church follow", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c8wxp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c8wxp ns:religion.religion.texts ?x .\n}\n", "logical_form": "( JOIN ( R [ religion , religion , texts ] ) [ Catholicism ] )", "golden_entities": {"m.0c8wxp": "Catholicism"}, "answer_entities": {"m.015j7": "The Bible", "m.01dfl": "Book of Nehemiah", "m.05crg": "New Testament", "m.05ld9": "Old Testament"}}, {"question": "what did nick clegg study at university", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.036547)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.036547 ns:people.person.education ?y .\n?y ns:education.education.major_field_of_study ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , major field of study ] ) ( JOIN ( R [ people , person , education ] ) [ Nick Clegg ] ) )", "golden_entities": {"m.036547": "Nick Clegg"}, "answer_entities": {"m.05r79": "Political philosophy", "m.074n0": "Social anthropology"}}, {"question": "what school did cassie bernall go to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0219mf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0219mf ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Cassie Bernall ] ) )", "golden_entities": {"m.0219mf": "Cassie Bernall"}, "answer_entities": {"m.021djq": "Columbine High School"}}, {"question": "what movie did james frey write", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06w054)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06w054 ns:film.writer.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , writer , film ] ) [ James Frey ] )", "golden_entities": {"m.06w054": "James Frey"}, "answer_entities": {"m.05nm_9c": "Sugar: The Fall of the West", "m.08vh65": "Kissing a Fool"}}, {"question": "what did st. matthew do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0565x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0565x ns:book.author.works_written ?x .\n}\n", "logical_form": "( JOIN ( R [ book , author , works written ] ) [ Matthew the Apostle ] )", "golden_entities": {"m.0565x": "Matthew the Apostle"}, "answer_entities": {"m.038v8": "Gospel of Matthew", "m.0b77943": "Matthew 5:20"}}, {"question": "what was nelson mandela 's religion", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g7q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g7q ns:people.person.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , religion ] ) [ Nelson Mandela ] )", "golden_entities": {"m.05g7q": "Nelson Mandela"}, "answer_entities": {"m.051kv": "Methodism"}}, {"question": "what is henry clay known for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ct18)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ct18 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Henry Clay ] )", "golden_entities": {"m.0ct18": "Henry Clay"}, "answer_entities": {"m.016fc2": "Statesman", "m.04gc2": "Lawyer", "m.0fj9f": "Politician"}}, {"question": "who was the apostle paul considered to be", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.060nc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.060nc ns:fictional_universe.person_in_fiction.representations_in_fiction ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , person in fiction , representations in fiction ] ) [ Paul the Apostle ] )", "golden_entities": {"m.060nc": "Paul the Apostle"}, "answer_entities": {"m.042gzwd": "Paul the Apostle"}}, {"question": "what currency does ontario canada use", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d060g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d060g ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Canada ] )", "golden_entities": {"m.0d060g": "Canada"}, "answer_entities": {"m.0ptk_": "Canadian dollar"}}, {"question": "where did the casey anthony case take place", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04gtx2_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04gtx2_ ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ Death of Caylee Anthony ] )", "golden_entities": {"m.04gtx2_": "Death of Caylee Anthony"}, "answer_entities": {"m.0ply0": "Orlando"}}, {"question": "what was the name of the original seattle baseball team", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fq2vj2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fq2vj2 ns:type.object.name ?x .\n}\n", "logical_form": "( JOIN ( R [ type , object , name ] ) [ Seattle Pilots ] )", "golden_entities": {"m.0fq2vj2": "Seattle Pilots"}, "answer_entities": {"value": "Seattle Pilots"}}, {"question": "when were the texas rangers started", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07l8x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07l8x ns:sports.sports_team.founded ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , founded ] ) [ Texas Rangers ] )", "golden_entities": {"m.07l8x": "Texas Rangers"}, "answer_entities": {"value": "1972"}}, {"question": "where did the houston oilers football team go", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04nmxtk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04nmxtk ns:sports.defunct_sports_team.later_known_as ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , defunct sports team , later known as ] ) [ Houston Oilers ] )", "golden_entities": {"m.04nmxtk": "Houston Oilers"}, "answer_entities": {"m.06f2k5d": "Tennessee Oilers"}}, {"question": "where does niles crane live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02c81m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02c81m ns:fictional_universe.fictional_character.places_lived ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , fictional character , places lived ] ) [ Niles Crane ] )", "golden_entities": {"m.02c81m": "Niles Crane"}, "answer_entities": {"m.0d9jr": "Seattle"}}, {"question": "where was gabriel faure born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jn7y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jn7y ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Gabriel Faur\u00e9 ] )", "golden_entities": {"m.0jn7y": "Gabriel Faur\u00e9"}, "answer_entities": {"m.063bzq": "Pamiers"}}, {"question": "where did the massive allied invasion of northern france take place in june 1944", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chhs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chhs ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ Invasion of Normandy ] )", "golden_entities": {"m.0chhs": "Invasion of Normandy"}, "answer_entities": {"m.05g56": "Normandy"}}, {"question": "which countries are part of the united kingdom", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ssc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ssc ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ United Kingdom ] ) )", "golden_entities": {"m.07ssc": "United Kingdom", "m.01mp": "Country"}, "answer_entities": {"m.02jx1": "England", "m.0366c": "Guernsey", "m.05bcl": "Northern Ireland", "m.06q1r": "Scotland", "m.0j5g9": "Wales"}}, {"question": "what is the postcode for london", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04jpl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04jpl ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ London ] )", "golden_entities": {"m.04jpl": "London"}, "answer_entities": {"m.09rzxp9": "SW1X 8RN", "m.09sfglt": "SW3 6RS", "m.0cvp88j": "W1W5BD", "m.0cxn7ws": "E5 8BP", "m.0cxsp04": "E6 6ER", "m.0cxss5g": "E15 4HT", "m.0cy0j66": "SE1 7JW", "m.0cy1q47": "WC1X 8RA", "m.0cy1sy5": "SW1P 2PD", "m.0cy1z55": "W1F 0HS", "m.0cy1ztb": "NW1 3HB", "m.0cy6s01": "W11 3JS", "m.0cy8plg": "SW5 0HL"}}, {"question": "what language does fiji", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02wt0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02wt0 ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ Fiji ] )", "golden_entities": {"m.02wt0": "Fiji"}, "answer_entities": {"m.020gps": "Fijian Language", "m.02h40lc": "English Language", "m.02hwsll": "Fiji Hindi"}}, {"question": "where is mitsubishi headquarters", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0czgc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0czgc ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Mitsubishi Group ] ) )", "golden_entities": {"m.0czgc": "Mitsubishi Group"}, "answer_entities": {"m.07dfk": "Tokyo"}}, {"question": "who are betty white 's parents", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025mb_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025mb_ ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ Betty White ] )", "golden_entities": {"m.025mb_": "Betty White"}, "answer_entities": {"m.0gy8d8n": "Horace Lawrence White", "m.0gy8d8z": "Tess Curtis White"}}, {"question": "where did jeff dunham go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ch_0g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ch_0g ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jeff Dunham ] ) )", "golden_entities": {"m.0ch_0g": "Jeff Dunham"}, "answer_entities": {"m.01tx9m": "Baylor University"}}, {"question": "what movies did diana ross play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wrcxr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wrcxr ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Diana Ross ] ) )", "golden_entities": {"m.01wrcxr": "Diana Ross"}, "answer_entities": {"m.01295rtw": "The Supremes In The Orient", "m.01gvpz": "Lady Sings the Blues", "m.027fwmt": "The Wiz", "m.04l7z_": "The Land Before Time", "m.05n1_9": "Mahogany", "m.067zjb": "Double Platinum", "m.07bdfb": "Out of Darkness", "m.0crt8tb": "Diana Ross: Visions of Diana Ross", "m.0crtmx7": "Christmas in Vienna", "m.0crv8zq": "Diana Ross: The Lady Sings Jazz and Blues", "m.0crvchf": "We Are Family", "m.0h0zm10": "It's Black Entertainment!"}}, {"question": "what is the zip code for minneapolis", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fpzwf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fpzwf ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ Minneapolis ] )", "golden_entities": {"m.0fpzwf": "Minneapolis"}, "answer_entities": {"m.01_x_4z": "55401", "m.01_x_8g": "55434", "m.01_x_qk": "55449", "m.01_y0_0": "55439", "m.01_y0gq": "55425", "m.01_y0jp": "55431", "m.01_y0kh": "55420", "m.01_y0ms": "55437", "m.01_y0q_": "55435", "m.01_y1yp": "55438", "m.01_y3_x": "55428", "m.01_y3h3": "55429", "m.01_y3j5": "55430", "m.01_y41c": "55445", "m.01_y467": "55443", "m.01_y48c": "55444", "m.01_y7w7": "55421", "m.01_y83k": "55448", "m.01_y89x": "55433", "m.01_y9z4": "55422", "m.01_yd4v": "55424", "m.01_ydb4": "55410", "m.01_ydmy": "55436", "m.01_yhvb": "55432", "m.01_yjfc": "55416", "m.01_yjgp": "55426", "m.01_yjjm": "55427", "m.01_yjqc": "55441", "m.01_yqg4": "55417", "m.01_yr_z": "55408", "m.01_yrfl": "55406", "m.01_yrgm": "55403", "m.01_yrlg": "55414", "m.01_yrpq": "55402", "m.01_yry4": "55407", "m.01_ys37": "55413", "m.01_ys66": "55409", "m.01_ysl3": "55405", "m.01_yszb": "55404", "m.01_ytb1": "55419", "m.01_ytcq": "55415", "m.01_yv9p": "55423", "m.01_yvfs": "55411", "m.01_yxn1": "55447", "m.01_yxyn": "55454", "m.01_yycq": "55418", "m.01_zhy6": "55412", "m.01_znb8": "55442", "m.01_zp8l": "55446", "m.02wvhc5": "55455", "m.03ds9j3": "55450", "m.07nqpnj": "55488", "m.07nqpnr": "55487", "m.07nqpnz": "55486", "m.07nqpp5": "55485", "m.07nqppd": "55484", "m.07nqppm": "55483", "m.07nqppv": "55480", "m.07nqpq_": "55472", "m.07nqpq1": "55479", "m.07nqpq8": "55478", "m.07nqpqh": "55474", "m.07nqpqq": "55473", "m.07nqpr6": "55470", "m.07nqprf": "55467", "m.07nqprn": "55460", "m.07nqprw": "55459", "m.07nqps2": "55458", "m.07nqps9": "55440", "m.09rzq2n": "55422-3330"}}, {"question": "what country is the west bank located in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.082pc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.082pc ns:base.biblioness.bibs_location.country ?x .\n}\n", "logical_form": "( JOIN ( R [ base , biblioness , bibs location , country ] ) [ West Bank ] )", "golden_entities": {"m.082pc": "West Bank"}, "answer_entities": {"m.0604m": "Palestinian National Authority"}}, {"question": "who won golden boot", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0by030z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0by030z ns:award.award_category.winners ?y .\n?y ns:award.award_honor.award_winner ?x .\n}\n", "logical_form": "( JOIN ( R [ award , award honor , award winner ] ) ( JOIN ( R [ award , award category , winners ] ) [ Premier League Golden Boot ] ) )", "golden_entities": {"m.0by030z": "Premier League Golden Boot"}, "answer_entities": {"m.02xt6q": "Cristiano Ronaldo", "m.04j7c7": "Robin van Persie"}}, {"question": "where did jane mansfield die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.024y6w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.024y6w ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Jayne Mansfield ] )", "golden_entities": {"m.024y6w": "Jayne Mansfield"}, "answer_entities": {"m.0tmsj": "Slidell"}}, {"question": "where is the thames river located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d2kt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d2kt ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ River Thames ] )", "golden_entities": {"m.0d2kt": "River Thames"}, "answer_entities": {"m.02j9z": "Europe", "m.02jx1": "England", "m.07ssc": "United Kingdom"}}, {"question": "what school did william shakespeare attend", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081k8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081k8 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ William Shakespeare ] ) )", "golden_entities": {"m.081k8": "William Shakespeare"}, "answer_entities": {"m.08p297": "King Edward VI School, Stratford-upon-Avon"}}, {"question": "what money do they use in chile", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p1v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p1v ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Chile ] )", "golden_entities": {"m.01p1v": "Chile"}, "answer_entities": {"m.0172zs": "Chilean peso"}}, {"question": "what does nick cannon play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01d1st)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01d1st ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , series ] ) ( JOIN ( R [ tv , tv actor , starring roles ] ) [ Nick Cannon ] ) )", "golden_entities": {"m.01d1st": "Nick Cannon"}, "answer_entities": {"m.0125f1": "All That", "m.02pzsft": "Nick Cannon Presents: Short Circuitz", "m.02vrvv": "Soul Train", "m.0cnyxtv": "The Nightlife", "m.0d4x_3": "The Nick Cannon Show", "m.0m_921m": "Mash Up"}}, {"question": "where did matthias schleiden go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dd3q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dd3q ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Matthias Jakob Schleiden ] ) )", "golden_entities": {"m.0dd3q": "Matthias Jakob Schleiden"}, "answer_entities": {"m.0pmcz": "Heidelberg University"}}, {"question": "what happened to daddy yankee", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wbl_r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wbl_r ns:base.disaster2.injured_person.injuries ?y .\n?y ns:base.disaster2.injury.type_of_event ?x .\n}\n", "logical_form": "( JOIN ( R [ base , disaster2 , injury , type of event ] ) ( JOIN ( R [ base , disaster2 , injured person , injuries ] ) [ Daddy Yankee ] ) )", "golden_entities": {"m.01wbl_r": "Daddy Yankee"}, "answer_entities": {"m.032s66": "Gunshot"}}, {"question": "what language do they speak in thai", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07f1x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07f1x ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ Thailand ] )", "golden_entities": {"m.07f1x": "Thailand"}, "answer_entities": {"m.0c_v2": "Thai Language"}}, {"question": "where was princess leia raised", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ddqw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ddqw ns:fictional_universe.fictional_character.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , fictional character , place of birth ] ) [ Leia Organa ] )", "golden_entities": {"m.0ddqw": "Leia Organa"}, "answer_entities": {"g.120mc0gk": "Polis Massa"}}, {"question": "what is the name of the pittsburgh steelers head coach", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05tfm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05tfm ns:american_football.football_team.current_head_coach ?x .\n}\n", "logical_form": "( JOIN ( R [ american football , football team , current head coach ] ) [ Pittsburgh Steelers ] )", "golden_entities": {"m.05tfm": "Pittsburgh Steelers"}, "answer_entities": {"m.0c5f_j": "Mike Tomlin"}}, {"question": "when did the lakers win the championship", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jmk7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jmk7 ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Los Angeles Lakers ] )", "golden_entities": {"m.0jmk7": "Los Angeles Lakers"}, "answer_entities": {"m.04gg8b0": "2009 NBA Finals", "m.08x9_6": "1980 NBA Finals", "m.08x9ff": "2002 NBA Finals", "m.08x9gt": "2000 NBA Finals", "m.08x9hh": "2001 NBA Finals", "m.08x9v9": "1988 NBA Finals", "m.08x9w1": "1987 NBA Finals", "m.08x9x3": "1985 NBA Finals", "m.08x9z5": "1982 NBA Finals", "m.0bx_x85": "2010 NBA Finals", "m.0cs1ny": "1972 NBA Finals", "m.0cs2tz": "1954 NBA Finals", "m.0cs2wc": "1953 NBA Finals", "m.0cs2z5": "1952 NBA Finals", "m.0ct7_g": "1950 NBA Finals", "m.0ct81k": "1949 BAA Finals", "m.0n4cn6w": "1948 NBL Finals"}}, {"question": "what did patrick swayze sing", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02h3tp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02h3tp ns:music.artist.track ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , track ] ) [ Patrick Swayze ] )", "golden_entities": {"m.02h3tp": "Patrick Swayze"}, "answer_entities": {"m.010fyfc": "She's Like the Wind", "m.0fhpy55": "She's Like the Wind", "m.0g0szh8": "She's Like The Wind", "m.0g7rg7k": "She's Like the Wind", "m.0g93m8p": "She's Like the Wind", "m.0lr1bk": "Raising Heaven (In Hell Tonight)", "m.0lr1c6": "Cliff's Edge", "m.0nn3wj9": "She's Like the Wind (Dan\u00e7a Quente)", "m.0q19z6": "She's Like the Wind", "m.0rsh2gn": "She's Like the Wind", "m.0sjjh13": "She's Like the Wind (Dirty Dancing)", "m.0x4dsp": "Brothers", "m.0yhl4q": "She's Like the Wind"}}, {"question": "what style of art is salvador dali", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09_xn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09_xn ns:visual_art.visual_artist.art_forms ?x .\n}\n", "logical_form": "( JOIN ( R [ visual art , visual artist , art forms ] ) [ Salvador Domingo Felipe Jacinto Dal\u00ed i Dom\u00e8nech ] )", "golden_entities": {"m.09_xn": "Salvador Domingo Felipe Jacinto Dal\u00ed i Dom\u00e8nech"}, "answer_entities": {"m.02csf": "Drawing", "m.05qdh": "Painting", "m.05wkw": "Photography", "m.06msq": "Sculpture"}}, {"question": "what city was leonardo da vinci from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lg6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lg6 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Leonardo da Vinci ] )", "golden_entities": {"m.04lg6": "Leonardo da Vinci"}, "answer_entities": {"m.032kkn": "Vinci"}}, {"question": "what did george v die of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cmpn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cmpn ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ George V ] )", "golden_entities": {"m.0cmpn": "George V"}, "answer_entities": {"m.02m25": "Euthanasia"}}, {"question": "who started pixar", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kk9v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kk9v ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ Pixar ] )", "golden_entities": {"m.0kk9v": "Pixar"}, "answer_entities": {"m.017h4c": "Edwin Catmull", "m.06y3r": "Steve Jobs"}}, {"question": "who is tia and tamera mowry parents", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.054xvs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.054xvs ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ Tia Mowry ] )", "golden_entities": {"m.054xvs": "Tia Mowry"}, "answer_entities": {"m.0b_x1n8": "Darlene Mowry", "m.0gygc8m": "Tim Mowry"}}, {"question": "where is the nation of greece located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035qy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035qy ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Greece ] )", "golden_entities": {"m.035qy": "Greece"}, "answer_entities": {"m.02j9z": "Europe"}}, {"question": "what year was the new york blackout", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02j2gt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02j2gt ns:time.event.start_date ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , start date ] ) [ New York City blackout of 1977 ] )", "golden_entities": {"m.02j2gt": "New York City blackout of 1977"}, "answer_entities": {"value": "1977-07-13"}}, {"question": "what position does rafael furcal play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jtzg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jtzg ns:baseball.baseball_player.position_s ?x .\n}\n", "logical_form": "( JOIN ( R [ baseball , baseball player , position s ] ) [ Rafael Furcal ] )", "golden_entities": {"m.03jtzg": "Rafael Furcal"}, "answer_entities": {"m.017drs": "Shortstop", "m.02rsl1": "Second baseman"}}]