[{"question": "on which river is paris", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qtj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qtj ns:location.location.partially_contains ?x .\n?x ns:common.topic.notable_types ns:m.01xs05k .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ River ] ) ( JOIN ( R [ location , location , partially contains ] ) [ Paris ] ) )", "golden_entities": {"m.05qtj": "Paris", "m.01xs05k": "River"}, "answer_entities": {"m.0f3vz": "Seine"}}, {"question": "who was sam houston answers", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gbjz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gbjz ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Sam Houston ] )", "golden_entities": {"m.0gbjz": "Sam Houston"}, "answer_entities": {"m.012qdp": "Military Officer", "m.04gc2": "Lawyer", "m.099md": "Soldier", "m.0fj9f": "Politician"}}, {"question": "where does manny pacquiao live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03pmbb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03pmbb ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Manny Pacquiao ] ) )", "golden_entities": {"m.03pmbb": "Manny Pacquiao"}, "answer_entities": {"m.01rfwg": "South Cotabato", "m.03fyt0": "Kiamba"}}, {"question": "where did pharaoh hatshepsut live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gj3r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gj3r ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Hatshepsut ] )", "golden_entities": {"m.0gj3r": "Hatshepsut"}, "answer_entities": {"m.02k54": "Egypt"}}, {"question": "where did the seminole native americans live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0198dl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0198dl ns:people.ethnicity.geographic_distribution ?x .\n}\n", "logical_form": "( JOIN ( R [ people , ethnicity , geographic distribution ] ) [ Seminole ] )", "golden_entities": {"m.0198dl": "Seminole"}, "answer_entities": {"m.05mph": "Oklahoma"}}, {"question": "what county is plymouth ia in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0sswj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0sswj ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Plymouth ] )", "golden_entities": {"m.0sswj": "Plymouth"}, "answer_entities": {"m.0nsfl": "Cerro Gordo County"}}, {"question": "what airlines fly into ontario international airport", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01l4_l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01l4_l ns:aviation.airport.hub_for ?x .\n}\n", "logical_form": "( JOIN ( R [ aviation , airport , hub for ] ) [ Ontario International Airport ] )", "golden_entities": {"m.01l4_l": "Ontario International Airport"}, "answer_entities": {"m.01srh1": "Great Lakes Airlines", "m.026tgjz": "West Air", "m.02ppptb": "UPS Airlines", "m.06xnkm": "Ameriflight"}}, {"question": "what school did kurt vonnegut go to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.049gc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.049gc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Kurt Vonnegut ] ) )", "golden_entities": {"m.049gc": "Kurt Vonnegut"}, "answer_entities": {"m.01qgr3": "University of Tennessee", "m.01w3v": "Cornell University", "m.02q2x61": "Shortridge High School", "m.03bnd9": "Butler University", "m.07wrz": "University of Chicago", "m.0cwx_": "Carnegie Mellon University"}}, {"question": "where did henry hudson come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c065)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c065 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Henry Hudson ] )", "golden_entities": {"m.0c065": "Henry Hudson"}, "answer_entities": {"m.02jx1": "England"}}, {"question": "which continent is costa rica located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p8s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p8s ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Costa Rica ] )", "golden_entities": {"m.01p8s": "Costa Rica"}, "answer_entities": {"m.059g4": "North America"}}, {"question": "what movies has halle berry starred in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03knl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03knl ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Halle Berry ] ) )", "golden_entities": {"m.03knl": "Halle Berry"}, "answer_entities": {"m.01265dl4": "Kidnap", "m.014kq6": "Die Another Day", "m.016f62": "Jungle Fever", "m.01bn3l": "The Flintstones", "m.01qb5d": "X-Men 2", "m.026s0mx": "The Wedding", "m.0273yvf": "Welcome to Hollywood", "m.02ql071": "Nappily Ever After", "m.02v8kmz": "Bulworth", "m.02vr9lr": "Things We Lost in the Fire", "m.0344gc": "Monster's Ball", "m.034fj2": "The Last Boy Scout", "m.03cd0x": "Catwoman", "m.03cj29": "Gothika", "m.03mh94": "Robots", "m.03qfr0": "Losing Isaiah", "m.03tv11": "Swordfish", "m.04jrzl": "Girl 6", "m.04sbsq": "CB4", "m.04yft1h": "Frankie & Alice", "m.0695g8": "Boomerang", "m.06gb1w": "X-Men: The Last Stand", "m.0727__": "Introducing Dorothy Dandridge", "m.07vc1p": "Their Eyes Were Watching God", "m.086s7z": "B*A*P*S", "m.087kv6": "Why Do Fools Fall in Love", "m.08bzc3": "Perfect Stranger", "m.08r9v6": "Strictly Business", "m.09fgyt": "The Program", "m.0d1s9b": "Race the Sun", "m.0d7nyly": "Solomon & Sheba", "m.0d90m": "X-Men", "m.0dgcgl": "The Rich Man's Wife", "m.0dlk_qn": "Movie 43", "m.0fphf3v": "New Year's Eve", "m.0g4fnsc": "Dark Tide", "m.0gh65c5": "Cloud Atlas", "m.0gyxl7y": "A Discussion About Things We Lost in the Fire", "m.0hqrx": "Executive Decision", "m.0hz7vs4": "The Call", "m.0kv750": "Father Hood", "m.0r3r5jz": "X-Men: Days of Future Past", "m.0y59lrv": "Tulia"}}, {"question": "what was the capital of ancient israel", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04fry)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04fry ns:location.country.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , capital ] ) [ Kingdom of Israel ] )", "golden_entities": {"m.04fry": "Kingdom of Israel"}, "answer_entities": {"m.01hxx6": "Nablus", "m.01p205": "Shechem", "m.0430_": "Jerusalem", "m.0b__9_0": "Tirzah", "m.0ch27v_": "Samaria"}}, {"question": "where is reggie bush from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05cb70)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05cb70 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Reggie Bush ] )", "golden_entities": {"m.05cb70": "Reggie Bush"}, "answer_entities": {"m.0r57n": "Spring Valley"}}, {"question": "what has sara paxton been in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.075ms_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.075ms_ ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Sara Paxton ] ) )", "golden_entities": {"m.075ms_": "Sara Paxton"}, "answer_entities": {"m.027qv_z": "Geppetto", "m.027s88w": "Perfect Game (1999)", "m.02qd6kv": "Sydney White", "m.02vz8ls": "The Party Never Stops: Diary of a Binge Drinker", "m.0309c5": "Liar Liar", "m.036g88": "Soldier", "m.03k93x": "Sleepover", "m.04j2jrv": "Durango Kids", "m.05b3jh0": "The Last House on the Left", "m.0754ns": "Aquamarine", "m.091f4r": "Music from Another Room", "m.0b2f_2": "Superhero Movie", "m.0bmw81": "Haunted Lighthouse", "m.0by0lmk": "The Innkeepers", "m.0d7907": "Return to Halloweentown", "m.0dsb6l1": "Shark Night", "m.0fmpqc": "Hounded", "m.0gvttx5": "Liars All", "m.0gyd5y6": "Mother Goose Parade", "m.0gynnws": "Static", "m.0h26kbw": "The Big Valley", "m.0h2j98j": "Enter Nowhere", "m.0h2j9dq": "The Boys of Abu Ghraib", "m.0h2j9gj": "The Briar Lake Murders", "m.0h2j9hf": "Hollywood Takes a Stand Against Planking", "m.0hnk_h_": "Blue-Eyed Butcher", "m.0lgpmxy": "I Brake for Gringos", "m.0lgpmz6": "Love and Air Sex", "m.0lgpmzr": "Rodeo Drive Diva", "m.0my1sv9": "Cheap Thrills", "m.0tkf_0d": "Lovestruck: The Musical"}}, {"question": "what is mexico city time zone", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04sqj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04sqj ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Mexico City ] )", "golden_entities": {"m.04sqj": "Mexico City"}, "answer_entities": {"m.02fqwt": "Central Time Zone"}}, {"question": "who is the head coach of the indianapolis colts", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03wnh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03wnh ns:american_football.football_team.current_head_coach ?x .\n}\n", "logical_form": "( JOIN ( R [ american football , football team , current head coach ] ) [ Indianapolis Colts ] )", "golden_entities": {"m.03wnh": "Indianapolis Colts"}, "answer_entities": {"m.03mbsxm": "Chuck Pagano"}}, {"question": "what is the syracuse university mascot", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.078bz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.078bz ns:education.educational_institution.mascot ?x .\n}\n", "logical_form": "( JOIN ( R [ education , educational institution , mascot ] ) [ Syracuse University ] )", "golden_entities": {"m.078bz": "Syracuse University"}, "answer_entities": {"m.03c0lxb": "Syracuse University Otto the Orange"}}, {"question": "where does the shannon river end", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0m_dt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0m_dt ns:geography.river.mouth ?x .\n}\n", "logical_form": "( JOIN ( R [ geography , river , mouth ] ) [ River Shannon ] )", "golden_entities": {"m.0m_dt": "River Shannon"}, "answer_entities": {"m.02py6xf": "Shannon Estuary"}}, {"question": "what drug did mitch hedberg overdose on", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vzgl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vzgl ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Mitch Hedberg ] )", "golden_entities": {"m.02vzgl": "Mitch Hedberg"}, "answer_entities": {"m.02kp1qn": "Heroin overdose"}}, {"question": "what is british columbia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015jr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015jr ns:base.aareas.schema.administrative_area.administrative_area_type ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , administrative area type ] ) [ British Columbia ] )", "golden_entities": {"m.015jr": "British Columbia"}, "answer_entities": {"m.0hzcdlq": "Canadian province"}}, {"question": "what language do you speak in austria", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h7x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h7x ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Austria ] )", "golden_entities": {"m.0h7x": "Austria"}, "answer_entities": {"m.0140n_": "Bavarian Language", "m.01841n": "Bosnian language", "m.02hwyss": "Turkish Language", "m.02ztjwg": "Hungarian language", "m.04306rv": "German Language", "m.06zvd": "Slovene language", "m.0k0sb": "Serbian language", "m.0k0sv": "Croatian language", "m.0k1b": "Austrian German"}}, {"question": "where did roger moore live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.017lqp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.017lqp ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Roger Moore ] ) )", "golden_entities": {"m.017lqp": "Roger Moore"}, "answer_entities": {"m.04jpl": "London", "m.062m9r": "Holsworthy", "m.0nc84": "Stockwell"}}, {"question": "where did carmen electra grow up", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lbp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lbp ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Carmen Electra ] )", "golden_entities": {"m.01lbp": "Carmen Electra"}, "answer_entities": {"m.013jdh": "Sharonville"}}, {"question": "what band does adam levine sing for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.044mfr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.044mfr ns:music.group_member.membership ?y .\n?y ns:music.group_membership.group ?x .\n}\n", "logical_form": "( JOIN ( R [ music , group membership , group ] ) ( JOIN ( R [ music , group member , membership ] ) [ Adam Levine ] ) )", "golden_entities": {"m.044mfr": "Adam Levine"}, "answer_entities": {"m.02k5sc": "Maroon 5", "m.06kkj8": "Kara's Flowers"}}, {"question": "where did robert hooke get his education", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d6j4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d6j4 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Robert Hooke ] ) )", "golden_entities": {"m.0d6j4": "Robert Hooke"}, "answer_entities": {"m.01722w": "Westminster School", "m.07tgn": "University of Oxford", "m.0yls9": "Christ Church, Oxford", "m.0ymff": "Wadham College, Oxford"}}, {"question": "what time is kansas in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0488g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0488g ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Kansas ] )", "golden_entities": {"m.0488g": "Kansas"}, "answer_entities": {"m.02fqwt": "Central Time Zone", "m.02hczc": "Mountain Time Zone"}}, {"question": "what time is in san diego california", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.071vr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.071vr ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ San Diego ] )", "golden_entities": {"m.071vr": "San Diego"}, "answer_entities": {"m.02lcqs": "Pacific Time Zone"}}, {"question": "when did hurricane irene hit ct", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02p70bg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02p70bg ns:meteorology.tropical_cyclone.tropical_cyclone_season ?x .\n}\n", "logical_form": "( JOIN ( R [ meteorology , tropical cyclone , tropical cyclone season ] ) [ Hurricane Irene ] )", "golden_entities": {"m.02p70bg": "Hurricane Irene"}, "answer_entities": {"m.0fq0n_y": "2011 Atlantic hurricane season"}}, {"question": "what is the capital city of assyrian empire", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0wmn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0wmn ns:location.country.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , capital ] ) [ Assyria ] )", "golden_entities": {"m.0wmn": "Assyria"}, "answer_entities": {"m.02wkmf": "Assur", "m.05fym": "Nineveh"}}, {"question": "what disease michael jackson", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n", "logical_form": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ Michael Jackson ] )", "golden_entities": {"m.09889g": "Michael Jackson"}, "answer_entities": {"m.026k8yn": "Mysophobia"}}, {"question": "what is the zip code for cordova tn", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07j5_n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07j5_n ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ Cordova ] )", "golden_entities": {"m.07j5_n": "Cordova"}, "answer_entities": {"m.03dxntr": "38018", "m.07nq_8m": "38088", "m.07nq_c7": "38016"}}, {"question": "what is the origin of the turkish language", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02hwyss)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02hwyss ns:language.human_language.language_family ?x .\n}\n", "logical_form": "( JOIN ( R [ language , human language , language family ] ) [ Turkish Language ] )", "golden_entities": {"m.02hwyss": "Turkish Language"}, "answer_entities": {"m.07d1d": "Turkic languages", "m.0k0w": "Altaic languages"}}, {"question": "what did ron howard direct", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g2lq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g2lq ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.directed_by ns:m.0g2lq .\n}\n", "logical_form": "( AND ( JOIN [ film , film , directed by ] [ Ron Howard ] ) ( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Ron Howard ] ) ) )", "golden_entities": {"m.0g2lq": "Ron Howard"}, "answer_entities": {"m.02mh4b": "Night Shift", "m.02yf34": "Grand Theft Auto", "m.09m6kg": "A Beautiful Mind", "m.0crrc8": "Dr. Seuss' How the Grinch Stole Christmas"}}, {"question": "who are shakespeare 's siblings", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081k8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081k8 ns:people.person.sibling_s ?y .\n?y ns:people.sibling_relationship.sibling ?x .\n}\n", "logical_form": "( JOIN ( R [ people , sibling relationship , sibling ] ) ( JOIN ( R [ people , person , sibling s ] ) [ William Shakespeare ] ) )", "golden_entities": {"m.081k8": "William Shakespeare"}, "answer_entities": {"m.02_56lv": "Margaret Shakespeare", "m.047d343": "Joan Shakespeare", "m.04zwpml": "Edmund Shakespeare", "m.0fq0_1t": "Gilbert Shakespeare", "m.0jvqm_l": "Anne Shakespeare", "m.0jvqnz8": "Richard Shakespeare"}}, {"question": "what team did albert pujols play for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035gcb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035gcb ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Albert Pujols ] ) )", "golden_entities": {"m.035gcb": "Albert Pujols"}, "answer_entities": {"m.04wmvz": "Los Angeles Angels of Anaheim", "m.06x68": "St. Louis Cardinals", "m.0f3wm2": "Scottsdale Scorpions"}}, {"question": "what inspired monet", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xnj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xnj ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Claude Monet ] )", "golden_entities": {"m.01xnj": "Claude Monet"}, "answer_entities": {"m.016s03": "Eug\u00e8ne Delacroix", "m.01dqt1": "Gustave Courbet", "m.0233w": "Camille Pissarro", "m.03fw00": "Eug\u00e8ne Boudin", "m.06466": "Pierre-Auguste Renoir", "m.074ck": "St\u00e9phane Mallarm\u00e9", "m.0kzxl": "Charles-Fran\u00e7ois Daubigny"}}, {"question": "what are fun things to do in seattle wa", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d9jr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d9jr ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Seattle ] )", "golden_entities": {"m.0d9jr": "Seattle"}, "answer_entities": {"m.01k7v7": "Space Needle", "m.01r0v3": "Smith Tower", "m.02dxmq": "Woodland Park Zoo", "m.02k953": "Pike Place Market", "m.02kl80": "Museum of Flight", "m.02ks_p": "Pacific Science Center", "m.02rp3lq": "Georgetown Steam Plant", "m.02xg6w": "Seattle Aquarium", "m.03325p": "Seattle Asian Art Museum", "m.0332cl": "Frye Art Museum", "m.0332j6": "Seattle Art Museum", "m.035pqt": "Henry Art Gallery", "m.03t00j": "Nordic Heritage Museum", "m.04n53vb": "Tillicum Village", "m.0k2k2n2": "Seattle Great Wheel", "m.0prqs": "Seattle International Film Festival", "m.0pxmn": "Experience Music Project Museum", "m.0y657tp": "Garden of Remembrance"}}, {"question": "where does the oklahoma city thunder practice", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04cxw5b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04cxw5b ns:sports.sports_team.arena_stadium ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Oklahoma City Thunder ] )", "golden_entities": {"m.04cxw5b": "Oklahoma City Thunder"}, "answer_entities": {"m.05p8g6": "Chesapeake Energy Arena"}}, {"question": "who was theodore roosevelt 's vice president", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07hyk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07hyk ns:government.us_president.vice_president ?x .\n}\n", "logical_form": "( JOIN ( R [ government , us president , vice president ] ) [ Theodore Roosevelt ] )", "golden_entities": {"m.07hyk": "Theodore Roosevelt"}, "answer_entities": {"m.0myr7": "Charles W. Fairbanks"}}, {"question": "what nationality is jermaine paul", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02rxpxn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02rxpxn ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Jermaine Paul ] )", "golden_entities": {"m.02rxpxn": "Jermaine Paul"}, "answer_entities": {"m.09c7w0": "United States of America"}}, {"question": "who were mary shelley 's parents", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_by)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_by ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ Mary Shelley ] )", "golden_entities": {"m.04_by": "Mary Shelley"}, "answer_entities": {"m.011zsy": "William Godwin", "m.04_cw": "Mary Wollstonecraft"}}, {"question": "what is the capital city of south carolina", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06yxd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06yxd ns:base.aareas.schema.administrative_area.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , capital ] ) [ South Carolina ] )", "golden_entities": {"m.06yxd": "South Carolina"}, "answer_entities": {"m.0fv_t": "Columbia"}}, {"question": "what are some of the awards taylor swift has won", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dl567)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dl567 ns:award.award_winner.awards_won ?y .\n?y ns:award.award_honor.award ?x .\n}\n", "logical_form": "( JOIN ( R [ award , award honor , award ] ) ( JOIN ( R [ award , award winner , awards won ] ) [ Taylor Swift ] ) )", "golden_entities": {"m.0dl567": "Taylor Swift"}, "answer_entities": {"m.0_vmfsz": "Radio Disney Music Award for Best Musical Collaboration", "m.011lffxx": "Teen Choice Award for Choice Music - Country Song", "m.01by1l": "Grammy Award for Album of the Year", "m.01c9f2": "Grammy Award for Best Country Album", "m.01dk00": "Grammy Award for Best Country Song", "m.025m8l": "Grammy Award for Best Song Written for Visual Media", "m.026m9w": "Grammy Award for Best Female Country Vocal Performance", "m.02f6ym": "MTV Video Music Award for Best Female Video", "m.04dxjjz": "Billboard Music Award for Top Billboard 200 Artist", "m.04dy0sf": "People's Choice Award for Favorite Female Artist", "m.04fnq6m": "Country Music Association Horizon Award", "m.04fnq79": "Country Music Association Award for Female Vocalist of the Year", "m.05kfv8x": "Academy of Country Music Award for Album of the Year", "m.05kfvnc": "Academy of Country Music Award for Entertainer of the Year", "m.05kfvsx": "Academy of Country Music Award for New Female Vocalist of the Year", "m.07_506c": "MTV Europe Music Award for Best Female", "m.07_52dv": "MTV Europe Music Award for Best Live Act", "m.08clnvk": "Academy of Country Music Award for Video of the Year", "m.09qd02_": "Billboard Music Award for Top Artist", "m.0cjw69": "American Music Award for Favorite Pop/Rock Female Artist", "m.0ckh35": "American Music Award for Favorite Country Female Artist", "m.0ckh7c": "American Music Award for Favorite Adult Contemporary Artist", "m.0f4w04": "American Music Award for Favorite Country Album", "m.0gj6x00": "Teen Choice Award for Choice Movie Breakout Star - Female", "m.0gky9c6": "Grammy Award for Best Country Solo Performance", "m.0hj9kq4": "People's Choice Award for Favorite Country Artist", "m.0j8y__n": "Billboard Music Award for Top Country Artist", "m.0j8ythh": "Billboard Music Award for Top Female Artist", "m.0j8yxq6": "Billboard Music Award for Top Digital Songs Artist", "m.0j8z2r3": "Billboard Music Award for Top Billboard 200 Album", "m.0j8zcw2": "Billboard Music Award for Top Country Album", "m.0j912gy": "Billboard Music Award for Top Country Song", "m.0k0811w": "Country Music Association Award for Album of the Year", "m.0k081n1": "Country Music Association Award for Musical Event of the Year", "m.0k081qv": "Country Music Association Award for Music Video of the Year", "m.0n57zzs": "American Music Award for Artist of the Year", "m.0n9z4f7": "Country Music Association Award for Entertainer of the Year", "m.0nh4rr_": "Kids' Choice Award for Favorite Female Singer", "m.0sgkrty": "Kids' Choice Award for Favorite Song", "m.0sgkvz4": "Kids\u2019 Choice Big Help Award", "m.0whp1hc": "Teen Choice Award for Choice Music - Female Country Artist", "m.0whp2_z": "Teen Choice Award for Choice Music - Female Artist", "m.0whp5hq": "Teen Choice Award for Choice Break-Up Song", "m.0whp9zh": "Teen Choice Award for Choice Single: Female Artist", "m.0wzyn4z": "MTV Europe Music Award for Best Look", "m.0y4ppv1": "Radio Disney Music Award for Best Breakup Song", "m.0y4r26d": "Radio Disney Music Award for Song of the Year", "m.0y554rz": "Young Hollywood Award for Superstar of Tomorrow", "m.0y87xxx": "YouTube Music Awards YouTube Phenomenon", "m.0yqdf3d": "Glamour Award for International Solo Artist", "m.0yszmsf": "Teen Choice Award for Choice Movie: Voice", "m.0yszn3z": "Teen Choice Special Award\u00a0\u2014 Ultimate Choice Award", "m.0yt47m8": "Teen Choice Award for Choice Red Carpet Fashion Icon Female", "m.0yt7tc6": "Teen Choice Award for Choice Music: Breakout Artist", "m.0ytbnfc": "Teen Choice Award for Choice Music: Album Country", "m.0yvqhv_": "Country Music Association Pinnacle Award", "m.0zmx3ly": "Billboard Music Award for Woman of the Year"}}, {"question": "where did chris cuomo go", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pjpd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pjpd ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Andrew Cuomo ] ) )", "golden_entities": {"m.02pjpd": "Andrew Cuomo"}, "answer_entities": {"m.027kp3": "Fordham University", "m.037sbn": "Archbishop Molloy High School", "m.08qs09": "Albany Law School"}}, {"question": "where did gary coleman live when he died", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.036pg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.036pg ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Gary Coleman ] )", "golden_entities": {"m.036pg": "Gary Coleman"}, "answer_entities": {"m.0l39b": "Provo"}}, {"question": "where was ronald reagan born and raised", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c0j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c0j ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Ronald Reagan ] )", "golden_entities": {"m.06c0j": "Ronald Reagan"}, "answer_entities": {"m.0sj7b": "Tampico"}}]