[{"question": "who nominated stephen g. breyer", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016m0v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016m0v ns:people.appointee.position ?y .\n?y ns:people.appointment.appointed_by ?x .\n}\n", "logical_form": "( JOIN ( R [ people , appointment , appointed by ] ) ( JOIN ( R [ people , appointee , position ] ) [ Stephen Breyer ] ) )", "golden_entities": {"m.016m0v": "Stephen Breyer"}, "answer_entities": {"m.0157m": "Bill Clinton"}}, {"question": "what did robin gibb died from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0137hn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0137hn ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Robin Gibb ] )", "golden_entities": {"m.0137hn": "Robin Gibb"}, "answer_entities": {"m.01dcqj": "Colorectal cancer", "m.03m3vr6": "Liver cancer", "m.0dq9p": "Pneumonia"}}, {"question": "what were adolf hitler 's parents names", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m9_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m9_ ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ Adolf Hitler ] )", "golden_entities": {"m.07_m9_": "Adolf Hitler"}, "answer_entities": {"m.02p0d7": "Alois Hitler", "m.0321wy": "Klara Hitler"}}, {"question": "what job does bill rancic have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02skv6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02skv6 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Bill Rancic ] )", "golden_entities": {"m.02skv6": "Bill Rancic"}, "answer_entities": {"m.012t_z": "Businessperson", "m.02hrh1q": "Actor", "m.03gjzk": "Television producer", "m.09x_r": "Entrepreneur", "m.0cbd2": "Writer", "m.0kyk": "Author"}}, {"question": "what does michael jackson like to eat", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:food.diet_follower.follows_diet ?x .\n}\n", "logical_form": "( JOIN ( R [ food , diet follower , follows diet ] ) [ Michael Jackson ] )", "golden_entities": {"m.09889g": "Michael Jackson"}, "answer_entities": {"m.07_lq": "Vegetarian food"}}, {"question": "who owns the new england patriots football team", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g3b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g3b ns:sports.professional_sports_team.owner_s ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , professional sports team , owner s ] ) [ New England Patriots ] )", "golden_entities": {"m.05g3b": "New England Patriots"}, "answer_entities": {"m.050kkl": "Robert Kraft"}}, {"question": "what airport fly into for maui", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jbs5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jbs5 ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01xpjyz .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Airport ] ) ( JOIN ( R [ location , location , contains ] ) [ Maui ] ) )", "golden_entities": {"m.0jbs5": "Maui", "m.01xpjyz": "Airport"}, "answer_entities": {"m.01r3l2": "Kahului Airport", "m.0398qm": "Hana Airport", "m.0398r9": "Kapalua Airport"}}, {"question": "what has lucy hale played in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0754d6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0754d6 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Lucy Hale ] ) )", "golden_entities": {"m.0754d6": "Lucy Hale"}, "answer_entities": {"m.02qrr8j": "The Sisterhood of the Traveling Pants 2", "m.05pbjnr": "Fear Island", "m.0b6q30j": "Sorority Wars", "m.0bq4q22": "Killer in the Family", "m.0bwhdbl": "Scream 4", "m.0crfwmx": "Tinker Bell: Secret of the Wings", "m.0gky0pl": "A Cinderella Story: Once Upon a Song"}}, {"question": "who is the coach of the la lakers", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jmk7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jmk7 ns:basketball.basketball_team.head_coach ?x .\n}\n", "logical_form": "( JOIN ( R [ basketball , basketball team , head coach ] ) [ Los Angeles Lakers ] )", "golden_entities": {"m.0jmk7": "Los Angeles Lakers"}, "answer_entities": {"m.05jdzr": "Byron Scott"}}, {"question": "what is the dominican republic 's capital", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027rn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027rn ns:location.country.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , capital ] ) [ Dominican Republic ] )", "golden_entities": {"m.027rn": "Dominican Republic"}, "answer_entities": {"m.0fthl": "Santo Domingo"}}, {"question": "what is the san francisco giants mascot", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0713r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0713r ns:sports.sports_team.team_mascot ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , team mascot ] ) [ San Francisco Giants ] )", "golden_entities": {"m.0713r": "San Francisco Giants"}, "answer_entities": {"m.02q_hzh": "Crazy Crab", "m.03_dwn": "Lou Seal"}}, {"question": "where did the arizona diamondbacks play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0x0d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0x0d ns:sports.sports_team.arena_stadium ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Arizona Diamondbacks ] )", "golden_entities": {"m.0x0d": "Arizona Diamondbacks"}, "answer_entities": {"m.01k879": "Chase Field"}}, {"question": "what did fred davis do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02rhm_l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02rhm_l ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Fred Davis ] )", "golden_entities": {"m.02rhm_l": "Fred Davis"}, "answer_entities": {"m.02h665k": "American football player"}}, {"question": "what country was theodor schwann born in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.040000)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.040000 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Theodor Schwann ] )", "golden_entities": {"m.040000": "Theodor Schwann"}, "answer_entities": {"m.025697": "Neuss"}}, {"question": "where is the fukushima daiichi located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vkzy2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vkzy2 ns:location.location.street_address ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ location , location , street address ] ) [ Fukushima Daiichi Nuclear Power Plant ] ) )", "golden_entities": {"m.02vkzy2": "Fukushima Daiichi Nuclear Power Plant"}, "answer_entities": {"m.0gqkx": "Fukushima"}}, {"question": "what country was bin laden from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05mg9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05mg9 ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Osama bin Laden ] )", "golden_entities": {"m.05mg9": "Osama bin Laden"}, "answer_entities": {"m.01z215": "Saudi Arabia"}}, {"question": "where did darfur happen", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d07gg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d07gg ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ War in Darfur ] )", "golden_entities": {"m.0d07gg": "War in Darfur"}, "answer_entities": {"m.02vtml": "Darfur"}}, {"question": "what movies has taylor momsen been in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.067qp2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.067qp2 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Taylor Momsen ] ) )", "golden_entities": {"m.067qp2": "Taylor Momsen"}, "answer_entities": {"m.025skpr": "Spy Kids 2: The Island of Lost Dreams", "m.0278x5r": "Saving Shiloh", "m.02r8_g6": "Paranoid Park", "m.03z106": "We Were Soldiers", "m.06zqt3x": "Spy School", "m.0c0krr": "Hansel and Gretel", "m.0crrc8": "Dr. Seuss' How the Grinch Stole Christmas", "m.0dgt4t": "Underdog", "m.0gkrt_f": "Prophet's Game"}}, {"question": "what was henry ford best known for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gxm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gxm ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Henry Ford ] )", "golden_entities": {"m.03gxm": "Henry Ford"}, "answer_entities": {"m.012t_z": "Businessperson", "m.025spv": "Business magnate", "m.02h6nc9": "Industrialist", "m.03sbb": "Inventor", "m.09j9h": "Engineer", "m.09x_r": "Entrepreneur"}}, {"question": "what education does jeff corwin have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03xsv3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03xsv3 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jeff Corwin ] ) )", "golden_entities": {"m.03xsv3": "Jeff Corwin"}, "answer_entities": {"m.01ky7c": "University of Massachusetts Amherst", "m.02r7zpz": "Norwell High School", "m.035p0k": "Bridgewater State University"}}, {"question": "what movies has chris colfer been in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07k51gd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07k51gd ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Chris Colfer ] ) )", "golden_entities": {"m.07k51gd": "Chris Colfer"}, "answer_entities": {"m.09g6jrt": "Russel Fish: The Sausage and Eggs Incident", "m.0gyj2ls": "Struck by Lightning", "m.0h1fktn": "Glee: The 3D Concert Movie", "m.0h4y8jg": "Glee Encore", "m.0ngl265": "8"}}, {"question": "where the queen of denmark lives", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g2kv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g2kv ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Margrethe II of Denmark ] ) )", "golden_entities": {"m.0g2kv": "Margrethe II of Denmark"}, "answer_entities": {"m.01lfy": "Copenhagen"}}, {"question": "who was the real erin brockovich", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02nxk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02nxk ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Erin Brockovich ] )", "golden_entities": {"m.02nxk": "Erin Brockovich"}, "answer_entities": {"m.012t_z": "Businessperson", "m.015cjr": "Presenter", "m.01jbr2": "Paralegal", "m.02hrh1q": "Actor", "m.02n9jv": "Consultant", "m.07s467s": "Environmentalist"}}, {"question": "what county is troy il in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0sch1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0sch1 ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Troy ] )", "golden_entities": {"m.0sch1": "Troy"}, "answer_entities": {"m.0nv99": "Madison County"}}, {"question": "where does the appalachian trail run through", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lyj0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lyj0 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Appalachian National Scenic Trail ] )", "golden_entities": {"m.0lyj0": "Appalachian National Scenic Trail"}, "answer_entities": {"m.02jwvm": "Eastern United States", "m.03rkq_": "International Appalachian Trail", "m.0lm0n": "Appalachian Mountains"}}, {"question": "what color are the baltimore ravens", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ct6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ct6 ns:sports.sports_team.colors ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , colors ] ) [ Baltimore Ravens ] )", "golden_entities": {"m.01ct6": "Baltimore Ravens"}, "answer_entities": {"m.019sc": "Black", "m.01l849": "Gold", "m.083jv": "White", "m.09ggk": "Purple"}}, {"question": "what is tim tebow 's religion", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g7km1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g7km1 ns:people.person.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , religion ] ) [ Tim Tebow ] )", "golden_entities": {"m.0g7km1": "Tim Tebow"}, "answer_entities": {"m.01lp8": "Christianity"}}, {"question": "what does anderson cooper do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02z14n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02z14n ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Anderson Cooper ] )", "golden_entities": {"m.02z14n": "Anderson Cooper"}, "answer_entities": {"m.015cjr": "Presenter", "m.01d_h8": "Film Producer", "m.03gjzk": "Television producer", "m.0d1pc": "Model", "m.0d8qb": "Journalist", "m.0kyk": "Author"}}, {"question": "what movies did matt bomer play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03pmk3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03pmk3 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Matt Bomer ] ) )", "golden_entities": {"m.03pmk3": "Matt Bomer"}, "answer_entities": {"g.11b7k3tft3": "The Magnificent Seven", "m.01262msv": "The Nice Guys", "m.06dq4r": "Flightplan", "m.090fjm": "The Texas Chainsaw Massacre: The Beginning", "m.0dr_xmk": "In Time", "m.0h63gl9": "Magic Mike", "m.0hyn2x8": "The Normal Heart", "m.0nffcbb": "Winter's Tale", "m.0ngl265": "8", "m.0r8phd0": "Superman: Unbound", "m.0tlt31w": "Space Station 76", "m.0y4jvvn": "Magic Mike XXL", "m.0yt16nd": "B.O.O.: Bureau of Otherworldly Operations"}}, {"question": "who is ellen bernstein", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019f2f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019f2f ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Ellen Burstyn ] )", "golden_entities": {"m.019f2f": "Ellen Burstyn"}, "answer_entities": {"m.02hrh1q": "Actor", "m.0377kt": "Minister", "m.0d1pc": "Model", "m.0np9r": "Voice Actor"}}, {"question": "when was reagan inaugurated", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c0j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c0j ns:base.inaugurations.inauguration_speaker.inauguration ?x .\n}\n", "logical_form": "( JOIN ( R [ base , inaugurations , inauguration speaker , inauguration ] ) [ Ronald Reagan ] )", "golden_entities": {"m.06c0j": "Ronald Reagan"}, "answer_entities": {"m.05bry73": "Ronald Reagan 1981 presidential inauguration", "m.05bryb8": "Ronald Reagan 1985 presidential inauguration"}}, {"question": "what did james k polk believe in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042f1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042f1 ns:people.person.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , religion ] ) [ James K. Polk ] )", "golden_entities": {"m.042f1": "James K. Polk"}, "answer_entities": {"m.051kv": "Methodism", "m.0631_": "Presbyterianism"}}, {"question": "what currency does south africa have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hzlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hzlz ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ South Africa ] )", "golden_entities": {"m.0hzlz": "South Africa"}, "answer_entities": {"m.01rmbs": "South African rand"}}, {"question": "where did jerome david salinger died", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.041_y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.041_y ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ J. D. Salinger ] )", "golden_entities": {"m.041_y": "J. D. Salinger"}, "answer_entities": {"m.0xk73": "Cornish"}}, {"question": "what airport is closest to cancun", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01q98m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01q98m ns:location.location.nearby_airports ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , nearby airports ] ) [ Canc\u00fan ] )", "golden_entities": {"m.01q98m": "Canc\u00fan"}, "answer_entities": {"m.05fkzs": "Canc\u00fan International Airport"}}, {"question": "where is somalia located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06tgw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06tgw ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Somalia ] )", "golden_entities": {"m.06tgw": "Somalia"}, "answer_entities": {"m.0dg3n1": "Africa"}}, {"question": "who is the head coach of the chicago blackhawks", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jnlm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jnlm ns:ice_hockey.hockey_team.coach ?x .\n}\n", "logical_form": "( JOIN ( R [ ice hockey , hockey team , coach ] ) [ Chicago Blackhawks ] )", "golden_entities": {"m.0jnlm": "Chicago Blackhawks"}, "answer_entities": {"m.03clfy": "Joel Quenneville"}}, {"question": "where was john f kennedy raised", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ John F. Kennedy ] )", "golden_entities": {"m.0d3k14": "John F. Kennedy"}, "answer_entities": {"m.0p9z5": "Brookline"}}, {"question": "what does kat dennings star in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b0kzw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b0kzw ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Kat Dennings ] ) )", "golden_entities": {"m.0b0kzw": "Kat Dennings"}, "answer_entities": {"m.0125h18g": "Suburban Gothic", "m.02vq583": "Charlie Bartlett", "m.03cyslc": "Nick & Norah's Infinite Playlist", "m.0408m53": "The House Bunny", "m.04cv8_z": "The Answer Man", "m.04gz04": "Raise Your Voice", "m.05my82g": "Wanderlust", "m.05qpqj6": "Shorts", "m.05ztyqq": "Defendor", "m.062zjtt": "Thor", "m.06fpsx": "The 40-Year-Old Virgin", "m.0811_b": "Big Momma's House 2", "m.0bk6nc": "London", "m.0crx4f4": "Daydream Nation", "m.0d1tgy": "Down in the Valley", "m.0frpxh": "The Scream Team", "m.0gxw7g1": "Lives of the Saints", "m.0h_cvyh": "To Write Love on Her Arms", "m.0j9knfv": "Thor: The Dark World"}}, {"question": "where does volga river start", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h2hw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h2hw ns:geography.river.origin ?x .\n}\n", "logical_form": "( JOIN ( R [ geography , river , origin ] ) [ Volga River ] )", "golden_entities": {"m.0h2hw": "Volga River"}, "answer_entities": {"m.05ktg3": "Valdai Hills"}}, {"question": "what are the major sports played in venezuela", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ylj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ylj ns:sports.sports_team_location.teams ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team location , teams ] ) [ Venezuela ] )", "golden_entities": {"m.07ylj": "Venezuela"}, "answer_entities": {"m.03mf9_m": "Venezuela women's national volleyball team", "m.03w9ng1": "Venezuela men's national volleyball team", "m.03zkr8": "Venezuela national football team", "m.0kn5hg6": "Cocodrilos de Caracas"}}, {"question": "what did roger sherman do for a living", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mp_3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mp_3 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Roger Sherman ] )", "golden_entities": {"m.01mp_3": "Roger Sherman"}, "answer_entities": {"m.04gc2": "Lawyer", "m.0fj9f": "Politician"}}, {"question": "where does eddie bravo teach", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08rm_x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08rm_x ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Eddie Bravo ] ) )", "golden_entities": {"m.08rm_x": "Eddie Bravo"}, "answer_entities": {"m.0jbrr": "Santa Ana"}}, {"question": "where does sally pearson live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0287hgn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0287hgn ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Sally Pearson ] ) )", "golden_entities": {"m.0287hgn": "Sally Pearson"}, "answer_entities": {"m.0g4g7": "Gold Coast"}}, {"question": "where is madeira", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_z1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_z1 ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , administrative parent ] ) [ Madeira ] )", "golden_entities": {"m.04_z1": "Madeira"}, "answer_entities": {"m.05r4w": "Portugal"}}, {"question": "what country is joseph prince from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02rjg1g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02rjg1g ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Joseph Prince ] )", "golden_entities": {"m.02rjg1g": "Joseph Prince"}, "answer_entities": {"m.06t2t": "Singapore"}}, {"question": "where is the sistine chapel by michelangelo", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kbls)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kbls ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , containedby ] ) [ Sistine Chapel ] ) )", "golden_entities": {"m.0kbls": "Sistine Chapel", "m.01mp": "Country"}, "answer_entities": {"m.07ytt": "Vatican City"}}, {"question": "where is christina aguilera from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0127s7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0127s7 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Christina Aguilera ] )", "golden_entities": {"m.0127s7": "Christina Aguilera"}, "answer_entities": {"m.0y62n": "Staten Island"}}, {"question": "what are fun things to do in philadelphia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dclg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dclg ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Philadelphia ] )", "golden_entities": {"m.0dclg": "Philadelphia"}, "answer_entities": {"m.01_yh5": "Independence Hall", "m.012h3h": "Liberty Bell", "m.01h123": "Franklin Institute", "m.0246rh": "Philadelphia Museum of Art", "m.0294_l": "Eastern State Penitentiary", "m.02dqlt": "Philadelphia Zoo", "m.02v_wpr": "Grumblethorpe", "m.02vz87s": "Stenton", "m.02xktz": "Academy of Natural Sciences of Drexel University", "m.03bx8tr": "Germantown White House", "m.03ckb2r": "Cliveden", "m.03cvd3n": "Woodford", "m.04x8mj": "Pennsylvania Academy of the Fine Arts", "m.05ycst": "Barnes Foundation", "m.06_1bm": "Philadelphia Marathon", "m.06lbq9": "Reading Terminal Market", "m.06z_sp5": "Boat House Row", "m.077pcr": "Wagner Free Institute of Science", "m.09qvxj": "African American Museum in Philadelphia", "m.0bhbkg": "Rodin Museum", "m.0bhbq9": "Camelbeach Waterpark", "m.0dl_db": "Rocky Steps", "m.0fsw4_": "Franklin Square", "m.0h_9pvw": "Pizza Brain", "m.0h7pp7c": "Rock 'n' Roll Philadelphia Half Marathon", "m.0jk_ntj": "Horse Park of New Jersey", "m.0k149_w": "National Constitution Center Museum"}}, {"question": "where did jackie robinson go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0443c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0443c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jackie Robinson ] ) )", "golden_entities": {"m.0443c": "Jackie Robinson"}, "answer_entities": {"m.02gn8s": "Pasadena City College", "m.0769_zc": "Washington Middle School", "m.084wvj": "John Muir High School", "m.09f2j": "University of California, Los Angeles"}}, {"question": "where was f scott fitzgerald education", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02zjd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02zjd ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ F. Scott Fitzgerald ] ) )", "golden_entities": {"m.02zjd": "F. Scott Fitzgerald"}, "answer_entities": {"m.023pj6": "St. Paul Academy and Summit School", "m.05zl0": "Princeton University", "m.0fh_my": "Nardin Academy"}}, {"question": "where to go in phnom penh cambodia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dlwj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dlwj ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Phnom Penh ] )", "golden_entities": {"m.0dlwj": "Phnom Penh"}, "answer_entities": {"m.026462": "Tuol Sleng Genocide Museum", "m.02pjmts": "Wat Phnom", "m.085f_0": "Royal Palace, Phnom Penh", "m.0b74mvg": "Kingdom Breweries", "m.0cbw_y": "Silver Pagoda, Phnom Penh", "m.0cbws_": "National Museum of Cambodia", "m.0cbww1": "Independence Monument", "m.0cbxfv": "Cambodia\u2013Vietnam Friendship Monument", "m.0gx_53z": "Sisowath Quay", "m.0lkvv": "Choeung Ek"}}, {"question": "what city was ronald reagan born in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c0j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c0j ns:people.person.place_of_birth ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ people , person , place of birth ] ) [ Ronald Reagan ] ) )", "golden_entities": {"m.06c0j": "Ronald Reagan", "m.01m9": "City/Town/Village"}, "answer_entities": {"m.0sj7b": "Tampico"}}]