[{"question": "what magazine did edgar allan poe work for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lt8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lt8 ns:book.periodical_editor.periodicals_edited ?y .\n?y ns:book.editorial_tenure.periodical ?x .\n}\n", "logical_form": "( JOIN ( R [ book , editorial tenure , periodical ] ) ( JOIN ( R [ book , periodical editor , periodicals edited ] ) [ Edgar Allan Poe ] ) )", "golden_entities": {"m.02lt8": "Edgar Allan Poe"}, "answer_entities": {"m.0282h9k": "Graham's Magazine", "m.0285kdq": "Broadway Journal", "m.028b1d9": "Burton's Gentleman's Magazine"}}, {"question": "where did chickasaw indians live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0n0y5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0n0y5 ns:people.ethnicity.geographic_distribution ?x .\n}\n", "logical_form": "( JOIN ( R [ people , ethnicity , geographic distribution ] ) [ Chickasaw ] )", "golden_entities": {"m.0n0y5": "Chickasaw"}, "answer_entities": {"m.05mph": "Oklahoma"}}, {"question": "what is the timezone in vancouver", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ckhc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ckhc ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Vancouver ] )", "golden_entities": {"m.0ckhc": "Vancouver"}, "answer_entities": {"m.02lcqs": "Pacific Time Zone"}}, {"question": "what time is world cup soccer", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.030q7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.030q7 ns:user.gogza.default_domain.recurring_event.recurrance_period ?x .\n}\n", "logical_form": "( JOIN ( R [ user , gogza , default domain , recurring event , recurrance period ] ) [ FIFA World Cup ] )", "golden_entities": {"m.030q7": "FIFA World Cup"}, "answer_entities": {"m.02sjt6q": "Every 4 Years"}}, {"question": "what county is stockton ca located in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pc56)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pc56 ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Stockton ] )", "golden_entities": {"m.0pc56": "Stockton"}, "answer_entities": {"m.0l2sr": "San Joaquin County"}}, {"question": "what did ronnie radke do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ql6bk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ql6bk ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Ronnie Radke ] )", "golden_entities": {"m.02ql6bk": "Ronnie Radke"}, "answer_entities": {"m.016z4k": "Singer-songwriter", "m.09jwl": "Musician", "m.0hpcdn2": "Rapper"}}, {"question": "what form of government does czech republic have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mjq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mjq ns:location.country.form_of_government ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , form of government ] ) [ Czech Republic ] )", "golden_entities": {"m.01mjq": "Czech Republic"}, "answer_entities": {"m.0glnsx": "Parliamentary republic"}}, {"question": "what was eli whitney education", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ncr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ncr ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Eli Whitney ] ) )", "golden_entities": {"m.02ncr": "Eli Whitney"}, "answer_entities": {"m.01fpvz": "Yale College", "m.05zxrds": "Leicester Academy"}}, {"question": "what movies has renee zellweger been in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01c_zw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01c_zw ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Ren\u00e9e Zellweger ] ) )", "golden_entities": {"m.01c_zw": "Ren\u00e9e Zellweger"}, "answer_entities": {"g.11b6dw34dy": "Same Kind of Different as Me", "m.0114j189": "The Whole Truth", "m.011ykb": "Jerry Maguire", "m.01cmp9": "Chicago", "m.01xbxn": "Shark Tale", "m.01z7v5": "Reality Bites", "m.027nr4g": "Case 39", "m.0288083": "Leatherheads", "m.02cbhg": "Cold Mountain", "m.02j69w": "Dazed and Confused", "m.02qqs_k": "Monsters vs. Aliens", "m.03_njz": "Down with Love", "m.036qtd": "Nurse Betty", "m.03cp2z2": "Deceiver", "m.03hl_76": "A Price Above Rubies", "m.03m71s1": "Appaloosa", "m.03nnsy": "Empire Records", "m.040044": "My Boyfriend's Back", "m.04b7hj": "Me, Myself & Irene", "m.04c11j": "Bridget Jones: The Edge of Reason", "m.04f46k7": "My One and Only", "m.04jw07": "One True Thing", "m.04ycv_f": "The Low Life", "m.050gkf": "Cinderella Man", "m.057hp_": "The Whole Wide World", "m.05cbyms": "New In Town", "m.05mq_gq": "My Own Love Song", "m.05vxdh": "Bridget Jones's Diary", "m.06039f": "White Oleander", "m.080bbt": "Texas Chainsaw Massacre: The Next Generation", "m.087m22": "Bee Movie", "m.09z8d1": "The Bachelor", "m.0b3_lr": "Shake, Rattle and Rock!", "m.0b921t": "Miss Potter", "m.0bb20p": "Murder in the Heartland", "m.0cdnx1": "8 Seconds", "m.0dy2m2": "Love and a .45", "m.0nfvs0m": "A Taste for Killing"}}, {"question": "what other writers influenced charles dickens", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01v9724)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01v9724 ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Charles Dickens ] )", "golden_entities": {"m.01v9724": "Charles Dickens"}, "answer_entities": {"m.01gr2w": "Tobias Smollett", "m.01vh096": "Victor Hugo", "m.03j7p": "Henry Fielding", "m.04kpk": "Laurence Sterne", "m.04xjp": "Miguel de Cervantes", "m.06y8v": "Walter Scott", "m.072dv": "Sheridan Le Fanu", "m.081k8": "William Shakespeare", "m.084y3": "Washington Irving", "m.085wn": "William Wordsworth", "m.0bmjw": "Honor\u00e9 de Balzac"}}, {"question": "where jay z was raised", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vw20h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vw20h ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Jay-Z ] )", "golden_entities": {"m.01vw20h": "Jay-Z"}, "answer_entities": {"m.0cr3d": "Brooklyn"}}, {"question": "what language do iraqi people speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d05q4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d05q4 ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Iraq ] )", "golden_entities": {"m.0d05q4": "Iraq"}, "answer_entities": {"m.01m3f7": "Turkmen Language", "m.032f6": "Persian Language", "m.03y86gf": "South Azeri language", "m.04w042": "Assyrian Neo-Aramaic Language", "m.0b1g2": "Kurdish languages", "m.0g5tm": "Syriac language", "m.0jzc": "Arabic Language", "m.0xrg": "Armenian Language"}}, {"question": "what was abe lincoln shot with", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:user.alexander.misc.murdered_person.murder_method ?x .\n}\n", "logical_form": "( JOIN ( R [ user , alexander , misc , murdered person , murder method ] ) [ Abraham Lincoln ] )", "golden_entities": {"m.0gzh": "Abraham Lincoln"}, "answer_entities": {"m.034qg": "Firearm"}}, {"question": "what did regina hall play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.072z_t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.072z_t ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Regina Hall ] ) )", "golden_entities": {"m.072z_t": "Regina Hall"}, "answer_entities": {"g.11b6yz_c00": "", "m.012w4c6m": "When the Bough Breaks", "m.0131l157": "With This Ring", "m.01370796": "Barbershop 3", "m.01pj_5": "Scary Movie", "m.02mc5v": "Scary Movie 2", "m.02q_76b": "First Sunday", "m.03l6q0": "Scary Movie 3", "m.05h4_qt": "Law Abiding Citizen", "m.05szbg": "The Honeymooners", "m.05wsc1": "King's Ransom", "m.06f18v": "Malibu's Most Wanted", "m.07h9gp": "Scary Movie 4", "m.07nt4j": "Last Holiday", "m.07yjndt": "Death at a Funeral", "m.08487v": "Love & Basketball", "m.088s3s": "The Best Man", "m.08wy_6": "Disappearing Acts", "m.0b2f_2": "Superhero Movie", "m.0c9pvq": "Paid in Full", "m.0cc7ysm": "The Elder Son", "m.0crt711": "The Other Brother", "m.0dmh6y": "Danika", "m.0gwf191": "Think Like A Man", "m.0gz6__n": "Six Months Later", "m.0h944f1": "Mardi Gras: Spring Break", "m.0mzxvjs": "The Best Man Holiday", "m.0t_dn7n": "About Last Night", "m.0w1df97": "Think Like a Man Too"}}, {"question": "what book did jacob riis wrote", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jll4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jll4 ns:book.author.works_written ?x .\n}\n", "logical_form": "( JOIN ( R [ book , author , works written ] ) [ Jacob Riis ] )", "golden_entities": {"m.0jll4": "Jacob Riis"}, "answer_entities": {"m.0bqr25v": "How the Other Half Lives"}}, {"question": "what airport is close to scottsdale arizona", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0qpqn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0qpqn ns:location.location.nearby_airports ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , nearby airports ] ) [ Scottsdale ] )", "golden_entities": {"m.0qpqn": "Scottsdale"}, "answer_entities": {"m.054v10": "Scottsdale Airport"}}, {"question": "who plays noah bennet", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.026cx1z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.026cx1z ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Noah Bennet ] ) )", "golden_entities": {"m.026cx1z": "Noah Bennet"}, "answer_entities": {"m.0bf_xc": "Jack Coleman"}}, {"question": "who won american idol 2006 season 5", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09zcyj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09zcyj ns:award.competition.winner ?x .\n}\n", "logical_form": "( JOIN ( R [ award , competition , winner ] ) [ American Idol - Season 5 ] )", "golden_entities": {"m.09zcyj": "American Idol - Season 5"}, "answer_entities": {"m.0bhslx": "Taylor Hicks"}}, {"question": "where do the chicago cubs play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01yjl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01yjl ns:sports.sports_team.arena_stadium ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Chicago Cubs ] )", "golden_entities": {"m.01yjl": "Chicago Cubs"}, "answer_entities": {"m.066by2": "Hohokam Stadium", "m.0b0sh": "Wrigley Field", "m.0h975w3": "Sloan Park"}}, {"question": "where did reagan die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c0j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c0j ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Ronald Reagan ] )", "golden_entities": {"m.06c0j": "Ronald Reagan"}, "answer_entities": {"m.026z1h": "Bel-Air"}}, {"question": "what was irving langmuir famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03yzb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03yzb ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Irving Langmuir ] )", "golden_entities": {"m.03yzb": "Irving Langmuir"}, "answer_entities": {"m.06q2q": "Scientist"}}, {"question": "what was the name of martin luther king jr parents", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ Martin Luther King, Jr. ] )", "golden_entities": {"m.051cc": "Martin Luther King, Jr."}, "answer_entities": {"m.04_wtm": "Alberta Williams King", "m.04z9mm": "Martin Luther King, Sr."}}, {"question": "what money does guatemala use", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0345_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0345_ ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Guatemala ] )", "golden_entities": {"m.0345_": "Guatemala"}, "answer_entities": {"m.01crby": "Guatemalan quetzal"}}, {"question": "who was president when nelson rockefeller was vice president", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05jd_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05jd_ ns:government.us_vice_president.to_president ?x .\n}\n", "logical_form": "( JOIN ( R [ government , us vice president , to president ] ) [ Nelson Rockefeller ] )", "golden_entities": {"m.05jd_": "Nelson Rockefeller"}, "answer_entities": {"m.0c_md_": "Gerald Ford"}}, {"question": "where is shakira from originally", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wj18h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wj18h ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Shakira ] )", "golden_entities": {"m.01wj18h": "Shakira"}, "answer_entities": {"m.02b84b": "Barranquilla"}}, {"question": "where was the gettysburg war located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01jnm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01jnm ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ Battle of Gettysburg ] )", "golden_entities": {"m.01jnm": "Battle of Gettysburg"}, "answer_entities": {"m.05tbn": "Pennsylvania", "m.0dzs0": "Gettysburg", "m.0frlr": "Adams County"}}, {"question": "what do people go to amsterdam for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k3p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k3p ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Amsterdam ] )", "golden_entities": {"m.0k3p": "Amsterdam"}, "answer_entities": {"m.01l09n": "Efteling", "m.027x7w2": "Allard Pierson Museum", "m.02k1t8": "West Frisian Islands", "m.02qb667": "Diamond Museum Amsterdam", "m.02s5hd": "Anne Frank House", "m.04q1_nn": "Begijnhof Chapel, Amsterdam", "m.05_9vk": "Rembrandt House Museum", "m.052sj2j": "De Gooyer Windmill", "m.052sj30": "Molen van Sloten Windmill", "m.052sj3l": "Sexmuseum", "m.06_fvr": "Jordaan", "m.06jsf": "Rijksmuseum", "m.06s5rp": "Begijnhof, Amsterdam", "m.06w7d4n": "Hash, Marihuana & Hemp Museum", "m.0730kf": "Het Schip", "m.080q85l": "Foam Fotografiemuseum Amsterdam", "m.0c27s0": "The National Maritime Museum", "m.0ctd_z": "Oude Kerk, Amsterdam", "m.0d222g": "Amsterdam Museum", "m.0dgsr2n": "Amsterdam Dance Event", "m.0j2hz0_": "Van Gogh Museum Rietveld Building", "m.0j2jlz0": "Van Gogh Museum Kurokawa Wing", "m.0p8jv": "Natura Artis Magistra"}}, {"question": "what language chile speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p1v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p1v ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Chile ] )", "golden_entities": {"m.01p1v": "Chile"}, "answer_entities": {"m.01y5tq": "Aymara language", "m.01zn1j": "Mapudungun Language", "m.0565hv": "Rapa Nui Language", "m.06nm1": "Spanish Language", "m.09_sxt": "Puquina Language"}}, {"question": "what team did john madden play football for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0frmb1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0frmb1 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ John Madden ] ) )", "golden_entities": {"m.0frmb1": "John Madden"}, "answer_entities": {"m.05tg3": "Philadelphia Eagles", "m.06ztt6z": "Cal Poly Mustangs football", "m.0fbq2n": "Oregon Ducks football"}}, {"question": "what does julian clary do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_rph)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_rph ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Julian Clary ] )", "golden_entities": {"m.01_rph": "Julian Clary"}, "answer_entities": {"m.015cjr": "Presenter", "m.018gz8": "Comedian", "m.02hrh1q": "Actor", "m.02xhgwq": "Novelist", "m.0dxtg": "Screenwriter"}}, {"question": "where does the potomac river flow into", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g52g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g52g ns:geography.river.mouth ?x .\n}\n", "logical_form": "( JOIN ( R [ geography , river , mouth ] ) [ Potomac River ] )", "golden_entities": {"m.0g52g": "Potomac River"}, "answer_entities": {"m.0g66h": "Chesapeake Bay"}}, {"question": "when does the world cup occur", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.030q7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.030q7 ns:time.recurring_event.current_frequency ?x .\n}\n", "logical_form": "( JOIN ( R [ time , recurring event , current frequency ] ) [ FIFA World Cup ] )", "golden_entities": {"m.030q7": "FIFA World Cup"}, "answer_entities": {"m.02sjt6q": "Every 4 Years"}}, {"question": "what years the steelers won the super bowl", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05tfm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05tfm ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Pittsburgh Steelers ] )", "golden_entities": {"m.05tfm": "Pittsburgh Steelers"}, "answer_entities": {"m.0_gt_jy": "2011 AFC Championship Game", "m.0_gt_lv": "2009 AFC Championship Game", "m.0_gt_my": "2006 AFC Championship Game", "m.032tn6": "Super Bowl XL", "m.04n7r5": "Super Bowl XLIII", "m.076p2": "Super Bowl IX", "m.076pf": "Super Bowl X", "m.076qg": "Super Bowl XIII", "m.076qt": "Super Bowl XIV", "m.0hzps_h": "1996 AFC Championship Game"}}, {"question": "where does danish language come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0295r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0295r ns:language.human_language.language_family ?x .\n}\n", "logical_form": "( JOIN ( R [ language , human language , language family ] ) [ Danish Language ] )", "golden_entities": {"m.0295r": "Danish Language"}, "answer_entities": {"m.0140kd": "North Germanic languages", "m.03489": "Germanic languages", "m.03v09": "Indo-European languages"}}, {"question": "what countries are in the baltic region", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xrc5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xrc5 ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ Baltic region ] ) )", "golden_entities": {"m.01xrc5": "Baltic region", "m.01mp": "Country"}, "answer_entities": {"m.021hqs": "Latvian Soviet Socialist Republic", "m.0247nt": "Lithuanian Soviet Socialist Republic", "m.0pyvq": "Estonian Soviet Socialist Republic"}}, {"question": "what time is in london heathrow", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jn4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jn4 ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ London Heathrow Airport ] )", "golden_entities": {"m.03jn4": "London Heathrow Airport"}, "answer_entities": {"m.03bdv": "Greenwich Mean Time Zone"}}, {"question": "what continent does the amazon river flow through", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0sd7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0sd7 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mh .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Continent ] ) ( JOIN ( R [ location , location , containedby ] ) [ Amazon River ] ) )", "golden_entities": {"m.0sd7": "Amazon River", "m.01mh": "Continent"}, "answer_entities": {"m.06n3y": "South America"}}, {"question": "who played elle greenaway", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09g8nbm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09g8nbm ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Elle Greenaway ] ) )", "golden_entities": {"m.09g8nbm": "Elle Greenaway"}, "answer_entities": {"m.09x9q2": "Lola Glaudini"}}, {"question": "what did captain scott die of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06dlh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06dlh ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Robert Falcon Scott ] )", "golden_entities": {"m.06dlh": "Robert Falcon Scott"}, "answer_entities": {"m.01flyj": "Starvation"}}, {"question": "what city did elvis presley grew up in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02jq1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02jq1 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Elvis Presley ] )", "golden_entities": {"m.02jq1": "Elvis Presley"}, "answer_entities": {"m.0wqwj": "Tupelo"}}, {"question": "what continent is belize located in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0164b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0164b ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Belize ] )", "golden_entities": {"m.0164b": "Belize"}, "answer_entities": {"m.059g4": "North America"}}, {"question": "what party was winston churchill in politics", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.082xp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.082xp ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n", "logical_form": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Winston Churchill ] ) )", "golden_entities": {"m.082xp": "Winston Churchill"}, "answer_entities": {"m.01fml": "Liberal Party", "m.07wpm": "Conservative Party"}}, {"question": "who was philip randolph", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lsst)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lsst ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Asa Philip Randolph ] )", "golden_entities": {"m.01lsst": "Asa Philip Randolph"}, "answer_entities": {"m.04hx60": "Social activist", "m.05vd69b": "Trade unionist"}}, {"question": "what to see and do in san diego california", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.071vr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.071vr ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ San Diego ] )", "golden_entities": {"m.071vr": "San Diego"}, "answer_entities": {"m.01094zpg": "Aquatica San Diego", "m.01v05h": "San Diego Zoo", "m.02400r": "USS Midway", "m.028bh_9": "Children's Pool Beach", "m.02pt3vb": "La Jolla Cove", "m.033zn0": "Balboa Park", "m.03yncwm": "Timken Museum of Art", "m.04c6gj": "Old Town San Diego State Historic Park", "m.04rfpv": "Hotel del Coronado", "m.06qlyn": "Cabrillo National Monument", "m.096pq": "San Diego Zoo Safari Park", "m.09f7hq": "Belmont Park", "m.0c8cjw": "SeaWorld San Diego", "m.0fnfb4": "Rock 'n' Roll San Diego Marathon", "m.0g4y9s": "Old Point Loma Lighthouse", "m.0g72c": "Mission San Diego de Alcal\u00e1", "m.0gyhsd": "Birch Aquarium"}}, {"question": "what is the zip code for clarksville tn", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0_w5_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0_w5_ ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ Clarksville ] )", "golden_entities": {"m.0_w5_": "Clarksville"}, "answer_entities": {"m.020w_kz": "37040", "m.03dxjrj": "37042", "m.03dxjry": "37043", "m.07nr01f": "37044", "m.07nr01n": "37041"}}, {"question": "where 's wayne state", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.065n9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.065n9c ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Wayne State College ] )", "golden_entities": {"m.065n9c": "Wayne State College"}, "answer_entities": {"m.05fhy": "Nebraska", "m.09c7w0": "United States of America", "m.0xbqg": "Wayne"}}, {"question": "which country is gaza city located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0357_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0357_ ns:location.administrative_division.country ?x .\n}\n", "logical_form": "( JOIN ( R [ location , administrative division , country ] ) [ Gaza Strip ] )", "golden_entities": {"m.0357_": "Gaza Strip"}, "answer_entities": {"m.01k0p4": "State of Palestine"}}, {"question": "what country did james watt come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043rm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043rm ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ James Watt ] )", "golden_entities": {"m.043rm": "James Watt"}, "answer_entities": {"m.014tss": "Kingdom of Great Britain", "m.06q1r": "Scotland"}}, {"question": "what are the two houses in congress", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07t31)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07t31 ns:government.governmental_body.component_bodies ?x .\n}\n", "logical_form": "( JOIN ( R [ government , governmental body , component bodies ] ) [ United States Congress ] )", "golden_entities": {"m.07t31": "United States Congress"}, "answer_entities": {"m.07t58": "United States Senate", "m.0b3wk": "United States House of Representatives"}}, {"question": "what is the major language spoken in canada", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d060g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d060g ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ Canada ] )", "golden_entities": {"m.0d060g": "Canada"}, "answer_entities": {"m.02h40lc": "English Language", "m.064_8sq": "French"}}, {"question": "what did camille grammer do for a living", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06x0s_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06x0s_ ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Camille Grammer ] )", "golden_entities": {"m.06x0s_": "Camille Grammer"}, "answer_entities": {"m.01d_h8": "Film Producer", "m.02h6p92": "Dancer", "m.02hrh1q": "Actor", "m.0d1pc": "Model", "m.0dxtg": "Screenwriter", "m.0dypbr": "TV Personality"}}, {"question": "who did georgia o'keeffe inspired", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01t807)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01t807 ns:influence.influence_node.influenced ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced ] ) [ Georgia O'Keeffe ] )", "golden_entities": {"m.01t807": "Georgia O'Keeffe"}, "answer_entities": {"m.06hzym": "Arthur Dove"}}]