[{"question": "what region is thailand located in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07f1x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07f1x ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01nt .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Region ] ) ( JOIN ( R [ location , location , containedby ] ) [ Thailand ] ) )", "golden_entities": {"m.07f1x": "Thailand", "m.01nt": "Region"}, "answer_entities": {"m.073q1": "Southeast Asia"}}, {"question": "where to visit in orlando florida", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ply0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ply0 ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Orlando ] )", "golden_entities": {"m.0ply0": "Orlando"}, "answer_entities": {"m.011cgl9q": "Aquatica Orlando", "m.027988f": "Holy Land Experience", "m.02hzwl": "Disney's Animal Kingdom", "m.02mv6p": "Magic Kingdom", "m.02mv7g": "Disney's Hollywood Studios", "m.02txcm": "DisneyQuest", "m.02vm9cg": "Orlando Science Center", "m.034130": "Universal Orlando", "m.03c_xr2": "Cornell Fine Arts Museum", "m.03c6j75": "Wet 'n Wild Orlando", "m.03ctc7p": "Orlando Museum of Art", "m.03d62sn": "Old Orange County Courthouse", "m.0437y8": "Disney's Blizzard Beach", "m.04dh7m": "Disney's River Country", "m.04srm9": "Disney's Typhoon Lagoon", "m.05ngvz": "Harry P. Leu Gardens", "m.05ppq8": "Islands of Adventure", "m.05pzpj": "Charles Hosmer Morse Museum of American Art", "m.05qsyq": "Universal Studios Florida", "m.05x_5h": "Arboretum of the University of Central Florida", "m.06ph97": "Discovery Cove", "m.09b3f": "Epcot", "m.0b__kbm": "The Wizarding World of Harry Potter", "m.0c2dly": "SeaWorld Orlando"}}, {"question": "what was alexander graham bell known for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k70)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k70 ns:user.lindenb.default_domain.scientist.known_for ?x .\n}\n", "logical_form": "( JOIN ( R [ user , lindenb , default domain , scientist , known for ] ) [ Alexander Graham Bell ] )", "golden_entities": {"m.0k70": "Alexander Graham Bell"}, "answer_entities": {"m.07cx4": "Telephone"}}, {"question": "what band did joe satriani play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j6cj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j6cj ns:music.group_member.membership ?y .\n?y ns:music.group_membership.group ?x .\n}\n", "logical_form": "( JOIN ( R [ music , group membership , group ] ) ( JOIN ( R [ music , group member , membership ] ) [ Joe Satriani ] ) )", "golden_entities": {"m.0j6cj": "Joe Satriani"}, "answer_entities": {"m.01ntj9y": "Greg Kihn Band", "m.01w7ljg": "The G3 Jam", "m.04q7vx6": "Chickenfoot", "m.0cfgd": "Deep Purple"}}, {"question": "where to go in florida for vacation", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02xry)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02xry ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Florida ] )", "golden_entities": {"m.02xry": "Florida"}, "answer_entities": {"m.02zjt1": "Dry Tortugas National Park", "m.0b6d60t": "Legoland Florida", "m.0dl60w": "Downey Park", "m.0n53kv5": "Westland Mall"}}, {"question": "who plays shao kahn", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.037btz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.037btz ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Shao Kahn ] ) )", "golden_entities": {"m.037btz": "Shao Kahn"}, "answer_entities": {"m.02gf_l": "Frank Welker", "m.0f702q": "Brian Thompson"}}, {"question": "what did douglas engelbart invent", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027_g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027_g ns:law.inventor.inventions ?x .\n}\n", "logical_form": "( JOIN ( R [ law , inventor , inventions ] ) [ Douglas Engelbart ] )", "golden_entities": {"m.027_g": "Douglas Engelbart"}, "answer_entities": {"m.020lf": "Mouse"}}, {"question": "where did chef chuck hughes go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06kj3z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06kj3z ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Chuck Hughes ] ) )", "golden_entities": {"m.06kj3z": "Chuck Hughes"}, "answer_entities": {"m.01s7pm": "University of Texas at El Paso"}}, {"question": "who plays marvin eriksen", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0nf3nb6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0nf3nb6 ns:tv.tv_character.appeared_in_tv_episodes ?y .\n?y ns:tv.tv_guest_role.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , tv guest role , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv episodes ] ) [ Marvin Eriksen Sr. ] ) )", "golden_entities": {"m.0nf3nb6": "Marvin Eriksen Sr."}, "answer_entities": {"m.01x0sy": "Bill Fagerbakke"}}, {"question": "where is fiat abarth made", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j4r5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j4r5 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Abarth ] ) )", "golden_entities": {"m.0j4r5": "Abarth"}, "answer_entities": {"m.07mgr": "Turin"}}, {"question": "where was tommy steele born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01np2lh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01np2lh ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Tommy Steele ] )", "golden_entities": {"m.01np2lh": "Tommy Steele"}, "answer_entities": {"m.0n8y8": "Bermondsey"}}, {"question": "what does chad michael murray play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bmn4p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bmn4p ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Chad Michael Murray ] ) )", "golden_entities": {"m.0bmn4p": "Chad Michael Murray"}, "answer_entities": {"m.0_gbp0r": "Cavemen", "m.01067b9q": "Other People's Children", "m.011c9f76": "Texas Rising", "m.02cxj_": "A Cinderella Story", "m.02rhlv1": "Megiddo: The Omega Code 2", "m.060v34": "House of Wax", "m.06y60c": "Freaky Friday", "m.0c015zb": "The Haunting in Connecticut 2: Ghosts of Georgia", "m.0dgs3mp": "The Lone Ranger", "m.0f9x7r": "Home of the Brave", "m.0fpjb4z": "Christmas Cupid", "m.0ft693q": "Murphy's Dozen", "m.0ghghlt": "The Carrier", "m.0gxw8cp": "Lies in Plain Sight", "m.0h_cvyh": "To Write Love on Her Arms", "m.0pcfg64": "Left Behind", "m.0q2lh3h": "Fruitvale Station", "m.0vplztk": "A Madea Christmas"}}, {"question": "what are some important events in ancient egypt", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kg9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kg9 ns:location.location.events ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , events ] ) [ Ancient Egypt ] )", "golden_entities": {"m.0kg9": "Ancient Egypt"}, "answer_entities": {"m.01qq1q": "First Intermediate Period of Egypt", "m.01wc29": "Greco-Persian Wars", "m.02sl7g": "New Kingdom of Egypt"}}, {"question": "where are you if you're in khartoum", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04d_m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04d_m ns:base.biblioness.bibs_location.country ?x .\n}\n", "logical_form": "( JOIN ( R [ base , biblioness , bibs location , country ] ) [ Khartoum ] )", "golden_entities": {"m.04d_m": "Khartoum"}, "answer_entities": {"m.06tw8": "Sudan"}}, {"question": "where did fred west work", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01cjf6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01cjf6 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Fred West ] )", "golden_entities": {"m.01cjf6": "Fred West"}, "answer_entities": {"m.02vk771": "Laborer"}}, {"question": "what nestle owns", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01556g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01556g ns:business.business_operation.industry ?x .\n}\n", "logical_form": "( JOIN ( R [ business , business operation , industry ] ) [ Nestl\u00e9 ] )", "golden_entities": {"m.01556g": "Nestl\u00e9"}, "answer_entities": {"m.02vjn0": "Food processing", "m.03q9wy3": "Ice Cream and Frozen Dessert Manufacturing", "m.03q9x41": "Soft Drink Manufacturing", "m.03q9x47": "Bottled Water Manufacturing", "m.03qtd73": "Cookies and Crackers", "m.03qtd7r": "Chocolate and Cocoa Products", "m.03qtd9w": "Bottled and Canned Soft Drinks and Carbonated Waters"}}, {"question": "where does the st. joe river start", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02809z6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02809z6 ns:geography.river.origin ?x .\n}\n", "logical_form": "( JOIN ( R [ geography , river , origin ] ) [ Saint Joe River ] )", "golden_entities": {"m.02809z6": "Saint Joe River"}, "answer_entities": {"m.02p3sy_": "Bitterroot Mountains"}}, {"question": "when does nasdaq start trading", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05dq_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05dq_ ns:organization.organization.date_founded ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , date founded ] ) [ NASDAQ ] )", "golden_entities": {"m.05dq_": "NASDAQ"}, "answer_entities": {"value": "1971-02-04"}}, {"question": "what language do they speak in guyana south america", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034m8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034m8 ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ Guyana ] )", "golden_entities": {"m.034m8": "Guyana"}, "answer_entities": {"m.02h40lc": "English Language"}}, {"question": "what year were the new york yankees established", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cqt41)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cqt41 ns:sports.sports_team.founded ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , founded ] ) [ New York Yankees ] )", "golden_entities": {"m.0cqt41": "New York Yankees"}, "answer_entities": {"value": "1901"}}, {"question": "what city was nelson mandela born in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g7q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g7q ns:people.person.place_of_birth ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ people , person , place of birth ] ) [ Nelson Mandela ] ) )", "golden_entities": {"m.05g7q": "Nelson Mandela", "m.01m9": "City/Town/Village"}, "answer_entities": {"m.02q_z4c": "Mvezo"}}, {"question": "what did frankie lymon die from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mlkv5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mlkv5 ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Frankie Lymon ] )", "golden_entities": {"m.01mlkv5": "Frankie Lymon"}, "answer_entities": {"m.02kp1qn": "Heroin overdose"}}, {"question": "what was matthias schleiden known for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dd3q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dd3q ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Matthias Jakob Schleiden ] )", "golden_entities": {"m.0dd3q": "Matthias Jakob Schleiden"}, "answer_entities": {"m.02h6p1f": "Botanist"}}, {"question": "who is kristen stewart parents", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07swvb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07swvb ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ Kristen Stewart ] )", "golden_entities": {"m.07swvb": "Kristen Stewart"}, "answer_entities": {"m.07sggh4": "John Stewart", "m.07sgghb": "Jules Mann-Stewart"}}, {"question": "what is kate spade", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bkdx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bkdx ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Kate Spade ] )", "golden_entities": {"m.06bkdx": "Kate Spade"}, "answer_entities": {"m.02hqyhw": "Fashion designer"}}, {"question": "where is louisville ne", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0x50_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0x50_ ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Louisville ] )", "golden_entities": {"m.0x50_": "Louisville"}, "answer_entities": {"m.05fhy": "Nebraska", "m.0n7q7": "Cass County"}}, {"question": "where is united arab located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j1z8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j1z8 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ United Arab Emirates ] )", "golden_entities": {"m.0j1z8": "United Arab Emirates"}, "answer_entities": {"m.0150_4": "Arab world", "m.02qkt": "Eurasia", "m.02rm8kw": "Southern Sun Hotel Group", "m.04wsz": "Middle East", "m.0cvmv": "Arabian Peninsula", "m.0j0k": "Asia"}}, {"question": "what is duncan bannatyne", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bw7qg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bw7qg ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Duncan Bannatyne ] )", "golden_entities": {"m.0bw7qg": "Duncan Bannatyne"}, "answer_entities": {"m.012t_z": "Businessperson", "m.015cjr": "Presenter", "m.025sppp": "Investor", "m.02hrh1q": "Actor", "m.09x_r": "Entrepreneur", "m.0dypbr": "TV Personality"}}, {"question": "what to do in perth scotland", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g133)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g133 ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Perth ] )", "golden_entities": {"m.0g133": "Perth"}, "answer_entities": {"m.02qpplk": "Balhousie Castle", "m.05_5q3x": "Perth Leisure Pool", "m.05skl2": "Huntingtower Castle", "m.06zpxmh": "Perth Theatre", "m.0bh99kx": "Perth Concert Hall", "m.0ck07z": "Dupplin Cross", "m.0dfrjw": "Elcho Castle", "m.0h7qg7": "Perth Museum and Art Gallery", "m.0k6_2rk": "Branklyn Garden", "m.0k6_2s0": "Kirk of St. John the Baptist"}}, {"question": "where did president andrew jackson grew up", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rlz ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Andrew Jackson ] )", "golden_entities": {"m.0rlz": "Andrew Jackson"}, "answer_entities": {"m.054qtk": "Waxhaws"}}, {"question": "where the murray river located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_4l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_4l ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Murray River ] )", "golden_entities": {"m.04_4l": "Murray River"}, "answer_entities": {"m.09pkq0": "Australian Continent", "m.0chghy": "Australia"}}, {"question": "what year did reggie bush get drafted", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05cb70)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05cb70 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Reggie Bush ] ) )", "golden_entities": {"m.05cb70": "Reggie Bush"}, "answer_entities": {"m.09l0x9": "2006 NFL draft"}}, {"question": "what was sherlock holmes famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06rkl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06rkl ns:fictional_universe.fictional_character.occupation ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , fictional character , occupation ] ) [ Sherlock Holmes ] )", "golden_entities": {"m.06rkl": "Sherlock Holmes"}, "answer_entities": {"m.011__xll": "Consulting Detective"}}, {"question": "who is roger bacon inventor of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06g98)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06g98 ns:law.inventor.inventions ?x .\n}\n", "logical_form": "( JOIN ( R [ law , inventor , inventions ] ) [ Roger Bacon ] )", "golden_entities": {"m.06g98": "Roger Bacon"}, "answer_entities": {"m.030c3d": "Magnifying glass"}}, {"question": "what city was woodstock held in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.085kv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.085kv ns:time.event.locations ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ time , event , locations ] ) [ Woodstock ] ) )", "golden_entities": {"m.085kv": "Woodstock", "m.01m9": "City/Town/Village"}, "answer_entities": {"m.0y9lg": "Bethel"}}, {"question": "what was one thing benjamin franklin is famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019fz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019fz ns:base.argumentmaps.innovator.original_ideas ?x .\n}\n", "logical_form": "( JOIN ( R [ base , argumentmaps , innovator , original ideas ] ) [ Benjamin Franklin ] )", "golden_entities": {"m.019fz": "Benjamin Franklin"}, "answer_entities": {"m.029mmz": "Franklin stove"}}, {"question": "who started southwest airlines", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gztl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gztl ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ Southwest Airlines ] )", "golden_entities": {"m.0gztl": "Southwest Airlines"}, "answer_entities": {"m.03wk_6": "Herb Kelleher", "m.047pxff": "Rollin King"}}, {"question": "who is abraham descended from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pwb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pwb ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ Abraham ] )", "golden_entities": {"m.0pwb": "Abraham"}, "answer_entities": {"m.0j0hf": "Terah", "m.0pkp466": "Amathlaah"}}, {"question": "what did atticus finch do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pk0sd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pk0sd ns:fictional_universe.fictional_character.occupation ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , fictional character , occupation ] ) [ Atticus Finch ] )", "golden_entities": {"m.02pk0sd": "Atticus Finch"}, "answer_entities": {"m.04gc2": "Lawyer"}}, {"question": "what language does people in france speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f8l9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f8l9c ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ France ] )", "golden_entities": {"m.0f8l9c": "France"}, "answer_entities": {"m.017k6": "Basque Language", "m.01m69": "Catalan language", "m.01pr4b": "Proven\u00e7al Language", "m.0247v": "Corsican Language", "m.02ckss": "Tahitian Language", "m.02cw59": "Franco-Proven\u00e7al Language", "m.02hrcsr": "Breton", "m.02hwllm": "Yeniche Language", "m.02hx2bx": "Guianese Creole French Language", "m.02jcw": "Esperanto Language", "m.02y3v": "West Flemish", "m.033bw8": "Gallo language", "m.04k39q": "Antillean Creole French", "m.05l0r": "Occitan language", "m.064_8sq": "French", "m.09hw0w": "R\u00e9union Creole French Language", "m.0l2r0": "Alsatian dialect"}}, {"question": "where is the spratly islands located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06trw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06trw ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Spratly Islands ] )", "golden_entities": {"m.06trw": "Spratly Islands"}, "answer_entities": {"m.0j0k": "Asia"}}, {"question": "where did hammurabi come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03qlj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03qlj ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Hammurabi ] )", "golden_entities": {"m.03qlj": "Hammurabi"}, "answer_entities": {"m.01cyh": "Babylon"}}, {"question": "where is st helens park nsw", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07pbxd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07pbxd ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ St Helens Park ] )", "golden_entities": {"m.07pbxd": "St Helens Park"}, "answer_entities": {"m.05fly": "New South Wales"}}, {"question": "who killed david ruffin", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04qh81)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04qh81 ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ David Ruffin ] )", "golden_entities": {"m.04qh81": "David Ruffin"}, "answer_entities": {"m.01tf_6": "Drug overdose"}}, {"question": "what is d capital city of south africa", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hzlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hzlz ns:location.country.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , capital ] ) [ South Africa ] )", "golden_entities": {"m.0hzlz": "South Africa"}, "answer_entities": {"m.01yj2": "Cape Town", "m.067z4": "Pretoria", "m.0c499": "Bloemfontein"}}, {"question": "who owns the sf giants owner", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0713r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0713r ns:sports.professional_sports_team.owner_s ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , professional sports team , owner s ] ) [ San Francisco Giants ] )", "golden_entities": {"m.0713r": "San Francisco Giants"}, "answer_entities": {"m.03cyzbv": "Bill Neukom"}}, {"question": "what is the capital of kentucky known for its bluegrass", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0498y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0498y ns:location.us_state.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , us state , capital ] ) [ Kentucky ] )", "golden_entities": {"m.0498y": "Kentucky"}, "answer_entities": {"m.0fvvg": "Frankfort"}}, {"question": "who voices lola bunny in looney tunes", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0534r8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0534r8 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Lola Bunny ] ) )", "golden_entities": {"m.0534r8": "Lola Bunny"}, "answer_entities": {"m.024my5": "Kath Soucie", "m.0fm5ld": "Britt McKillip"}}, {"question": "what is jonathan swift famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_dj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_dj ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Jonathan Swift ] )", "golden_entities": {"m.03_dj": "Jonathan Swift"}, "answer_entities": {"m.02449y": "Pamphleteer", "m.02xhgwq": "Novelist", "m.05xjb": "Priest", "m.05z96": "Poet", "m.0cbd2": "Writer", "m.0kyk": "Author"}}, {"question": "when is the diwali festival", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019fpj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019fpj ns:time.holiday.day_of_year ?x .\n}\n", "logical_form": "( JOIN ( R [ time , holiday , day of year ] ) [ Diwali ] )", "golden_entities": {"m.019fpj": "Diwali"}, "answer_entities": {"m.04rc2q7": "29 Ashwin"}}, {"question": "what did hitler do bad", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m9_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m9_ ns:base.activism.activist.area_of_activism ?x .\n}\n", "logical_form": "( JOIN ( R [ base , activism , activist , area of activism ] ) [ Adolf Hitler ] )", "golden_entities": {"m.07_m9_": "Adolf Hitler"}, "answer_entities": {"m.0148d": "Anti-communism", "m.05hyf": "Nazism"}}, {"question": "where is murray kentucky", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0td1z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0td1z ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Murray ] )", "golden_entities": {"m.0td1z": "Murray"}, "answer_entities": {"m.0nnqt": "Calloway County"}}, {"question": "where is mount vernon texas", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0101gj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0101gj ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Mount Vernon ] )", "golden_entities": {"m.0101gj": "Mount Vernon"}, "answer_entities": {"m.0mrrn": "Franklin County"}}, {"question": "what guitar does duane allman play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01qyy3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01qyy3 ns:music.guitarist.guitars_played ?x .\n}\n", "logical_form": "( JOIN ( R [ music , guitarist , guitars played ] ) [ Duane Allman ] )", "golden_entities": {"m.01qyy3": "Duane Allman"}, "answer_entities": {"m.02j9dp": "Gibson Les Paul"}}, {"question": "what party did paul keating belong to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05y28)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05y28 ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n", "logical_form": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Paul Keating ] ) )", "golden_entities": {"m.05y28": "Paul Keating"}, "answer_entities": {"m.0q96": "Australian Labor Party"}}, {"question": "where is art smith from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027560_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027560_ ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Art Smith ] )", "golden_entities": {"m.027560_": "Art Smith"}, "answer_entities": {"m.0rkvq": "Jasper"}}]