[{"question": "what medium is the school of athens", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025sm_7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025sm_7 ns:visual_art.artwork.art_form ?x .\n}\n", "logical_form": "( JOIN ( R [ visual art , artwork , art form ] ) [ The School of Athens ] )", "golden_entities": {"m.025sm_7": "The School of Athens"}, "answer_entities": {"m.02_3k": "Fresco", "m.05qdh": "Painting"}}, {"question": "what year did florida marlins win the world series", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02__x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02__x ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Miami Marlins ] )", "golden_entities": {"m.02__x": "Miami Marlins"}, "answer_entities": {"m.01z534": "2003 World Series"}}, {"question": "where north dakota located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05fky)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05fky ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , administrative parent ] ) [ North Dakota ] )", "golden_entities": {"m.05fky": "North Dakota"}, "answer_entities": {"m.09c7w0": "United States of America"}}, {"question": "where was the battle of vicksburg held", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01hf7f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01hf7f ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ Siege of Vicksburg ] )", "golden_entities": {"m.01hf7f": "Siege of Vicksburg"}, "answer_entities": {"m.04tgp": "Mississippi", "m.0nfv_": "Warren County"}}, {"question": "who is the head coach of the tennessee titans", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07l2m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07l2m ns:american_football.football_team.current_head_coach ?x .\n}\n", "logical_form": "( JOIN ( R [ american football , football team , current head coach ] ) [ Tennessee Titans ] )", "golden_entities": {"m.07l2m": "Tennessee Titans"}, "answer_entities": {"m.0b9srp": "Ken Whisenhunt"}}, {"question": "what type of government does fiji have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02wt0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02wt0 ns:location.country.form_of_government ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , form of government ] ) [ Fiji ] )", "golden_entities": {"m.02wt0": "Fiji"}, "answer_entities": {"m.012qkq": "Military dictatorship", "m.025s5c_": "Military junta", "m.0glnsx": "Parliamentary republic"}}, {"question": "who was dan cody", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07m5fb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07m5fb ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Dan Cody ] )", "golden_entities": {"m.07m5fb": "Dan Cody"}, "answer_entities": {"m.02h665k": "American football player"}}, {"question": "what was wrong with joan crawford", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cgbf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cgbf ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n", "logical_form": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ Joan Crawford ] )", "golden_entities": {"m.0cgbf": "Joan Crawford"}, "answer_entities": {"m.026k8yn": "Mysophobia"}}, {"question": "what does latin america consist of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04pnx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04pnx ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ Latin America ] ) )", "golden_entities": {"m.04pnx": "Latin America", "m.01mp": "Country"}, "answer_entities": {"m.0164b": "Belize", "m.0165v": "Bolivia", "m.016wzw": "Peru", "m.01p1v": "Chile", "m.01p8s": "Costa Rica", "m.027rn": "Dominican Republic", "m.02k8k": "El Salvador", "m.0345_": "Guatemala", "m.03gyl": "Haiti", "m.03h2c": "Honduras", "m.05c74": "Nicaragua", "m.05qx1": "Panama", "m.05r7t": "Puerto Rico", "m.05v10": "Paraguay", "m.07twz": "Uruguay", "m.07ylj": "Venezuela", "m.0b90_r": "Mexico", "m.0d04z6": "Cuba", "m.0jgd": "Argentina"}}, {"question": "who is the manager of the st louis cardinals", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06x68)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06x68 ns:baseball.baseball_team.current_manager ?x .\n}\n", "logical_form": "( JOIN ( R [ baseball , baseball team , current manager ] ) [ St. Louis Cardinals ] )", "golden_entities": {"m.06x68": "St. Louis Cardinals"}, "answer_entities": {"m.046gb9": "Mike Matheny"}}, {"question": "where in oregon was stand by me filmed", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0m2kd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0m2kd ns:film.film.featured_film_locations ?x .\n}\n", "logical_form": "( JOIN ( R [ film , film , featured film locations ] ) [ Stand by Me ] )", "golden_entities": {"m.0m2kd": "Stand by Me"}, "answer_entities": {"m.05kj_": "Oregon"}}, {"question": "what did writers of the harlem renaissance write about", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019y_2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019y_2 ns:book.book_subject.works ?x .\n?x ns:common.topic.notable_types ns:m.03jz7ls .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Written Work ] ) ( JOIN ( R [ book , book subject , works ] ) [ Harlem Renaissance ] ) )", "golden_entities": {"m.019y_2": "Harlem Renaissance", "m.03jz7ls": "Written Work"}, "answer_entities": {"m.0h2x8v6": "Looking at the World through Michael Jackson's Left Eye (Part 2)", "m.0hnx0cj": "Countdown of 10 Amazing Moments from the Year 2011: No. 6 Sonny Rollins"}}, {"question": "where did prophet daniel died", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cts)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cts ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Daniel ] )", "golden_entities": {"m.02cts": "Daniel"}, "answer_entities": {"m.01cyh": "Babylon"}}, {"question": "where did lebron james go to highschool", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01jz6d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01jz6d ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ LeBron James ] ) )", "golden_entities": {"m.01jz6d": "LeBron James"}, "answer_entities": {"m.0gpg1h": "St. Vincent\u2013St. Mary High School"}}, {"question": "where do the fla marlins play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02__x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02__x ns:sports.sports_team.arena_stadium ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Miami Marlins ] )", "golden_entities": {"m.02__x": "Miami Marlins"}, "answer_entities": {"m.04m_xv0": "Marlins Park"}}, {"question": "who was arthur miller father", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0yfp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0yfp ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ Arthur Miller ] ) )", "golden_entities": {"m.0yfp": "Arthur Miller", "m.05zppz": "Male"}, "answer_entities": {"m.0j72h2b": "Isidore Miller"}}, {"question": "what influenced william morris to be an artist", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08304)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08304 ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ William Morris ] )", "golden_entities": {"m.08304": "William Morris"}, "answer_entities": {"m.0k5mt": "John Ruskin"}}, {"question": "what super bowls have the giants won", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05gg4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05gg4 ns:sports.sports_team.championships ?x .\n?x ns:common.topic.notable_types ns:m.01xljv1 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Super bowl ] ) ( JOIN ( R [ sports , sports team , championships ] ) [ New York Giants ] ) )", "golden_entities": {"m.05gg4": "New York Giants", "m.01xljv1": "Super bowl"}, "answer_entities": {"m.043t_rh": "Super Bowl XLVI", "m.04myq1": "Super Bowl XLII", "m.076sw": "Super Bowl XXI", "m.076v7": "Super Bowl XXV"}}, {"question": "where was rod stewart born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0qf11)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0qf11 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Rod Stewart ] )", "golden_entities": {"m.0qf11": "Rod Stewart"}, "answer_entities": {"m.0n9_t": "Highgate"}}, {"question": "who played eowyn in the lord of the rings movies", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gynx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gynx ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ \u00c9owyn ] ) )", "golden_entities": {"m.0gynx": "\u00c9owyn"}, "answer_entities": {"m.0294fd": "Miranda Otto"}}, {"question": "what timezone is minneapolis in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fpzwf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fpzwf ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Minneapolis ] )", "golden_entities": {"m.0fpzwf": "Minneapolis"}, "answer_entities": {"m.02fqwt": "Central Time Zone"}}, {"question": "who is aidan davis", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.080p6xw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.080p6xw ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Aidan Davis ] )", "golden_entities": {"m.080p6xw": "Aidan Davis"}, "answer_entities": {"m.015cjr": "Presenter", "m.02h6p92": "Dancer"}}, {"question": "what was nicolaus copernicus occupation", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vvm4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vvm4 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Nicolaus Copernicus ] )", "golden_entities": {"m.01vvm4": "Nicolaus Copernicus"}, "answer_entities": {"m.04s2z": "Mathematician", "m.05t4q": "Physician", "m.080ntlp": "Diplomat", "m.0frz0": "Economist", "m.0h9c": "Astronomer", "m.0n1h": "Artist"}}, {"question": "what did richard arkwright contribute to the industrial revolution", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01tglh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01tglh ns:law.inventor.inventions ?x .\n}\n", "logical_form": "( JOIN ( R [ law , inventor , inventions ] ) [ Richard Arkwright ] )", "golden_entities": {"m.01tglh": "Richard Arkwright"}, "answer_entities": {"m.03lqnn": "Water frame", "m.052wmn": "Spinning frame"}}, {"question": "what kind of currency does greece have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035qy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035qy ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Greece ] )", "golden_entities": {"m.035qy": "Greece"}, "answer_entities": {"m.02l6h": "Euro"}}, {"question": "where is the mozambique located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wlh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wlh ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Mozambique ] )", "golden_entities": {"m.04wlh": "Mozambique"}, "answer_entities": {"m.0dg3n1": "Africa"}}, {"question": "where is azerbaijan", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jhd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jhd ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Azerbaijan ] )", "golden_entities": {"m.0jhd": "Azerbaijan"}, "answer_entities": {"m.02qkt": "Eurasia"}}, {"question": "what is the money of argentina called", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jgd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jgd ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Argentina ] )", "golden_entities": {"m.0jgd": "Argentina"}, "answer_entities": {"m.024nzm": "Argentine peso"}}, {"question": "what did bella abzug do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02dqgj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02dqgj ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Bella Abzug ] )", "golden_entities": {"m.02dqgj": "Bella Abzug"}, "answer_entities": {"m.02hrh1q": "Actor", "m.04gc2": "Lawyer", "m.04hx60": "Social activist", "m.0fj9f": "Politician"}}, {"question": "where was alice paul born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lp71)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lp71 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Alice Stokes Paul ] )", "golden_entities": {"m.02lp71": "Alice Stokes Paul"}, "answer_entities": {"m.0xl8s": "Moorestown"}}, {"question": "what did john quincy adams died of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_nq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_nq ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ John Quincy Adams ] )", "golden_entities": {"m.03_nq": "John Quincy Adams"}, "answer_entities": {"m.08g5q7": "Cerebral hemorrhage"}}, {"question": "who is raquel welch 's daughter", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012s5j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012s5j ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , children ] ) [ Raquel Welch ] ) )", "golden_entities": {"m.012s5j": "Raquel Welch", "m.02zsn": "Female"}, "answer_entities": {"m.03tgq6": "Tahnee Welch"}}, {"question": "what money is used in the maldives", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ty8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ty8 ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Maldives ] )", "golden_entities": {"m.04ty8": "Maldives"}, "answer_entities": {"m.02gsxf": "Maldivian rufiyaa"}}, {"question": "where does mike leach coach", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08gnpj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08gnpj ns:american_football.football_coach.current_team_head_coached ?x .\n}\n", "logical_form": "( JOIN ( R [ american football , football coach , current team head coached ] ) [ Mike Leach ] )", "golden_entities": {"m.08gnpj": "Mike Leach"}, "answer_entities": {"m.026cmdc": "Washington State Cougars football"}}, {"question": "what is the zip code of new york city", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02_286)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02_286 ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ New York City ] )", "golden_entities": {"m.02_286": "New York City"}, "answer_entities": {"m.0_mhlxy": "10025-5381", "m.0_w67hg": "10017-4019", "m.0107dzx4": "11217-1415", "m.016cddv": "10203", "m.020c50v": "11217", "m.020cl_8": "10025", "m.020cltt": "10019", "m.020clxq": "10014", "m.020clzc": "10040", "m.020cm14": "10005", "m.020cm2l": "10021", "m.020cm48": "10028", "m.020cm5s": "10013", "m.020cm7r": "10009", "m.020cm8s": "10016", "m.020cmcd": "10036", "m.020cmkn": "10012", "m.020cmps": "10024", "m.020cmr8": "10002", "m.020cmv1": "10018", "m.020cmyr": "10022", "m.020cn_r": "10004", "m.020cn0m": "10003", "m.020cn6r": "10023", "m.020cng6": "10017", "m.020cnj9": "10038", "m.020cnlw": "10026", "m.020cnmw": "10011", "m.020cnsq": "10010", "m.020cp3y": "10001", "m.020cp8s": "10029", "m.020cq__": "10031", "m.020cqz5": "10128", "m.020cr5d": "10281", "m.020crcb": "10027", "m.020cwxl": "10020", "m.020cx3d": "10007", "m.020cxr5": "10169", "m.020d1nr": "10006", "m.020d4r3": "10034", "m.020d4sy": "10039", "m.020d8m0": "10280", "m.020d8y2": "10166", "m.020dg8t": "10032", "m.020dhp6": "10035", "m.020dtg6": "10030", "m.020f865": "10103", "m.020fscw": "10104", "m.020fynd": "10033", "m.020fzxq": "10119", "m.020tdj5": "10107", "m.0290rz5": "10110", "m.02h3_7t": "10167", "m.02vkh17": "10170", "m.03bqhf8": "10116", "m.03dtw7x": "10037", "m.03dtw8w": "10041", "m.03dtw98": "10044", "m.03dtw9w": "10069", "m.03dtwbg": "10111", "m.03dtwbw": "10112", "m.03dtwc8": "10115", "m.03dtwd1": "10152", "m.03dtwdg": "10153", "m.03dtwdw": "10154", "m.03dtwf8": "10162", "m.03dtwfp": "10165", "m.03dtwgh": "10171", "m.03dtwgx": "10172", "m.03dtwh9": "10173", "m.03dtwhq": "10177", "m.03dtwj3": "10271", "m.03dtwjj": "10278", "m.03dtwjy": "10279", "m.03dtwkj": "10282", "m.03dtz_s": "11692", "m.03dtz5z": "11411", "m.03dtz7_": "11416", "m.03dtz8d": "11417", "m.03dtzdg": "11429", "m.03qs2cj": "10106", "m.045p8jl": "10124", "m.046vzr7": "10118", "m.04dxqrf": "10270", "m.04k_fg6": "10105", "m.04l021b": "10043", "m.04lqcpy": "10065", "m.05hr2bj": "10286", "m.05nlt8h": "10055", "m.07nrq_1": "10072", "m.07nrq_h": "10060", "m.07nrq_y": "10046", "m.07nrqfh": "10292", "m.07nrqfy": "10285", "m.07nrqg4": "10277", "m.07nrqgc": "10276", "m.07nrqgl": "10275", "m.07nrqgt": "10274", "m.07nrqh0": "10273", "m.07nrqh7": "10272", "m.07nrqhp": "10269", "m.07nrqhx": "10268", "m.07nrqj_": "10258", "m.07nrqj3": "10265", "m.07nrqjb": "10261", "m.07nrqjk": "10260", "m.07nrqjs": "10259", "m.07nrqk6": "10257", "m.07nrqkf": "10256", "m.07nrqkn": "10249", "m.07nrqkw": "10242", "m.07nrql2": "10213", "m.07nrql9": "10212", "m.07nrqlj": "10211", "m.07nrqlw": "10199", "m.07nrqm2": "10197", "m.07nrqm9": "10196", "m.07nrqmj": "10185", "m.07nrqmv": "10184", "m.07nrqn_": "10174", "m.07nrqn1": "10179", "m.07nrqnb": "10178", "m.07nrqnk": "10176", "m.07nrqns": "10175", "m.07nrqp6": "10168", "m.07nrqpf": "10164", "m.07nrqpn": "10163", "m.07nrqpw": "10161", "m.07nrqq2": "10160", "m.07nrqq9": "10159", "m.07nrqqj": "10158", "m.07nrqqr": "10157", "m.07nrqqz": "10156", "m.07nrqr5": "10155", "m.07nrqrd": "10151", "m.07nrqrm": "10150", "m.07nrqrv": "10149", "m.07nrqs1": "10138", "m.07nrqs8": "10133", "m.07nrqsh": "10132", "m.07nrqsq": "10131", "m.07nrqsy": "10130", "m.07nrqt4": "10129", "m.07nrqtc": "10126", "m.07nrqtl": "10125", "m.07nrqv0": "10123", "m.07nrqv7": "10122", "m.07nrqvg": "10121", "m.07nrqvp": "10120", "m.07nrqw3": "10117", "m.07nrqwb": "10114", "m.07nrqwk": "10113", "m.07nrqws": "10109", "m.07nrqx6": "10102", "m.07nrqxf": "10099", "m.07nrqxn": "10098", "m.07nrqxw": "10096", "m.07nrqy2": "10095", "m.07nrqy9": "10094", "m.07nrqyj": "10090", "m.07nrqyr": "10087", "m.07nrqyz": "10082", "m.07nrqz5": "10081", "m.07nrqzd": "10080", "m.07nrqzm": "10079", "m.07nrqzv": "10075", "m.07nrr04": "10045", "m.07tnk2q": "10108", "m.07tnk2y": "10101", "m.09r__f4": "10017-3147", "m.09rz8fm": "10048", "m.09sbscr": "10048-0203", "m.09sfpb1": "10017-3954", "m.09sh45t": "10017-2299", "m.09shyxm": "10166-3399", "m.09sl6l2": "10261-1094", "m.09smbyz": "10271-0080", "m.0gtbdpl": "10024-1826", "m.0gw4pc8": "10031-6282", "m.0gw5p40": "11429-2708", "m.0gwdbvx": "10024-2748", "m.0h7ryg8": "10029-6574", "m.0zf6j8h": "10007-2136"}}, {"question": "what condition does michael j fox have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hz_1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hz_1 ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n", "logical_form": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ Michael J. Fox ] )", "golden_entities": {"m.0hz_1": "Michael J. Fox"}, "answer_entities": {"m.0g02vk": "Parkinson's disease"}}, {"question": "where did jrr tolkien live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.041h0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.041h0 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ J. R. R. Tolkien ] ) )", "golden_entities": {"m.041h0": "J. R. R. Tolkien"}, "answer_entities": {"m.0k33p": "Birmingham"}}, {"question": "what to do in panama city beach fl", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rhg5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rhg5 ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Panama City Beach ] )", "golden_entities": {"m.0rhg5": "Panama City Beach"}, "answer_entities": {"m.02q0c5g": "Club La Vela", "m.03qcdj2": "Shipwreck Island", "m.04_d4w": "St. Andrews State Park", "m.04jcmvz": "Man in the Sea Museum", "m.04xj82": "Camp Helen State Park", "m.0b6k8d0": "Thunder Beach Motorcycle Rally", "m.0bx_v4t": "Miracle Strip at Pier Park", "m.0cm8mdj": "Pier Park", "m.0gzwlv": "Latimer Cabin"}}, {"question": "where is san miguel mexico on map", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.056201)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.056201 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.02_3pws .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Mexican state ] ) ( JOIN ( R [ location , location , containedby ] ) [ San Miguel de Allende ] ) )", "golden_entities": {"m.056201": "San Miguel de Allende", "m.02_3pws": "Mexican state"}, "answer_entities": {"m.0259ws": "Guanajuato"}}, {"question": "where are the great pyramid of giza located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.036mk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.036mk ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Great Pyramid of Giza ] )", "golden_entities": {"m.036mk": "Great Pyramid of Giza"}, "answer_entities": {"m.02k54": "Egypt", "m.06bkmh": "Giza Plateau"}}, {"question": "what was liam neeson 's character in star wars", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h5g_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h5g_ ns:film.actor.film ?y .\n?y ns:film.performance.character ?x .\n?y ns:film.performance.film ns:m.0ddt_ .\n}\n", "logical_form": "( JOIN ( R [ film , performance , character ] ) ( AND ( JOIN [ film , performance , film ] [ Star Wars Episode I: The Phantom Menace ] ) ( JOIN ( R [ film , actor , film ] ) [ Liam Neeson ] ) ) )", "golden_entities": {"m.0h5g_": "Liam Neeson", "m.0ddt_": "Star Wars Episode I: The Phantom Menace"}, "answer_entities": {"m.0gzgj": "Qui-Gon Jinn"}}, {"question": "what is the capital of georgia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d0x8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d0x8 ns:base.aareas.schema.administrative_area.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , capital ] ) [ Georgia ] )", "golden_entities": {"m.0d0x8": "Georgia"}, "answer_entities": {"m.013yq": "Atlanta"}}, {"question": "who is susan st james", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03rp65)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03rp65 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Susan Saint James ] )", "golden_entities": {"m.03rp65": "Susan Saint James"}, "answer_entities": {"m.02hrh1q": "Actor"}}, {"question": "what is chris paul 's son name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cymln)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cymln ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , children ] ) [ Chris Paul ] ) )", "golden_entities": {"m.0cymln": "Chris Paul", "m.05zppz": "Male"}, "answer_entities": {"m.0j2l1rs": "Christopher Emmanuel Paul II"}}, {"question": "what is the state flag of colorado called", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01n4w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01n4w ns:symbols.flag_referent.flag ?y .\n?y ns:symbols.flag_use.flag ?x .\n}\n", "logical_form": "( JOIN ( R [ symbols , flag use , flag ] ) ( JOIN ( R [ symbols , flag referent , flag ] ) [ Colorado ] ) )", "golden_entities": {"m.01n4w": "Colorado"}, "answer_entities": {"m.02hc9l": "Flag of Colorado"}}, {"question": "where marie curie come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.053_d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.053_d ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Marie Curie ] )", "golden_entities": {"m.053_d": "Marie Curie"}, "answer_entities": {"m.081m_": "Warsaw"}}, {"question": "who is facebook 's founder", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hmyfsv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hmyfsv ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ Facebook, Inc. ] )", "golden_entities": {"m.0hmyfsv": "Facebook, Inc."}, "answer_entities": {"m.076zfg8": "Eduardo Saverin", "m.086dny": "Mark Zuckerberg", "m.0cm9z65": "Andrew McCollum", "m.0d8xb7": "Dustin Moskovitz", "m.0gh3lq": "Chris Hughes"}}, {"question": "what kind of money do you use in aruba", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j11)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j11 ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Aruba ] )", "golden_entities": {"m.0j11": "Aruba"}, "answer_entities": {"m.08s1k3": "Aruban florin"}}, {"question": "what is lil wayne real name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016kjs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016kjs ns:base.schemastaging.context_name.official_name ?x .\n}\n", "logical_form": "( JOIN ( R [ base , schemastaging , context name , official name ] ) [ Lil Wayne ] )", "golden_entities": {"m.016kjs": "Lil Wayne"}, "answer_entities": {"value": "Dwayne Michael Carter, Jr."}}, {"question": "what religions are practiced in afghanistan", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jdd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jdd ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ location , religion percentage , religion ] ) ( JOIN ( R [ location , statistical region , religions ] ) [ Afghanistan ] ) )", "golden_entities": {"m.0jdd": "Afghanistan"}, "answer_entities": {"m.06pq6": "Shia Islam", "m.078tg": "Sunni Islam"}}]