[{"question": "what type of currency does the us have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09c7w0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09c7w0 ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ United States of America ] )", "golden_entities": {"m.09c7w0": "United States of America"}, "answer_entities": {"m.09nqf": "United States Dollar"}}, {"question": "where is canadian county oklahoma", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0my97)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0my97 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Canadian County ] )", "golden_entities": {"m.0my97": "Canadian County"}, "answer_entities": {"m.05mph": "Oklahoma", "m.06mq6mj": "Oklahoma City, OK Metropolitan Statistical Area"}}, {"question": "what does rob kardashian do for living", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043n6dp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043n6dp ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Rob Kardashian ] )", "golden_entities": {"m.043n6dp": "Rob Kardashian"}, "answer_entities": {"m.03gkb0": "Socialite", "m.0d1pc": "Model", "m.0dypbr": "TV Personality"}}, {"question": "where is oceania on a map", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05nrg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05nrg ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Oceania ] )", "golden_entities": {"m.05nrg": "Oceania"}, "answer_entities": {"m.05rgl": "Pacific Ocean", "m.0cq_kk5": "DVD Region 4"}}, {"question": "what can you do in palm springs ca", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0r3tq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0r3tq ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Palm Springs ] )", "golden_entities": {"m.0r3tq": "Palm Springs"}, "answer_entities": {"m.0358tp": "Palm Springs Aerial Tramway", "m.0381tp": "San Jacinto Mountains", "m.05tdgy": "Moorten Botanical Garden and Cactarium", "m.06_p64x": "Tahquitz Canyon", "m.08__9v": "Living Desert Zoo and Gardens", "m.0c84q7": "Palm Springs Air Museum", "m.0crgq6": "Knott's Soak City", "m.0ggmtr": "Palm Springs Walk of Stars", "m.0h032j": "The Fabulous Palm Springs Follies", "m.0k3plgs": "The Palm Springs Art Museum"}}, {"question": "who is adam sandler", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pz91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pz91 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Adam Sandler ] )", "golden_entities": {"m.0pz91": "Adam Sandler"}, "answer_entities": {"m.018gz8": "Comedian", "m.01d_h8": "Film Producer", "m.02hrh1q": "Actor", "m.03gjzk": "Television producer", "m.09jwl": "Musician", "m.0dxtg": "Screenwriter", "m.0nbcg": "Songwriter", "m.0np9r": "Voice Actor"}}, {"question": "where was st elizabeth ann seton born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01sl19)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01sl19 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Elizabeth Ann Seton ] )", "golden_entities": {"m.01sl19": "Elizabeth Ann Seton"}, "answer_entities": {"m.02_286": "New York City"}}, {"question": "what does the adriatic sea border", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0p_x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0p_x ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n}\n", "logical_form": "( JOIN ( R [ location , adjoining relationship , adjoins ] ) ( JOIN ( R [ location , location , adjoin s ] ) [ Adriatic Sea ] ) )", "golden_entities": {"m.0p_x": "Adriatic Sea"}, "answer_entities": {"m.0jdx": "Albania"}}, {"question": "what language do the assyrians speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0wmn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0wmn ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Assyria ] )", "golden_entities": {"m.0wmn": "Assyria"}, "answer_entities": {"m.0dc0d": "Akkadian language"}}, {"question": "where was abraham lincoln buried", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:people.deceased_person.place_of_burial ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Abraham Lincoln ] )", "golden_entities": {"m.0gzh": "Abraham Lincoln"}, "answer_entities": {"m.04v7rs": "Oak Ridge Cemetery"}}, {"question": "who was the grandson of king david 's father", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cvn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cvn ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ David ] ) )", "golden_entities": {"m.02cvn": "David", "m.05zppz": "Male"}, "answer_entities": {"m.01ndvc": "Jesse"}}, {"question": "where is devon sawa now", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0y58x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0y58x ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Devon Sawa ] ) )", "golden_entities": {"m.0y58x": "Devon Sawa"}, "answer_entities": {"m.080h2": "Vancouver"}}, {"question": "who was marilyn monroe 's parents", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wqr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wqr ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ Marilyn Monroe ] )", "golden_entities": {"m.04wqr": "Marilyn Monroe"}, "answer_entities": {"m.0gxs_rk": "Martin Edward Mortensen", "m.0gxs_rr": "Gladys Pearl Baker"}}, {"question": "where is shoreditch", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0nc3h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0nc3h ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Shoreditch ] )", "golden_entities": {"m.0nc3h": "Shoreditch"}, "answer_entities": {"m.02jx1": "England", "m.04jpl": "London"}}, {"question": "where does the spanish language come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06nm1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06nm1 ns:base.rosetta.languoid.parent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , rosetta , languoid , parent ] ) [ Spanish Language ] )", "golden_entities": {"m.06nm1": "Spanish Language"}, "answer_entities": {"m.05tjmkj": "Castilian Group"}}, {"question": "what political party was henry clay", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ct18)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ct18 ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n", "logical_form": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Henry Clay ] ) )", "golden_entities": {"m.0ct18": "Henry Clay"}, "answer_entities": {"m.01spy8": "National Republican Party", "m.07wdw": "Whig Party", "m.07wf9": "Democratic-Republican Party"}}, {"question": "what is capital city of ontario", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05kr_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05kr_ ns:location.province.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , province , capital ] ) [ Ontario ] )", "golden_entities": {"m.05kr_": "Ontario"}, "answer_entities": {"m.0h7h6": "Toronto"}}, {"question": "what did mary harris jones accomplish", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01l0km)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01l0km ns:base.activism.activist.area_of_activism ?x .\n}\n", "logical_form": "( JOIN ( R [ base , activism , activist , area of activism ] ) [ Mary Harris Jones ] )", "golden_entities": {"m.01l0km": "Mary Harris Jones"}, "answer_entities": {"m.03qc82m": "Children's rights", "m.048g08": "Labor rights"}}, {"question": "where is ellis park rugby stadium", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ysfk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ysfk ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01n7 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Location ] ) ( JOIN ( R [ location , location , containedby ] ) [ Ellis Park Stadium ] ) )", "golden_entities": {"m.04ysfk": "Ellis Park Stadium", "m.01n7": "Location"}, "answer_entities": {"m.06z6mz": "Doornfontein"}}, {"question": "what label is jojo signed to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wjgjb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wjgjb ns:music.artist.label ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , label ] ) [ JoJo ] )", "golden_entities": {"m.01wjgjb": "JoJo"}, "answer_entities": {"m.01trtc": "Interscope Records", "m.01w40h": "Mercury Records", "m.03vlr_": "Edel AG", "m.04fcjt": "Universal Records", "m.05clg8": "Universal Motown Republic Group", "m.05clhc": "Blackground Records", "m.0g768": "Atlantic Records"}}, {"question": "where did douglas macarthur die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c_jc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c_jc ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Douglas MacArthur ] )", "golden_entities": {"m.0c_jc": "Douglas MacArthur"}, "answer_entities": {"m.0rh6k": "Washington, D.C."}}, {"question": "where is hong kong china", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03h64)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03h64 ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Hong Kong ] )", "golden_entities": {"m.03h64": "Hong Kong"}, "answer_entities": {"m.0j0k": "Asia"}}, {"question": "what countries do they speak italian", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02bjrlw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02bjrlw ns:language.human_language.countries_spoken_in ?x .\n}\n", "logical_form": "( JOIN ( R [ language , human language , countries spoken in ] ) [ Italian Language ] )", "golden_entities": {"m.02bjrlw": "Italian Language"}, "answer_entities": {"m.015fr": "Brazil", "m.01pj7": "Croatia", "m.02q14r": "Republic of Genoa", "m.03rjj": "Italy", "m.06mzp": "Switzerland", "m.06sff": "San Marino", "m.06t8v": "Slovenia", "m.07ytt": "Vatican City", "m.0b90_r": "Mexico", "m.0jgd": "Argentina", "m.0rpgpql": "Gozo"}}, {"question": "what are bridgit mendler 's parents names", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04081f3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04081f3 ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ Bridgit Mendler ] )", "golden_entities": {"m.04081f3": "Bridgit Mendler"}, "answer_entities": {"m.0qf8bfs": "Harry Mendler", "m.0qf8bm3": "Leah Mendler"}}, {"question": "where is the capital of canada on the map", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d060g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d060g ns:location.country.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , capital ] ) [ Canada ] )", "golden_entities": {"m.0d060g": "Canada"}, "answer_entities": {"m.05ksh": "Ottawa"}}, {"question": "what kind of paintings did frida kahlo do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015k04)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015k04 ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}\n", "logical_form": "( JOIN ( R [ visual art , visual artist , associated periods or movements ] ) [ Frida Kahlo ] )", "golden_entities": {"m.015k04": "Frida Kahlo"}, "answer_entities": {"m.0127jb": "Magic realism", "m.015r61": "Modern art", "m.073_6": "Surrealism"}}, {"question": "what was francisco vasquez de coronado known for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jgb2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jgb2 ns:common.topic.notable_for ?y .\n?y ns:common.notable_for.object ?x .\n}\n", "logical_form": "( JOIN ( R [ common , notable for , object ] ) ( JOIN ( R [ common , topic , notable for ] ) [ Francisco V\u00e1zquez de Coronado ] ) )", "golden_entities": {"m.0jgb2": "Francisco V\u00e1zquez de Coronado"}, "answer_entities": {"m.0jgcl": "Conquistador"}}, {"question": "what form of government does greece use", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035qy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035qy ns:location.country.form_of_government ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , form of government ] ) [ Greece ] )", "golden_entities": {"m.035qy": "Greece"}, "answer_entities": {"m.018wl5": "Parliamentary system", "m.0c9rw5": "Constitutional republic"}}, {"question": "what movies has michael clarke duncan been in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lkcc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lkcc ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Michael Clarke Duncan ] ) )", "golden_entities": {"m.02lkcc": "Michael Clarke Duncan"}, "answer_entities": {"m.0137wc": "A Night at the Roxbury", "m.016rw2": "Friday", "m.01ztp8": "Brother Bear", "m.02772bj": "The Last Mimzy", "m.027tdtt": "The Golden Blaze", "m.02pym58": "D.E.B.S.", "m.02rd7cn": "Dinotopia: Quest for the Ruby Sunstone", "m.02v8kmz": "Bulworth", "m.02x0srr": "Welcome Home, Roscoe Jenkins", "m.03s9kp": "The Green Mile", "m.03t95n": "The Scorpion King", "m.03tbg6": "Cats & Dogs", "m.03w9fwk": "Street Fighter: The Legend of Chun-Li", "m.03wccpk": "The Slammin' Salmon", "m.0435vm": "The Island", "m.047wh1": "Planet of the Apes", "m.048vhl": "Daredevil", "m.04b4pq": "Delgo", "m.04j2sl_": "They Call Me Sirr", "m.04n1s9m": "Cats & Dogs: The Revenge of Kitty Galore", "m.04tqtl": "Sin City", "m.04xx51": "Racing Stripes", "m.05zn3t_": "Caught Up", "m.064nstb": "One Way", "m.072hxn": "The Players Club", "m.08952r": "Talladega Nights: The Ballad of Ricky Bobby", "m.08f3y0": "See Spot Run", "m.08zjv6": "Breakfast of Champions", "m.09146g": "Kung Fu Panda", "m.099p23": "Kim Possible: A Sitch in Time", "m.09c_s1": "George of the Jungle 2", "m.0bh8yn3": "Green Lantern", "m.0bk2k2": "Brother Bear 2", "m.0bk2pk": "Invasion of the Tinysauruses", "m.0c4yqd4": "Redemption Road", "m.0crs593": "American Crude", "m.0crwmhk": "Pursued", "m.0crzh7b": "R. Kelly: The R. in R&B: The Video Collection", "m.0d1dcw": "Air Buddies", "m.0dgq12n": "Cross", "m.0ds33": "Armageddon", "m.0dsb4b": "The Underground Comedy Movie", "m.0fk5t4": "Back in Business", "m.0fzz_c": "Operation: Jet Fusion", "m.0g_1sj": "School for Scoundrels", "m.0g5qvj": "The Whole Nine Yards", "m.0gfzfj": "Family Guy Presents: Stewie Griffin: The Untold Story", "m.0gjs8p": "George and the Dragon", "m.0gwz12g": "A Resurrection", "m.0gy5rt9": "From the Rough", "m.0h15c4x": "In the Hive", "m.0h2cyp5": "A Crush on You", "m.0h646fd": "Criminal Empire for Dummies", "m.0hntz2g": "Legend of a Rabbit", "m.0kv36n": "Slipstream", "m.0y7tq_4": "D.E.B.S."}}, {"question": "what is jessica ennis sport", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b7nrg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b7nrg ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Jessica Ennis-Hill ] )", "golden_entities": {"m.0b7nrg": "Jessica Ennis-Hill"}, "answer_entities": {"m.059846g": "Track and field athlete"}}, {"question": "where is tahiti bora bora", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hb6g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hb6g ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Tahiti ] )", "golden_entities": {"m.0hb6g": "Tahiti"}, "answer_entities": {"m.02wzv": "French Polynesia", "m.05fp6n": "Windward Islands"}}, {"question": "where did joe namath live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p_3k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p_3k ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Joe Namath ] ) )", "golden_entities": {"m.01p_3k": "Joe Namath"}, "answer_entities": {"m.02_3xy": "Fire Island", "m.0zj_2": "Beaver Falls"}}, {"question": "where do samsung lions play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08bbzt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08bbzt ns:sports.sports_team.arena_stadium ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Samsung Lions ] )", "golden_entities": {"m.08bbzt": "Samsung Lions"}, "answer_entities": {"m.0cmd6s": "Daegu Baseball Stadium"}}, {"question": "what does annie leibovitz do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015m2c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015m2c ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Annie Leibovitz ] )", "golden_entities": {"m.015m2c": "Annie Leibovitz"}, "answer_entities": {"m.03hz6vv": "Visual Artist", "m.0lgw7": "Photographer", "m.0n1h": "Artist"}}, {"question": "who did mike tomlin play for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c5f_j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c5f_j ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Mike Tomlin ] ) )", "golden_entities": {"m.0c5f_j": "Mike Tomlin"}, "answer_entities": {"m.07s4hxr": "William & Mary Tribe football"}}, {"question": "who is ben roethlisberger parents", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.033t8w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.033t8w ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ Ben Roethlisberger ] )", "golden_entities": {"m.033t8w": "Ben Roethlisberger"}, "answer_entities": {"m.0j2jy4g": "Ida Jane Foust", "m.0j2jy4n": "Kenneth Todd Roethlisberger"}}, {"question": "what are the zoroastrian scriptures called", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025sr3l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025sr3l ns:religion.religion.texts ?x .\n?x ns:common.topic.notable_types ns:m.02knxyp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Religious Text ] ) ( JOIN ( R [ religion , religion , texts ] ) [ Zoroastrianism ] ) )", "golden_entities": {"m.025sr3l": "Zoroastrianism", "m.02knxyp": "Religious Text"}, "answer_entities": {"m.0g_f2": "Avesta"}}, {"question": "what organization did martin luther king lead", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:organization.organization_founder.organizations_founded ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization founder , organizations founded ] ) [ Martin Luther King, Jr. ] )", "golden_entities": {"m.051cc": "Martin Luther King, Jr."}, "answer_entities": {"m.027mt4": "Southern Christian Leadership Conference", "m.0829gl": "Montgomery Improvement Association"}}, {"question": "what kind of guitar does jemaine clement play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bg539)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bg539 ns:music.group_member.instruments_played ?x .\n?x ns:music.instrument.family ns:m.0342h .\n}\n", "logical_form": "( AND ( JOIN [ music , instrument , family ] [ Guitar ] ) ( JOIN ( R [ music , group member , instruments played ] ) [ Jemaine Clement ] ) )", "golden_entities": {"m.0bg539": "Jemaine Clement", "m.0342h": "Guitar"}, "answer_entities": {"m.018vs": "Bass guitar"}}, {"question": "where was lance armstrong born and in what year", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hfwb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hfwb ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Lance Armstrong ] )", "golden_entities": {"m.0hfwb": "Lance Armstrong"}, "answer_entities": {"m.013m4v": "Plano"}}, {"question": "what kind of money is used in israel", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03spz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03spz ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Israel ] )", "golden_entities": {"m.03spz": "Israel"}, "answer_entities": {"m.01jcw8": "Israeli new shekel"}}, {"question": "what is the zip code for trenton ohio", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ytcc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ytcc ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ Trenton ] )", "golden_entities": {"m.0ytcc": "Trenton"}, "answer_entities": {"m.03dw2gg": "45067"}}, {"question": "what is north dakota state 's mascot", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xysf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xysf ns:education.educational_institution.mascot ?x .\n}\n", "logical_form": "( JOIN ( R [ education , educational institution , mascot ] ) [ North Dakota State University ] )", "golden_entities": {"m.01xysf": "North Dakota State University"}, "answer_entities": {"m.07g61_": "Thundar"}}, {"question": "what does duffy sing", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03h3y8v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03h3y8v ns:music.artist.track ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , track ] ) [ Duffy ] )", "golden_entities": {"m.03h3y8v": "Duffy"}, "answer_entities": {"m.0_61gwm": "You Are", "m.03cq02g": "Mercy", "m.0d_3jv6": "Stepping Stone", "m.0dm71jf": "Warwick Avenue", "m.0dm9yv1": "Cariad Dwi'n Unig", "m.0dmrn14": "Tomorrow", "m.0dn5vkf": "Big Flame", "m.0dnsmxf": "Mercy", "m.0dp6x9z": "Frame Me", "m.0dpls1s": "Live and Let Die", "m.0dq004p": "Rain On Your Parade", "m.0dqq94w": "Rockferry", "m.0dr4wgj": "Mercy (Gareth Wyn remix)", "m.0dt2rm0": "Distant Dreamer", "m.0dt9xnq": "Mercy (Hot 22 vocal remix)", "m.0dtmm44": "I'm Scared", "m.0dtp4_j": "Smoke Without Fire", "m.0dw_vlf": "Save It for Your Prayers", "m.0dw2qd0": "Delayed Devotion", "m.0dw7t06": "Mercy", "m.0dwqqgb": "Stepping Stone", "m.0dxdqpz": "Syrup & Honey", "m.0dxjjx9": "Breaking My Own Heart", "m.0dzrbsm": "Hanging On Too Long", "m.0dzt3c5": "Oh Boy", "m.0f_0w_g": "Enough Love", "m.0f_0x03": "Stop", "m.0f_0x07": "Breaking My Own Heart", "m.0f0hhml": "Enough Love", "m.0f0qgk6": "Dim Dealltwriaeth", "m.0f0s4km": "Smoke Without Fire", "m.0f13y3g": "Mercy", "m.0f2svtk": "Mercy", "m.0f2xbbj": "Serious", "m.0f2xbvj": "Rockferry", "m.0f3hfs7": "Rain on Your Parade", "m.0f5lfzy": "Hedfan Angel", "m.0f6cxxm": "Put It in Perspective", "m.0f6cxyc": "Loving You", "m.0f7pmb8": "Mercy", "m.0f996ym": "Mercy", "m.0fhrfhf": "Rockferry", "m.0fjrccz": "Big Flame", "m.0fk0dsx": "Tomorrow", "m.0fr71xw": "Lovestruck", "m.0frj7pf": "Fool for You", "m.0fs4tvr": "Please Stay", "m.0ftb1x4": "Mercy (remix)", "m.0ftg7pt": "Too Hurt to Dance", "m.0ftwvbd": "Stepping Stone (Cavemen remix)", "m.0fvbd13": "Keeping My Baby", "m.0fw6v5p": "Well Well Well", "m.0fwcc1w": "Stepping Stone", "m.0fxd3hr": "Girl", "m.0fyz4cq": "Hard for the Heart", "m.0fyz4cz": "Endlessly", "m.0fyz4d1": "My Boy", "m.0fyz4d5": "Don't Forsake Me", "m.0fyz4dc": "Breath Away", "m.0g1fcb6": "Well Well Well (acoustic version)", "m.0g6fmd2": "Stay With Me Baby", "m.0nnnmfn": "Warwick Avenue", "m.0nnyt4r": "Well Well Well (Digital Dog radio edit)", "m.0ws_sns": "Immaculate", "m.0ws_v00": "Brother", "m.0ws_v7k": "Days Left", "m.0ws_y5g": "Play", "m.0wsysy3": "Hard To Remember", "m.0wt00hx": "Wake Up", "m.0wt03_5": "Goodbye", "m.0wt08z8": "Worry-Free Life", "m.0wt0gzk": "My Destroyer", "m.0wt0hr2": "Impress You", "m.0wt0jht": "Masterpiece", "m.0wt0jwp": "Step", "m.0yt9xxh": "Mercy", "m.0ytkm8v": "Well, Well, Well"}}, {"question": "what school did tupac go to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07pzc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07pzc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Tupac Shakur ] ) )", "golden_entities": {"m.07pzc": "Tupac Shakur"}, "answer_entities": {"m.0269lqm": "Paul Laurence Dunbar High School", "m.03jl5b": "Baltimore School for the Arts", "m.06cbpm": "Tamalpais High School"}}, {"question": "what does guyana speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034m8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034m8 ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Guyana ] )", "golden_entities": {"m.034m8": "Guyana"}, "answer_entities": {"m.026ztd1": "Macushi Language", "m.02h40lc": "English Language", "m.02hwv5d": "Wapishana Language", "m.02hxg9j": "Patamona Language", "m.02hxgv4": "Carib Language", "m.02hxhnv": "Warao Language", "m.02hxq7p": "Waiwai Language", "m.048dyk": "Akawaio Language", "m.05zjd": "Portuguese Language", "m.06nm1": "Spanish Language", "m.0hc2x": "Arawak"}}, {"question": "what county is minneapolis mn in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fpzwf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fpzwf ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Minneapolis ] )", "golden_entities": {"m.0fpzwf": "Minneapolis"}, "answer_entities": {"m.0nhmw": "Hennepin County"}}, {"question": "who is queen elizabeth 1 father", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02rg_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02rg_ ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ Elizabeth I of England ] ) )", "golden_entities": {"m.02rg_": "Elizabeth I of England", "m.05zppz": "Male"}, "answer_entities": {"m.03p77": "Henry VIII of England"}}]