[{"question": "what was howard carter 's job", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jvx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jvx ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Howard Carter ] )", "golden_entities": {"m.03jvx": "Howard Carter"}, "answer_entities": {"m.02h6pd1": "Archaeologist", "m.02kx6lf": "Egyptologist"}}, {"question": "what was the cause of death of michael jackson", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Michael Jackson ] )", "golden_entities": {"m.09889g": "Michael Jackson"}, "answer_entities": {"m.0gg4h": "Cardiac arrest"}}, {"question": "what is the capital city of texas usa", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07b_l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07b_l ns:location.us_state.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , us state , capital ] ) [ Texas ] )", "golden_entities": {"m.07b_l": "Texas"}, "answer_entities": {"m.0vzm": "Austin"}}, {"question": "what time zone is new england usa in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.029jpy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.029jpy ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ New England ] )", "golden_entities": {"m.029jpy": "New England"}, "answer_entities": {"m.02hcv8": "Eastern Time Zone"}}, {"question": "what is tulane university 's mascot", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0160nk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0160nk ns:education.educational_institution.mascot ?x .\n}\n", "logical_form": "( JOIN ( R [ education , educational institution , mascot ] ) [ Tulane University ] )", "golden_entities": {"m.0160nk": "Tulane University"}, "answer_entities": {"m.05g1yr7": "Riptide the Pelican"}}, {"question": "where is aviano air force base located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05l8fk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05l8fk ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Aviano Air Base ] )", "golden_entities": {"m.05l8fk": "Aviano Air Base"}, "answer_entities": {"m.03rjj": "Italy"}}, {"question": "where did giovanni da verrazano live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k6d2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k6d2 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Giovanni da Verrazzano ] ) )", "golden_entities": {"m.0k6d2": "Giovanni da Verrazzano"}, "answer_entities": {"m.01b3jn": "Dieppe"}}, {"question": "what was antonio vivaldi known for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pth)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pth ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Antonio Vivaldi ] )", "golden_entities": {"m.0pth": "Antonio Vivaldi"}, "answer_entities": {"m.012vv0": "Violist", "m.01c72t": "Composer", "m.05xjb": "Priest"}}, {"question": "when are the summer olympics held", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06vvk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06vvk ns:time.recurring_event.instances ?x .\n}\n", "logical_form": "( JOIN ( R [ time , recurring event , instances ] ) [ Summer Olympic Games ] )", "golden_entities": {"m.06vvk": "Summer Olympic Games"}, "answer_entities": {"m.0130xg": "1906 Intercalated Games", "m.016q6p": "1940 Summer Olympics", "m.016q75": "1944 Summer Olympics", "m.016q7p": "1916 Summer Olympics", "m.016r9z": "1900 Summer Olympics", "m.018ljb": "1912 Summer Olympics", "m.018qb4": "1908 Summer Olympics", "m.018wrk": "1904 Summer Olympics", "m.03tnk7": "The 2016 Rio Olympic Games", "m.05gj2h": "2020 Summer Olympics", "m.06sks6": "The London 2012 Summer Olympics", "m.09x3r": "1936 Summer Olympics", "m.0blg2": "1948 Summer Olympics", "m.0c_tl": "1896 Summer Olympics", "m.0jdk_": "2000 Summer Olympics", "m.0jhn7": "1996 Summer Olympics", "m.0jkvj": "1976 Summer Olympics", "m.0kbvb": "2004 Summer Olympics", "m.0kbws": "2008 Summer Olympics", "m.0l6m5": "1992 Summer Olympics", "m.0l6mp": "1988 Summer Olympics", "m.0l6ny": "1984 Summer Olympics", "m.0l6vl": "1980 Summer Olympics", "m.0l98s": "1972 Summer Olympics", "m.0l998": "1968 Summer Olympics", "m.0lbbj": "1964 Summer Olympics", "m.0lbd9": "1960 Summer Olympics", "m.0ldqf": "1956 Summer Olympics", "m.0lgxj": "1952 Summer Olympics", "m.0lk8j": "1932 Summer Olympics", "m.0lv1x": "1928 Summer Olympics", "m.0nbjq": "1924 Summer Olympics", "m.0sxrz": "1920 Summer Olympics"}}, {"question": "what country did the zulu live in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gwrmk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gwrmk ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Zulu Kingdom ] )", "golden_entities": {"m.03gwrmk": "Zulu Kingdom"}, "answer_entities": {"m.02c59t": "Southern Africa"}}, {"question": "where was president chester arthur born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vb2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vb2 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Chester A. Arthur ] )", "golden_entities": {"m.01vb2": "Chester A. Arthur"}, "answer_entities": {"m.010jjd": "Fairfield"}}, {"question": "where to fly in for galapagos islands", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016zjj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016zjj ns:location.location.nearby_airports ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , nearby airports ] ) [ Gal\u00e1pagos Islands ] )", "golden_entities": {"m.016zjj": "Gal\u00e1pagos Islands"}, "answer_entities": {"m.0405q0f": "Seymour Airport", "m.0405q2v": "San Crist\u00f3bal Airport"}}, {"question": "who has tom brady played for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xyt7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xyt7 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Tom Brady ] ) )", "golden_entities": {"m.01xyt7": "Tom Brady"}, "answer_entities": {"m.05g3b": "New England Patriots", "m.0fsb_6": "Michigan Wolverines football"}}, {"question": "what time is it in lake havasu city arizona", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0qpxs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0qpxs ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Lake Havasu City ] )", "golden_entities": {"m.0qpxs": "Lake Havasu City"}, "answer_entities": {"m.02hczc": "Mountain Time Zone"}}, {"question": "what years have the giants won the world series", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0713r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0713r ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ San Francisco Giants ] )", "golden_entities": {"m.0713r": "San Francisco Giants"}, "answer_entities": {"m.0117q3yz": "2014 World Series", "m.09gnk2r": "2010 World Series", "m.0ds8qct": "2012 World Series"}}, {"question": "where did laura bush grow up", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04g8d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04g8d ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Laura Bush ] )", "golden_entities": {"m.04g8d": "Laura Bush"}, "answer_entities": {"m.013n2h": "Midland"}}, {"question": "what currency should i take to mauritius", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04vs9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04vs9 ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Mauritius ] )", "golden_entities": {"m.04vs9": "Mauritius"}, "answer_entities": {"m.02scxb": "Mauritian rupee"}}, {"question": "what did johannes kepler accomplish", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0403d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0403d ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Johannes Kepler ] )", "golden_entities": {"m.0403d": "Johannes Kepler"}, "answer_entities": {"m.025rxky": "Astrologer", "m.04s2z": "Mathematician", "m.05snw": "Physicist", "m.06q2q": "Scientist", "m.0h9c": "Astronomer"}}, {"question": "who is ellen albertini dow", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03hzplf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03hzplf ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Ellen Dow ] )", "golden_entities": {"m.03hzplf": "Ellen Dow"}, "answer_entities": {"m.01d30f": "Teacher", "m.02h6n_q": "Choreographer", "m.02hrh1q": "Actor"}}, {"question": "where is the singapore zoo", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0211mz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0211mz ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Singapore Zoo ] )", "golden_entities": {"m.0211mz": "Singapore Zoo"}, "answer_entities": {"m.06t2t": "Singapore"}}, {"question": "what town was abe lincoln born in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:people.person.place_of_birth ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ people , person , place of birth ] ) [ Abraham Lincoln ] ) )", "golden_entities": {"m.0gzh": "Abraham Lincoln", "m.01m9": "City/Town/Village"}, "answer_entities": {"m.0tgmk": "Hodgenville"}}, {"question": "what teams did jim harbaugh play for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04rmtv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04rmtv ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Jim Harbaugh ] ) )", "golden_entities": {"m.04rmtv": "Jim Harbaugh"}, "answer_entities": {"m.01ct6": "Baltimore Ravens", "m.01y3v": "Chicago Bears", "m.03wnh": "Indianapolis Colts", "m.06rpd": "San Diego Chargers", "m.0fsb_6": "Michigan Wolverines football"}}, {"question": "who played atticus finch in the movie", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pk0sd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pk0sd ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Atticus Finch ] ) )", "golden_entities": {"m.02pk0sd": "Atticus Finch"}, "answer_entities": {"m.0k9j_": "Gregory Peck"}}, {"question": "what party did john tyler belong to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042dk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042dk ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n", "logical_form": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ John Tyler ] ) )", "golden_entities": {"m.042dk": "John Tyler"}, "answer_entities": {"m.07wdw": "Whig Party", "m.0d075m": "Democratic Party"}}, {"question": "what money is used in mozambique", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wlh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wlh ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Mozambique ] )", "golden_entities": {"m.04wlh": "Mozambique"}, "answer_entities": {"m.05yxqw": "Mozambican metical"}}, {"question": "what are the official languages of the dominican republic", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027rn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027rn ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ Dominican Republic ] )", "golden_entities": {"m.027rn": "Dominican Republic"}, "answer_entities": {"m.06nm1": "Spanish Language"}}, {"question": "where was ted kennedy buried", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0194xc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0194xc ns:people.deceased_person.place_of_burial ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Ted Kennedy ] )", "golden_entities": {"m.0194xc": "Ted Kennedy"}, "answer_entities": {"m.0lbp_": "Arlington National Cemetery"}}, {"question": "where was benjamin franklin raised", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019fz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019fz ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Benjamin Franklin ] )", "golden_entities": {"m.019fz": "Benjamin Franklin"}, "answer_entities": {"m.01cx_": "Boston"}}, {"question": "where do people speak burmese", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xrrm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xrrm ns:language.human_language.main_country ?x .\n}\n", "logical_form": "( JOIN ( R [ language , human language , main country ] ) [ Burmese Language ] )", "golden_entities": {"m.01xrrm": "Burmese Language"}, "answer_entities": {"m.04xn_": "Myanmar"}}, {"question": "what is phoebe halliwell 's real name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ymly)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ymly ns:tv.tv_character.appeared_in_tv_episodes ?y .\n?y ns:tv.tv_guest_role.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , tv guest role , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv episodes ] ) [ Phoebe Halliwell ] ) )", "golden_entities": {"m.01ymly": "Phoebe Halliwell"}, "answer_entities": {"m.01pw2f1": "Alyssa Milano", "m.0c90y7": "Lori Rom"}}, {"question": "what is afghanistan money called", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jdd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jdd ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Afghanistan ] )", "golden_entities": {"m.0jdd": "Afghanistan"}, "answer_entities": {"m.019vxc": "Afghan afghani"}}, {"question": "what is atlanta ga famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.013yq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.013yq ns:olympics.olympic_host_city.olympics_hosted ?x .\n}\n", "logical_form": "( JOIN ( R [ olympics , olympic host city , olympics hosted ] ) [ Atlanta ] )", "golden_entities": {"m.013yq": "Atlanta"}, "answer_entities": {"m.0jhn7": "1996 Summer Olympics"}}, {"question": "where is the pepsi center", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wd_7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wd_7 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Pepsi Center ] )", "golden_entities": {"m.01wd_7": "Pepsi Center"}, "answer_entities": {"m.02cl1": "Denver"}}, {"question": "who plays hermione granger", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c8kc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c8kc ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Hermione Granger ] ) )", "golden_entities": {"m.0c8kc": "Hermione Granger"}, "answer_entities": {"m.0134w7": "Emma Watson"}}, {"question": "what inspired m.c. escher to become an artist", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051mn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051mn ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ M. C. Escher ] )", "golden_entities": {"m.051mn": "M. C. Escher"}, "answer_entities": {"m.015g76": "Giovanni Battista Piranesi"}}, {"question": "what county is denver colorado in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cl1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cl1 ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Denver ] )", "golden_entities": {"m.02cl1": "Denver"}, "answer_entities": {}}, {"question": "where does the band metallica live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04rcr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04rcr ns:music.artist.origin ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , origin ] ) [ Metallica ] )", "golden_entities": {"m.04rcr": "Metallica"}, "answer_entities": {"m.030qb3t": "Los Angeles"}}, {"question": "who plays jason gideon", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wmhq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wmhq ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Jason Voorhees ] ) )", "golden_entities": {"m.01wmhq": "Jason Voorhees"}, "answer_entities": {"m.033xr_": "Kane Hodder", "m.04y8c2p": "Tom Morga", "m.05h41sp": "Derek Mears", "m.07qgql": "C. J. Graham", "m.07qgr8": "Ken Kirzinger", "m.0bbb_8y": "Tim Mirkovich", "m.0br44q": "Ted White", "m.0crt01": "Ari Lehman", "m.0crt3v": "Warrington Gillette", "m.0crt58": "Richard Brooker", "m.0gxbnjs": "Steve Daskewisz", "m.0t4z_zj": "Dick Wieand"}}, {"question": "what was vasco nunez de balboa original purpose of his journey", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cl9qq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cl9qq ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Vasco N\u00fa\u00f1ez de Balboa ] )", "golden_entities": {"m.0cl9qq": "Vasco N\u00fa\u00f1ez de Balboa"}, "answer_entities": {"m.040vc4s": "Explorer", "m.0fj9f": "Politician"}}, {"question": "what guitar did clapton play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02qwg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02qwg ns:music.guitarist.guitars_played ?x .\n}\n", "logical_form": "( JOIN ( R [ music , guitarist , guitars played ] ) [ Eric Clapton ] )", "golden_entities": {"m.02qwg": "Eric Clapton"}, "answer_entities": {"m.01jyd4": "Gibson SG", "m.02m873": "Fender Stratocaster"}}, {"question": "who did joseph from the bible marry", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0197d5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0197d5 ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n}\n", "logical_form": "( JOIN ( R [ people , marriage , spouse ] ) ( JOIN ( R [ people , person , spouse s ] ) [ Joseph in Islam ] ) )", "golden_entities": {"m.0197d5": "Joseph in Islam"}, "answer_entities": {"m.02xvr8": "Asenath"}}, {"question": "what did sir john frederick william herschel do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bxzr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bxzr ns:law.inventor.inventions ?x .\n}\n", "logical_form": "( JOIN ( R [ law , inventor , inventions ] ) [ John Herschel ] )", "golden_entities": {"m.0bxzr": "John Herschel"}, "answer_entities": {"m.01m_1t": "Cyanotype", "m.03ktb0": "Photographic fixer", "m.03yvzv": "Actinometer"}}, {"question": "where did wassily kandinsky work", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0856z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0856z ns:people.person.employment_history ?y .\n?y ns:business.employment_tenure.company ?x .\n}\n", "logical_form": "( JOIN ( R [ business , employment tenure , company ] ) ( JOIN ( R [ people , person , employment history ] ) [ Wassily Kandinsky ] ) )", "golden_entities": {"m.0856z": "Wassily Kandinsky"}, "answer_entities": {"m.018cy": "Bauhaus", "m.01fy2s": "University of Tartu"}}, {"question": "when did the arab israeli war start", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012d8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012d8 ns:time.event.start_date ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , start date ] ) [ Arab\u2013Israeli conflict ] )", "golden_entities": {"m.012d8": "Arab\u2013Israeli conflict"}, "answer_entities": {"value": "1948-05-15"}}, {"question": "what all countries are in south america", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06n3y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06n3y ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ South America ] ) )", "golden_entities": {"m.06n3y": "South America", "m.01mp": "Country"}, "answer_entities": {"m.015fr": "Brazil", "m.0165v": "Bolivia", "m.016wzw": "Peru", "m.01c995": "British Guiana", "m.01ls2": "Colombia", "m.01nr2h": "Empire of Brazil", "m.02wmy": "Falkland Islands", "m.034m8": "Guyana", "m.0417l2t": "Independent Republic of Zulia", "m.05v10": "Paraguay", "m.06nnj": "Suriname", "m.07twz": "Uruguay", "m.07ylj": "Venezuela", "m.0dkz7x": "Gran Colombia", "m.0jgd": "Argentina"}}, {"question": "what ship did sir francis drake travel on", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.031t2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.031t2 ns:boats.ship_owner.ships_owned ?y .\n?y ns:boats.ship_ownership.ship ?x .\n}\n", "logical_form": "( JOIN ( R [ boats , ship ownership , ship ] ) ( JOIN ( R [ boats , ship owner , ships owned ] ) [ Francis Drake ] ) )", "golden_entities": {"m.031t2": "Francis Drake"}, "answer_entities": {"m.023rdn": "Golden Hind"}}, {"question": "what did kellie martin play on", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03kcyd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03kcyd ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Kellie Martin ] ) )", "golden_entities": {"m.03kcyd": "Kellie Martin"}, "answer_entities": {"m.012gc447": "The Christmas Ornament", "m.014d_k": "A Goofy Movie", "m.027bf_l": "Live Once, Die Twice", "m.027bvlr": "Thru the Moebius Strip", "m.02r5cqg": "On the Edge of Innocence", "m.02vvqfh": "A Friend to Die For", "m.047tgmg": "The Richest Cat in the World", "m.04cx77": "Mickey's Twice Upon a Christmas", "m.04j0kjj": "After the Silence", "m.04j0rgr": "Mystery Woman: Sing Me a Murder", "m.04j102g": "Mystery Woman: Mystery Weekend", "m.04j10hk": "Mystery Woman: Snapshot", "m.04j17yl": "All You Need", "m.0636yq": "Troop Beverly Hills", "m.06f18v": "Malibu's Most Wanted", "m.0798vws": "Vision of a Murder", "m.0798vx4": "Game Time", "m.0798vy1": "Wild West Mystery", "m.0798vyd": "Oh Baby", "m.07jy8w_": "Help Wanted: Kids", "m.07k4r92": "Body Slam", "m.088jb3": "Jumpin' Jack Flash", "m.09rsst4": "If Someone Had Known", "m.09rxxv6": "The Face on the Milk Carton", "m.0b1tsc": "Open House", "m.0b450zf": "About Sarah", "m.0b6pnpl": "Doin' Time on Planet Earth", "m.0bdpx8q": "Fiona", "m.0cm87r1": "The Jensen Project", "m.0fx7rm": "Matinee", "m.0fygr7": "The Canterville Ghost", "m.0gkmdyh": "No Brother of Mine", "m.0h_gxv2": "Hidden In Silence", "m.0h3cn4m": "Smooch", "m.0kl_dpw": "Her Hidden Truth", "m.0nb2sb7": "I Married Who?"}}, {"question": "what does united church of christ believe", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01s5nb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01s5nb ns:religion.religion.is_part_of ?x .\n}\n", "logical_form": "( JOIN ( R [ religion , religion , is part of ] ) [ United Church of Christ ] )", "golden_entities": {"m.01s5nb": "United Church of Christ"}, "answer_entities": {"m.01lp8": "Christianity"}}, {"question": "where is walton goggins from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07qyl3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07qyl3 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Walton Goggins ] )", "golden_entities": {"m.07qyl3": "Walton Goggins"}, "answer_entities": {"m.0lphb": "Birmingham"}}, {"question": "which province is calgary canada in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r32)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r32 ns:base.biblioness.bibs_location.state ?x .\n}\n", "logical_form": "( JOIN ( R [ base , biblioness , bibs location , state ] ) [ Calgary ] )", "golden_entities": {"m.01r32": "Calgary"}, "answer_entities": {"m.0j95": "Alberta"}}, {"question": "who is aidan quinn", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045c66)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.045c66 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Aidan Quinn ] )", "golden_entities": {"m.045c66": "Aidan Quinn"}, "answer_entities": {"m.02hrh1q": "Actor"}}, {"question": "what do people from guam speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034tl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034tl ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Guam ] )", "golden_entities": {"m.034tl": "Guam"}, "answer_entities": {"m.01vky1": "Chamorro Language", "m.02h40lc": "English Language"}}, {"question": "what timezone is virginia in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07z1m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07z1m ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Virginia ] )", "golden_entities": {"m.07z1m": "Virginia"}, "answer_entities": {"m.02_37z": "UTC\u221205:00", "m.02hcv8": "Eastern Time Zone"}}, {"question": "what is the dominican republic part of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027rn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027rn ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Dominican Republic ] )", "golden_entities": {"m.027rn": "Dominican Republic"}, "answer_entities": {"m.01rll_": "Greater Antilles", "m.04pnx": "Latin America", "m.059g4": "North America", "m.07c5l": "Americas", "m.0jsr7mh": "Pa\u00eds"}}, {"question": "where did jerry spinelli live as a kid", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05djw1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05djw1 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Jerry Spinelli ] )", "golden_entities": {"m.05djw1": "Jerry Spinelli"}, "answer_entities": {"m.0_75d": "Norristown"}}]