[{"question": "what is the rainforest in peru called", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016wzw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016wzw ns:location.location.partially_contains ?x .\n?x ns:common.topic.notable_types ns:m.01nt .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Region ] ) ( JOIN ( R [ location , location , partially contains ] ) [ Peru ] ) )", "golden_entities": {"m.016wzw": "Peru", "m.01nt": "Region"}, "answer_entities": {"m.0cx4p": "Amazon rainforest"}}, {"question": "where is mount jefferson located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0238w8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0238w8 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Mount Jefferson ] )", "golden_entities": {"m.0238w8": "Mount Jefferson"}, "answer_entities": {"m.027lsyc": "Cascade Volcanoes", "m.059g4": "North America", "m.05kj_": "Oregon", "m.09c7w0": "United States of America", "m.0k3nk": "Cascade Range"}}, {"question": "which airport is closest to the city of chicago", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_d4 ns:location.location.nearby_airports ?x .\n?x ns:location.location.containedby ns:m.01_d4 .\n}\n", "logical_form": "( AND ( JOIN [ location , location , containedby ] [ Chicago ] ) ( JOIN ( R [ location , location , nearby airports ] ) [ Chicago ] ) )", "golden_entities": {"m.01_d4": "Chicago"}, "answer_entities": {"m.01ky66": "O'Hare International Airport", "m.01l1jx": "Chicago Midway International Airport"}}, {"question": "what movies did adam sandler play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pz91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pz91 ns:film.producer.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , producer , film ] ) [ Adam Sandler ] )", "golden_entities": {"m.0pz91": "Adam Sandler"}, "answer_entities": {"m.010fch95": "Paul Blart: Mall Cop 2", "m.010rdrd1": "Pixels", "m.02m7tn": "Eight Crazy Nights", "m.02ph9tm": "You Don't Mess with the Zohan", "m.02qdrjx": "Bedtime Stories", "m.02ql1gl": "Joe Dirt 2: Beautiful Loser", "m.03why2r": "Paul Blart: Mall Cop", "m.0408m53": "The House Bunny", "m.0640m69": "Grown Ups", "m.074w86": "Deuce Bigalow: European Gigolo", "m.07kb7vh": "Zookeeper", "m.07x6zk": "Dickie Roberts: Former Child Star", "m.07zsmk": "The Benchwarmers", "m.087pfc": "Click", "m.0b6f8pf": "Bucky Larson: Born to Be a Star", "m.0bshwmp": "Just Go With It", "m.0ch3qr1": "Jack and Jill", "m.0f2sx4": "I Now Pronounce You Chuck and Larry", "m.0gwgn1k": "That's My Boy", "m.0mzt5cs": "Grown Ups 2", "m.0v_ckgv": "Blended", "m.0w26rky": "Valet Guys"}}, {"question": "where is washington d.c. at", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rh6k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rh6k ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01nt .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Region ] ) ( JOIN ( R [ location , location , containedby ] ) [ Washington, D.C. ] ) )", "golden_entities": {"m.0rh6k": "Washington, D.C.", "m.01nt": "Region"}, "answer_entities": {"m.018v5k": "Mid-Atlantic states", "m.03ph5j": "South Atlantic States"}}, {"question": "when did aldi originate", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0246n2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0246n2 ns:organization.organization.place_founded ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , place founded ] ) [ ALDI ] )", "golden_entities": {"m.0246n2": "ALDI"}, "answer_entities": {"m.017gry": "Essen"}}, {"question": "who created microsoft windows", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04r_8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04r_8 ns:computer.software.developer ?x .\n}\n", "logical_form": "( JOIN ( R [ computer , software , developer ] ) [ Microsoft Windows ] )", "golden_entities": {"m.04r_8": "Microsoft Windows"}, "answer_entities": {"m.04sv4": "Microsoft Corporation"}}, {"question": "what is john steinbeck best known for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04107)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04107 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ John Steinbeck ] )", "golden_entities": {"m.04107": "John Steinbeck"}, "answer_entities": {"m.02xhgwq": "Novelist", "m.0cbd2": "Writer", "m.0d8qb": "Journalist", "m.0dxtg": "Screenwriter"}}, {"question": "who nominated anthony kennedy", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019s7r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019s7r ns:people.appointee.position ?y .\n?y ns:people.appointment.appointed_by ?x .\n}\n", "logical_form": "( JOIN ( R [ people , appointment , appointed by ] ) ( JOIN ( R [ people , appointee , position ] ) [ Anthony Kennedy ] ) )", "golden_entities": {"m.019s7r": "Anthony Kennedy"}, "answer_entities": {"m.06c0j": "Ronald Reagan"}}, {"question": "where the french language come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.064_8sq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.064_8sq ns:base.rosetta.languoid.parent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , rosetta , languoid , parent ] ) [ French ] )", "golden_entities": {"m.064_8sq": "French"}, "answer_entities": {"m.05tkbx2": "French Group"}}, {"question": "what movie does natalie portman play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09l3p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09l3p ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Natalie Portman ] ) )", "golden_entities": {"m.09l3p": "Natalie Portman"}, "answer_entities": {"m.0_z9qv6": "Illusions & Mirrors", "m.0134d9mx": "A Tale of Love and Darkness", "m.01shy7": "Zoolander", "m.02cbhg": "Cold Mountain", "m.02pw_n": "Garden State", "m.02v_87f": "The Weathered Underground", "m.02z3r8t": "New York, I Love You", "m.02z59y_": "Hotel Chevalier", "m.03h0byn": "Brothers", "m.04cj79": "Closer", "m.04q5g": "L\u00e9on: The Professional", "m.05f7jsw": "Love and Other Impossible Pursuits", "m.062zjtt": "Thor", "m.0645k5": "V for Vendetta", "m.06z3xb": "Free Zone", "m.07kg878": "Your Highness", "m.08yjvl": "Goya's Ghosts", "m.09k56b7": "Black Swan", "m.09lxv9": "Mars Attacks!", "m.0b6d3kn": "Hesher", "m.0b79_ft": "True", "m.0blmy": "Developing", "m.0bln8": "Beautiful Girls", "m.0blp1": "Anywhere but Here", "m.0blpg": "Everyone Says I Love You", "m.0bxsk": "Heat", "m.0bz3jx": "Paris, je t'aime", "m.0c2pz3": "Mr. Magorium's Wonder Emporium", "m.0c2wy": "Where the Heart Is", "m.0clsl7": "My Blueberry Nights", "m.0cn7nb": "The Armenian Genocide", "m.0ddt_": "Star Wars Episode I: The Phantom Menace", "m.0dfw0": "Star Wars Episode II: Attack of the Clones", "m.0dlkhvv": "No Strings Attached", "m.0fdv3": "Star Wars Episode III: Revenge of the Sith", "m.0fy9wm": "The Darjeeling Limited", "m.0gyy53": "The Other Boleyn Girl", "m.0hypmnr": "Knight of Cups", "m.0j9knfv": "Thor: The Dark World", "m.0nfnhrv": "Jane Got a Gun", "m.0nh4bl2": "Weightless", "m.0nh4bnn": "In the Garden of Beasts", "m.0w9hhc4": "GREED, a New Fragrance by Francesco Vezzoli"}}, {"question": "who is the head coach of the new orleans saints", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g3v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g3v ns:american_football.football_team.current_head_coach ?x .\n}\n", "logical_form": "( JOIN ( R [ american football , football team , current head coach ] ) [ New Orleans Saints ] )", "golden_entities": {"m.05g3v": "New Orleans Saints"}, "answer_entities": {"m.09z95c": "Sean Payton"}}, {"question": "where does the shannon river flow", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04yg368)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04yg368 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Shannon River ] )", "golden_entities": {"m.04yg368": "Shannon River"}, "answer_entities": {"m.0847q": "Western Australia"}}, {"question": "what movies does zac efron star in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06wm0z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06wm0z ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Zac Efron ] ) )", "golden_entities": {"m.06wm0z": "Zac Efron"}, "answer_entities": {"g.11b6v7j7y9": "Mike and Dave Need Wedding Dates", "m.011w_f4w": "We Are Your Friends", "m.012gbh3x": "Dirty Grandpa", "m.0286_hv": "High School Musical 3: Senior Year", "m.02q2plk": "Melinda's World", "m.03d79mp": "17 Again", "m.047bynf": "Me and Orson Welles", "m.07k7h19": "Charlie St. Cloud", "m.087wc7n": "The Lorax", "m.09dv8h": "High School Musical", "m.0bc5ny": "High School Musical 2", "m.0bt3j9": "Hairspray", "m.0fphf3v": "New Year's Eve", "m.0g55yqj": "Robot Chicken: Star Wars Episode III", "m.0gpnn7": "If You Lived Here, You'd Be Home Now", "m.0gpntg": "The Derby Stallion", "m.0gpp1g": "Miracle Run", "m.0gx938d": "The Paperboy", "m.0h1j5fv": "Liberal Arts", "m.0hgky8t": "The Lucky One", "m.0kfzhzd": "At Any Price", "m.0ng09tf": "The Big Wide World of Carl Laemke", "m.0ng0d9f": "That Awkward Moment", "m.0ng0dbq": "Neighbors", "m.0qfrrg8": "Parkland", "m.0w1wb91": "Autobahn"}}, {"question": "where is puerto galera", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pn1_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pn1_ ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Puerto Galera, Oriental Mindoro ] )", "golden_entities": {"m.01pn1_": "Puerto Galera, Oriental Mindoro"}, "answer_entities": {"m.01mw7c": "Oriental Mindoro", "m.05v8c": "Philippines"}}, {"question": "what currency does hungary have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gj2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gj2 ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Hungary ] )", "golden_entities": {"m.03gj2": "Hungary"}, "answer_entities": {"m.01hfll": "Hungarian forint"}}, {"question": "what to do and see in miami florida", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f2v0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f2v0 ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Miami ] )", "golden_entities": {"m.0f2v0": "Miami"}, "answer_entities": {"m.027mkgm": "Holocaust Memorial of the Greater Miami Jewish Federation", "m.02pysdq": "Frost Art Museum", "m.02qgngm": "Jewish Museum of Florida", "m.02vklws": "Jungle Island", "m.02wc4x5": "P\u00e9rez Art Museum Miami", "m.02y8b8": "Coral Castle", "m.03ykj__": "Lowe Art Museum", "m.04f683m": "Bass Museum of Art", "m.050n1m": "Villa Vizcaya", "m.05rx5g": "Venetian Pool", "m.06kf8d": "Wolfsonian-FIU", "m.0973y_": "Miami Seaquarium", "m.09v47qw": "Tower Theater", "m.0cmdy7y": "Black Point Marina", "m.0lf_c4d": "Bayfront Park"}}, {"question": "what movies did chris farley do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012801)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012801 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Chris Farley ] ) )", "golden_entities": {"m.012801": "Chris Farley"}, "answer_entities": {"m.01342x": "Wayne's World 2", "m.02q3pj": "Dirty Work", "m.036z1n": "Billy Madison", "m.03dxs5": "Tommy Boy", "m.03qfpk": "Airheads", "m.040mt6": "Black Sheep", "m.05fkxp": "Almost Heroes", "m.05yxmk": "Coneheads", "m.08vw2f": "Beverly Hills Ninja", "m.0kbwb": "Wayne's World"}}, {"question": "where george washington carver go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03djm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03djm ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ George Washington Carver ] ) )", "golden_entities": {"m.03djm": "George Washington Carver"}, "answer_entities": {"m.01xssh": "Simpson College", "m.03v6t": "Iowa State University", "m.076fk5z": "Minneapolis High School"}}, {"question": "where was the earthquake in christchurch", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gg9kfr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gg9kfr ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ 2011 Christchurch earthquake ] )", "golden_entities": {"m.0gg9kfr": "2011 Christchurch earthquake"}, "answer_entities": {"m.02yc5b": "Christchurch"}}, {"question": "what timezone is reno nv", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06kx2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06kx2 ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Reno ] )", "golden_entities": {"m.06kx2": "Reno"}, "answer_entities": {"m.02lcqs": "Pacific Time Zone"}}, {"question": "who was niccolo machiavelli influenced by", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05cvs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05cvs ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Niccol\u00f2 Machiavelli ] )", "golden_entities": {"m.05cvs": "Niccol\u00f2 Machiavelli"}, "answer_entities": {"m.01tf5": "Cicero", "m.028p0": "Dante Alighieri", "m.02rpq": "Desiderius Erasmus", "m.04l7h": "Livy", "m.04lg6": "Leonardo da Vinci", "m.05qmj": "Plato", "m.063_9": "Plutarch", "m.07lbh": "Thucydides", "m.0gz_": "Aristotle", "m.0pzhh": "Tacitus"}}, {"question": "what did cam newton do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02phnp7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02phnp7 ns:american_football.football_player.position_s ?x .\n}\n", "logical_form": "( JOIN ( R [ american football , football player , position s ] ) [ Cam Newton ] )", "golden_entities": {"m.02phnp7": "Cam Newton"}, "answer_entities": {"m.06b1q": "Quarterback"}}, {"question": "what continent does the bahamas belong to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0160w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0160w ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Bahamas ] )", "golden_entities": {"m.0160w": "Bahamas"}, "answer_entities": {"m.059g4": "North America"}}, {"question": "where is baybrook mall", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02r0gfd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02r0gfd ns:business.shopping_center.address ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ business , shopping center , address ] ) [ Baybrook Mall ] ) )", "golden_entities": {"m.02r0gfd": "Baybrook Mall"}, "answer_entities": {"m.013mr0": "Friendswood", "m.03l2n": "Houston"}}, {"question": "where is bob marley from where was he born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bkf4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bkf4 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Bob Marley ] )", "golden_entities": {"m.0bkf4": "Bob Marley"}, "answer_entities": {"m.04zvqpz": "Nine Mile"}}, {"question": "where does roman abramovich live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01zl71)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01zl71 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Roman Abramovich ] ) )", "golden_entities": {"m.01zl71": "Roman Abramovich"}, "answer_entities": {"m.036wcg": "Ukhta", "m.04swd": "Moscow"}}, {"question": "what did neil say on the moon", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05b6w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05b6w ns:people.person.quotations ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , quotations ] ) [ Neil Armstrong ] )", "golden_entities": {"m.05b6w": "Neil Armstrong"}, "answer_entities": {"m.06gj5j3": "That's one small step for man, one giant leap for mankind."}}, {"question": "who played carlton banks", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bdz91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bdz91 ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Carlton Banks ] ) )", "golden_entities": {"m.0bdz91": "Carlton Banks"}, "answer_entities": {"m.05_6vk": "Alfonso Ribeiro"}}, {"question": "what books did emily dickinson wrote", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01509d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01509d ns:book.author.works_written ?x .\n}\n", "logical_form": "( JOIN ( R [ book , author , works written ] ) [ Emily Dickinson ] )", "golden_entities": {"m.01509d": "Emily Dickinson"}, "answer_entities": {"m.043k2cw": "I taste a liquor never brewed", "m.04yjf53": "\\\"Hope\\\" is the thing with feathers", "m.05qf2j2": "Acts of Light: The World of Emily Dickinson", "m.0bqr3k0": "The complete poems", "m.0bqr3k4": "The letters", "m.0bqr3k9": "Poems", "m.0bqr3kj": "Success", "m.0bqr3km": "Two poems", "m.0cr7_cw": "Emily Dickinson's open folios", "m.0cr808m": "The letters of Emily Dickinson 1845-1886", "m.0cr818f": "Selected poetry of Emily Dickinson", "m.0cr82lv": "The selected poems of Emily Dickinson", "m.0cr82xy": "Final harvest", "m.0cr83_x": "Emily Dickinson's herbarium", "m.0cr837d": "Letters of Emily Dickinson", "m.0cr84sr": "The life and letters of Emily Dickinson", "m.0cr86js": "Unpublished poems of Emily Dickinson", "m.0cr877f": "Selected poems", "m.0cr898q": "Further poems of Emily Dickinson withheld from publication by her sister Lavinia", "m.0cr89wm": "Bolts of melody", "m.0cr8bhj": "14 by Emily Dickinson, with selected criticism", "m.0cr8cty": "Sampler", "m.0cr8d46": "New poems of Emily Dickinson", "m.0cr8dz3": "Selected letters", "m.0cr8pxd": "Letters to Dr. and Mrs. Josiah Gilbert Holland", "m.0cr8sf0": "Poems, 1890-1896"}}, {"question": "what hotel should i stay in san francisco", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d6lp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d6lp ns:travel.travel_destination.accommodation ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , accommodation ] ) [ San Francisco ] )", "golden_entities": {"m.0d6lp": "San Francisco"}, "answer_entities": {"m.0283jp6": "W San Francisco", "m.03ywbh3": "Hostelling International, City Center", "m.0c9ldc": "Palace Hotel, San Francisco", "m.0f241m": "Clift"}}, {"question": "who created youtube", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09jcvs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09jcvs ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ YouTube ] )", "golden_entities": {"m.09jcvs": "YouTube"}, "answer_entities": {"m.0d36_b": "Steve Chen", "m.0fzxjm": "Jawed Karim", "m.0fzxmd": "Chad Hurley"}}, {"question": "what to do in hong kong for a week", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03h64)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03h64 ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Hong Kong ] )", "golden_entities": {"m.03h64": "Hong Kong"}, "answer_entities": {"m.0180rz": "Lamma Island", "m.018nzh": "Lantau Island", "m.01njfs": "Victoria Peak", "m.01npzc": "Kowloon Walled City", "m.022zvr": "Hong Kong Disneyland", "m.0232xn": "Victoria Park, Hong Kong", "m.027yh84": "Ten Thousand Buddhas Monastery", "m.02gwnd": "Hong Kong Museum of Art", "m.02hsyf": "Hong Kong Wetland Park", "m.05g4mc": "Po Lin Monastery", "m.097j91": "Clock Tower, Hong Kong", "m.0d6mp7": "Dr Sun Yat-sen Museum", "m.0vxf600": "Hotel Indigo Hong Kong Island"}}, {"question": "what influenced andy warhol 's work", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kc6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kc6 ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Andy Warhol ] )", "golden_entities": {"m.0kc6": "Andy Warhol"}, "answer_entities": {"m.014dq7": "Truman Capote", "m.017b13": "Frank Stella", "m.01sj_s": "Robert Rauschenberg", "m.024hjy": "Tom of Finland", "m.028xw4": "Ben Shahn", "m.041st": "Jean-Michel Basquiat", "m.07kwmh": "Jack Smith", "m.0bqch": "Marcel Duchamp", "m.0gcjf": "Jasper Johns", "m.0gskj": "Man Ray", "m.0hgqq": "John Cage"}}, {"question": "what is fresno state 's zip code", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0mzy7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0mzy7 ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ Fresno ] )", "golden_entities": {"m.0mzy7": "Fresno"}, "answer_entities": {"m.01zds_5": "93710", "m.01zdssx": "93728", "m.01zdsvs": "93711", "m.01zdsx_": "93726", "m.01zdsyv": "93704", "m.01zdt01": "93720", "m.01zdtcs": "93721", "m.01zdvcv": "93727", "m.01zdvwj": "93703", "m.01zdvxn": "93702", "m.01zdww4": "93650", "m.01zphxf": "93701", "m.03dnj5m": "93705", "m.03dnj60": "93706", "m.03dnj75": "93722", "m.03dnj7l": "93725", "m.07nq0fh": "93888", "m.07nq0fq": "93844", "m.07nq0fy": "93794", "m.07nq0g4": "93793", "m.07nq0gc": "93792", "m.07nq0gl": "93791", "m.07nq0gt": "93790", "m.07nq0h0": "93786", "m.07nq0h7": "93784", "m.07nq0hg": "93780", "m.07nq0hp": "93779", "m.07nq0hx": "93778", "m.07nq0j_": "93773", "m.07nq0j3": "93777", "m.07nq0jb": "93776", "m.07nq0jk": "93775", "m.07nq0js": "93774", "m.07nq0k6": "93772", "m.07nq0kf": "93771", "m.07nq0kn": "93765", "m.07nq0kw": "93764", "m.07nq0l2": "93761", "m.07nq0l9": "93760", "m.07nq0lj": "93755", "m.07nq0lr": "93750", "m.07nq0lz": "93747", "m.07nq0m5": "93745", "m.07nq0md": "93744", "m.07nq0mm": "93741", "m.07nq0mv": "93740", "m.07nq0n1": "93730", "m.07nq0n8": "93729", "m.07nq0nh": "93724", "m.07nq0nq": "93723", "m.07nq0ny": "93718", "m.07nq0p4": "93717", "m.07nq0pc": "93716", "m.07nq0pl": "93715", "m.07nq0pt": "93714", "m.07nq0q0": "93712", "m.07nq0q7": "93709", "m.07nq0qg": "93708", "m.07nq0qp": "93707", "m.09sbm5w": "93720-0329"}}, {"question": "what does icelandic sound like", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01gmkg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01gmkg ns:language.human_language.language_family ?x .\n}\n", "logical_form": "( JOIN ( R [ language , human language , language family ] ) [ Icelandic Language ] )", "golden_entities": {"m.01gmkg": "Icelandic Language"}, "answer_entities": {"m.0140kd": "North Germanic languages", "m.03489": "Germanic languages", "m.03v09": "Indo-European languages"}}, {"question": "where does bill richardson live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.020z31)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.020z31 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Bill Richardson ] ) )", "golden_entities": {"m.020z31": "Bill Richardson"}, "answer_entities": {"m.02vs37k": "New Mexico Governor's Mansion", "m.04sqj": "Mexico City", "m.05fjy": "New Mexico"}}, {"question": "what did the habsburg family control", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03lht)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03lht ns:people.family.country ?x .\n}\n", "logical_form": "( JOIN ( R [ people , family , country ] ) [ House of Habsburg ] )", "golden_entities": {"m.03lht": "House of Habsburg"}, "answer_entities": {"m.016jz3": "Kingdom of Ireland", "m.01m41_": "Kingdom of Naples", "m.01pj7": "Croatia", "m.024pcx": "Kingdom of England", "m.0285m87": "Kingdom of Portugal", "m.02zqdb": "Kingdom of Sicily", "m.03b79": "German Empire", "m.03gk2": "Holy Roman Empire", "m.03l5m1": "Kingdom of Hungary", "m.0410vqb": "Kingdom of Bohemia", "m.06t8v": "Slovenia", "m.0h7x": "Austria"}}, {"question": "what is beyonce 's daughters name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mpq7s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mpq7s ns:people.person.children ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , children ] ) [ Beyonc\u00e9 Knowles ] )", "golden_entities": {"m.01mpq7s": "Beyonc\u00e9 Knowles"}, "answer_entities": {"m.0hvsrmc": "Blue Ivy"}}, {"question": "what songs has madonna written", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vs_v8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vs_v8 ns:music.composer.compositions ?x .\n}\n", "logical_form": "( JOIN ( R [ music , composer , compositions ] ) [ Madonna ] )", "golden_entities": {"m.01vs_v8": "Madonna"}, "answer_entities": {"m.0_5ydb_": "Be Careful (Cuidado con mi coraz\u00f3n)", "m.0_j8v05": "Forbidden Love", "m.010tff4l": "TRUE BLUE", "m.012z6s95": "Ghosttown", "m.01393j4h": "\u30e9\u30fb\u30a4\u30b9\u30e9\u30fb\u30dc\u30cb\u30fc\u30bf", "m.01xflf": "Who's That Girl", "m.02pvkh": "Justify My Love", "m.02qcfc": "Papa Don't Preach", "m.02r5nrz": "Hey You", "m.02vkl5r": "Future Lovers", "m.02w987t": "Future Lovers/I Feel Love", "m.033y4j": "Don't Tell Me", "m.03fz6jj": "Causing a Commotion", "m.06xvsx": "Music", "m.06y4yk": "Die Another Day", "m.06yl_8": "Beautiful Stranger", "m.0713sh": "Holiday", "m.07mhlf": "Live to Tell", "m.07xl0b": "La Isla Bonita", "m.07xl1r": "Like a Prayer", "m.07z9x2": "Vogue", "m.0870k6": "Take a Bow", "m.08hrck": "Express Yourself", "m.08s72z": "I'll Remember", "m.09x_72": "This Used to Be My Playground", "m.0bb858p": "4 Minutes", "m.0bx70v": "Sidewalk Talk", "m.0fq34rt": "Who's That Chick?", "m.0hnk8cb": "Masterpiece", "m.0hr9mfd": "Give Me All Your Luvin'", "m.0j3h03b": "Girl Gone Wild", "m.0j9lvrg": "Gang Bang", "m.0l10n6": "Love Won't Wait", "m.0wxx9kk": "Possessive Love"}}, {"question": "where did pope benedict xvi live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09wpt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09wpt ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Pope Benedict XVI ] ) )", "golden_entities": {"m.09wpt": "Pope Benedict XVI"}, "answer_entities": {"m.017v_": "Bavaria"}}, {"question": "where is tommy emmanuel from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.064t69)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.064t69 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Tommy Emmanuel ] )", "golden_entities": {"m.064t69": "Tommy Emmanuel"}, "answer_entities": {"m.04c1fr": "Muswellbrook"}}]