[{"question": "what character did natalie portman play in star wars", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09l3p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09l3p ns:film.actor.film ?y .\n?y ns:film.performance.character ?x .\n?y ns:film.performance.film ns:m.0ddt_ .\n}\n", "logical_form": "( JOIN ( R [ film , performance , character ] ) ( AND ( JOIN [ film , performance , film ] [ Star Wars Episode I: The Phantom Menace ] ) ( JOIN ( R [ film , actor , film ] ) [ Natalie Portman ] ) ) )", "golden_entities": {"m.09l3p": "Natalie Portman", "m.0ddt_": "Star Wars Episode I: The Phantom Menace"}, "answer_entities": {"m.0drf_": "Padm\u00e9 Amidala"}}, {"question": "what kind of money to take to bahamas", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0160w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0160w ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Bahamas ] )", "golden_entities": {"m.0160w": "Bahamas"}, "answer_entities": {"m.01l6dm": "Bahamian dollar"}}, {"question": "where are the nfl redskins from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.084l5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.084l5 ns:sports.sports_team.location ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , location ] ) [ Washington Redskins ] )", "golden_entities": {"m.084l5": "Washington Redskins"}, "answer_entities": {"m.0rh6k": "Washington, D.C."}}, {"question": "where did saki live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07484)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07484 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Saki ] )", "golden_entities": {"m.07484": "Saki"}, "answer_entities": {"m.05ql8_": "Sittwe"}}, {"question": "how old is sacha baron cohen", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c9c0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c9c0 ns:people.person.date_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , date of birth ] ) [ Sacha Baron Cohen ] )", "golden_entities": {"m.0c9c0": "Sacha Baron Cohen"}, "answer_entities": {"value": "1971-10-13"}}, {"question": "what time zone am i in cleveland ohio", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01sn3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01sn3 ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Cleveland ] )", "golden_entities": {"m.01sn3": "Cleveland"}, "answer_entities": {"m.02hcv8": "Eastern Time Zone"}}, {"question": "where is rome italy located on a map", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c62)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c62 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Rome ] )", "golden_entities": {"m.06c62": "Rome"}, "answer_entities": {"m.03rjj": "Italy", "m.04q_g": "Lazio", "m.098phg": "Province of Rome"}}, {"question": "what is nina dobrev nationality", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027nwk2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027nwk2 ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Nina Dobrev ] )", "golden_entities": {"m.027nwk2": "Nina Dobrev"}, "answer_entities": {"m.015qh": "Bulgaria", "m.0d060g": "Canada"}}, {"question": "what to see near sedona arizona", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ny57)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ny57 ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Sedona ] )", "golden_entities": {"m.0ny57": "Sedona"}, "answer_entities": {"m.026h8t6": "Sycamore Canyon", "m.02qswpp": "Sedona International Film Festival", "m.02ty7n": "Sedona Airport", "m.04crz42": "Bell Rock", "m.04xgf_s": "Seven Canyons", "m.07k8z2": "Chapel of the Holy Cross", "m.0dlm2c7": "Red Rock State Park", "m.0dqzqc": "Slide Rock State Park", "m.0f44c_": "Oak Creek Canyon", "m.0g5qfch": "Honanki", "m.0gj9fwx": "Cathedral Rock"}}, {"question": "what form of government does russia have today", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bnz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bnz ns:location.country.form_of_government ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , form of government ] ) [ Russia ] )", "golden_entities": {"m.06bnz": "Russia"}, "answer_entities": {"m.01dw03": "Semi-presidential system", "m.0c9rw5": "Constitutional republic", "m.0j729": "Federal republic"}}, {"question": "who was ishmael 's mom", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ghr4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ghr4 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , parents ] ) [ Ishmael ] ) )", "golden_entities": {"m.01ghr4": "Ishmael", "m.02zsn": "Female"}, "answer_entities": {"m.01sq9c": "Hagar"}}, {"question": "what was malcolm x trying to accomplish", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03f2h01)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03f2h01 ns:base.activism.activist.area_of_activism ?x .\n}\n", "logical_form": "( JOIN ( R [ base , activism , activist , area of activism ] ) [ Malcolm X ] )", "golden_entities": {"m.03f2h01": "Malcolm X"}, "answer_entities": {"m.074v_1j": "Black Liberation", "m.0g4pf68": "African Americans' rights"}}, {"question": "where are the netherlands on a world map", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059j2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059j2 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Netherlands ] )", "golden_entities": {"m.059j2": "Netherlands"}, "answer_entities": {"m.049nq": "Kingdom of the Netherlands"}}, {"question": "what are the major cities in france", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f8l9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f8l9c ns:location.country.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , capital ] ) [ France ] )", "golden_entities": {"m.0f8l9c": "France"}, "answer_entities": {"m.05qtj": "Paris"}}, {"question": "what city did esther live in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pn7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pn7 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Esther ] )", "golden_entities": {"m.02pn7": "Esther"}, "answer_entities": {"m.0gf0n": "Susa"}}, {"question": "what is saint nicholas known for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f9q7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f9q7 ns:book.book_subject.works ?x .\n}\n", "logical_form": "( JOIN ( R [ book , book subject , works ] ) [ Saint Nicholas ] )", "golden_entities": {"m.0f9q7": "Saint Nicholas"}, "answer_entities": {"m.066mx9f": "St. Nicholas of Myra, Bari and Manhattan: Biography of a Legend"}}, {"question": "what is cher 's son 's name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vtj38)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vtj38 ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , children ] ) [ Cher ] ) )", "golden_entities": {"m.01vtj38": "Cher", "m.05zppz": "Male"}, "answer_entities": {"m.01w4bt1": "Elijah Blue Allman", "m.0br66": "Chaz Bono"}}, {"question": "what party was andrew jackson", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rlz ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n", "logical_form": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Andrew Jackson ] ) )", "golden_entities": {"m.0rlz": "Andrew Jackson"}, "answer_entities": {"m.020lwv": "Jacksonian Democratic Party", "m.07wf9": "Democratic-Republican Party", "m.0d075m": "Democratic Party"}}, {"question": "what county is the city of hampton va in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0mnsf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0mnsf ns:location.hud_county_place.place ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , place ] ) [ Hampton ] )", "golden_entities": {"m.0mnsf": "Hampton"}, "answer_entities": {}}, {"question": "what county is heathrow airport in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jn4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jn4 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01n7 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Location ] ) ( JOIN ( R [ location , location , containedby ] ) [ London Heathrow Airport ] ) )", "golden_entities": {"m.03jn4": "London Heathrow Airport", "m.01n7": "Location"}, "answer_entities": {"m.04pxy3": "Hillingdon"}}, {"question": "what year did william jennings bryan run for president", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b3tf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b3tf ns:base.politicalconventions.presidential_nominee.nominated_at ?x .\n}\n", "logical_form": "( JOIN ( R [ base , politicalconventions , presidential nominee , nominated at ] ) [ William Jennings Bryan ] )", "golden_entities": {"m.0b3tf": "William Jennings Bryan"}, "answer_entities": {"m.0b4pfj": "1896 Democratic National Convention", "m.0dv63j": "1908 Democratic National Convention", "m.0fr77c": "1900 Democratic National Convention"}}, {"question": "what was the name of frederick douglass book", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02zg0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02zg0 ns:book.author.works_written ?x .\n?x ns:common.topic.notable_types ns:m.01xryvm .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Book ] ) ( JOIN ( R [ book , author , works written ] ) [ Frederick Douglass ] ) )", "golden_entities": {"m.02zg0": "Frederick Douglass", "m.01xryvm": "Book"}, "answer_entities": {"m.03c5dpz": "The Heroic Slave", "m.03clq8t": "Life and Times of Frederick Douglass", "m.04kh2k": "Narrative of the Life of Frederick Douglass, an American Slave", "m.067mzxk": "Escape from slavery", "m.067x2lp": "My Bondage and My Freedom", "m.068c5tc": "Words of Ages", "m.068jkrg": "Standing with the slave", "m.0697p24": "The mind and heart of Frederick Douglass", "m.06bq6w2": "A Black diplomat in Haiti", "m.06c1dmk": "Three African-American Classics", "m.06fr4s7": "Life & Times of Frederick Douglas", "m.06jjj7m": "The Life of an American Slave", "m.06kf95n": "The claims of the Negro, ethnologically considered", "m.06ktxh7": "Collected Articles Of Frederick Douglass", "m.06kvgsm": "The Education of Frederick Douglass", "m.06kxqpj": "Negroes and the national war effort", "m.06m91zr": "Frederick Douglass", "m.06mj8s0": "The race problem", "m.06mkpqq": "Why Is the Negro Lynched", "m.06mkz59": "Abolition fanaticism in New York", "m.06mz4m1": "U.S. Grant and the colored people", "m.06p5ykp": "Thoughts for all time", "m.06r6hzr": "Why I Became A Woman's Rights Man", "m.06ry31_": "The Oxford Frederick Douglass reader", "m.06twn1l": "Two Slave Rebellions at Sea", "m.06tws33": "Vida de Un Esclavo Americano", "m.06ty1ql": "A Chinese Girl Graduate", "m.06vbs0d": "From slave to statesman", "m.0c1t2v2": "The narrative and selected writings", "m.0fpb93x": "The Frederick Douglass Papers, Series 1, Vol. 1: 1841-46", "m.0fpb946": "The Frederick Douglass Papers, Series 2, Vol. 1: Narrative", "m.0y50n2g": "The Frederick Douglass Papers, Series 1, Vol. 2: 1847-54", "m.0y50n39": "The Frederick Douglass Papers, Series 1, Vol. 3: 1855-63", "m.0y50n4h": "The Frederick Douglass Papers, Series 1, Vol. 4: 1864-80", "m.0y50n7t": "The Frederick Douglass Papers, Series 1, Vol. 5: 1881-95", "m.0y50ngp": "The Frederick Douglass Papers, Series 2, Vol. 2: Bondage and Freedom", "m.0y50njy": "The Frederick Douglass Papers, Series 2, Vol. 3: Life and Times", "m.0y50nxt": "The Frederick Douglass Papers, Series 3, Vol. 1: 1842-1852"}}, {"question": "who was queen victoria 's parents called", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cw10)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cw10 ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ Queen Victoria ] )", "golden_entities": {"m.0cw10": "Queen Victoria"}, "answer_entities": {"m.01c50q": "Prince Edward, Duke of Kent and Strathearn", "m.024hvp": "Princess Victoria of Saxe-Coburg-Saalfeld"}}, {"question": "what countries do people speak portuguese", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05zjd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05zjd ns:language.human_language.countries_spoken_in ?x .\n}\n", "logical_form": "( JOIN ( R [ language , human language , countries spoken in ] ) [ Portuguese Language ] )", "golden_entities": {"m.05zjd": "Portuguese Language"}, "answer_entities": {"m.015fr": "Brazil", "m.01nqj": "Cape Verde", "m.02kcz": "Equatorial Guinea", "m.02lx0": "Timor-Leste", "m.034m8": "Guyana", "m.036b_": "Guinea-Bissau", "m.04thp": "Macau", "m.04wlh": "Mozambique", "m.05r4w": "Portugal", "m.0d05w3": "China", "m.0d060g": "Canada", "m.0hg5": "Andorra", "m.0hzlz": "South Africa", "m.0j4b": "Angola"}}, {"question": "what are the names of walt disney kids", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081nh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081nh ns:people.person.children ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , children ] ) [ Walt Disney ] )", "golden_entities": {"m.081nh": "Walt Disney"}, "answer_entities": {"m.064ndq": "Diane Disney Miller", "m.07kyh5": "Sharon Mae Disney"}}, {"question": "who is in the band bush", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01727v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01727v ns:music.musical_group.member ?y .\n?y ns:music.group_membership.member ?x .\n}\n", "logical_form": "( JOIN ( R [ music , group membership , member ] ) ( JOIN ( R [ music , musical group , member ] ) [ Bush ] ) )", "golden_entities": {"m.01727v": "Bush"}, "answer_entities": {"m.014qv7": "Gavin Rossdale", "m.01vs4sv": "Robin Goodridge", "m.01vs4t_": "Chris Traynor", "m.01vs4vw": "Nigel Pulsford", "m.01wrrdk": "Spencer Cobrin", "m.03d_qbn": "Dave Parsons", "m.08f647": "Sacha Gervasi", "m.0h88bb2": "Sacha Puttnam", "m.0j1v9tm": "Corey Britz", "m.0zdb8q6": "Amir"}}, {"question": "what timezone is australia gmt", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chghy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chghy ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Australia ] )", "golden_entities": {"m.0chghy": "Australia"}, "answer_entities": {"m.0y497_m": "Australian Eastern Time Zone", "m.0y497zw": "Australian Central Time Zone", "m.0y4980d": "Australian Western Time Zone", "m.0y498qn": "Casey Time Zone", "m.0y498v7": "Central Western Time Zone", "m.0y49954": "Christmas Island\u00a0Time Zone", "m.0y49994": "Cocos Islands\u00a0Time Zone", "m.0y499p1": "Davis\u00a0Time Zone", "m.0y49btq": "Heard and McDonald Islands\u00a0Time Zone", "m.0y4dpjf": "Lord Howe Time Zone", "m.0y4dr4c": "Mawson Station\u00a0Time Zone", "m.0y4drym": "Norfolk\u00a0Time Zone"}}, {"question": "what tv show did joey lawrence play on", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pr9kj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pr9kj ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , series ] ) ( JOIN ( R [ tv , tv actor , starring roles ] ) [ Joey Lawrence ] ) )", "golden_entities": {"m.01pr9kj": "Joey Lawrence"}, "answer_entities": {"m.026_g9w": "Run of the House", "m.02xwgb": "Blossom", "m.036y7h": "Gimme a Break!", "m.0b6kw6d": "Melissa & Joey", "m.0g0tw9": "Brotherly Love", "m.0lc1qx5": "Bow"}}, {"question": "what timezone is denver co", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cl1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cl1 ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Denver ] )", "golden_entities": {"m.02cl1": "Denver"}, "answer_entities": {"m.02hczc": "Mountain Time Zone"}}, {"question": "where does jackie french live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c9xl9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c9xl9 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Jackie French ] )", "golden_entities": {"m.0c9xl9": "Jackie French"}, "answer_entities": {"m.06y57": "Sydney"}}, {"question": "what form of government was practiced in sparta", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09472)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09472 ns:location.country.form_of_government ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , form of government ] ) [ Sparta ] )", "golden_entities": {"m.09472": "Sparta"}, "answer_entities": {"m.04mlzp": "Diarchy", "m.04szc": "Monarchy", "m.06cx9": "Republic", "m.09dcy": "Aristocracy"}}, {"question": "what school did joan miro attend", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g_6k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g_6k ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Joan Mir ] ) )", "golden_entities": {"m.0g_6k": "Joan Mir"}, "answer_entities": {"m.06w5jjm": "Cercle Art\u00edstic de Sant Lluc"}}, {"question": "who was vincent van gogh inspired by", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m2 ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Vincent van Gogh ] )", "golden_entities": {"m.07_m2": "Vincent van Gogh"}, "answer_entities": {"m.016s03": "Eug\u00e8ne Delacroix", "m.01xnj": "Claude Monet", "m.0452w": "Jean-Fran\u00e7ois Millet", "m.056100": "Jozef Isra\u00ebls", "m.05t6y5": "Anton Mauve", "m.063mx": "Paul C\u00e9zanne", "m.08hrl7": "Fernand Cormon", "m.0bskv2": "Rembrandt", "m.0fmjym": "Willem Roelofs", "m.0pwnh": "Peter Paul Rubens"}}, {"question": "when did the new york knicks win a championship", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jm3v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jm3v ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ New York Knicks ] )", "golden_entities": {"m.0jm3v": "New York Knicks"}, "answer_entities": {"m.0cs1kg": "1973 NBA Finals", "m.0cs1x4": "1970 NBA Finals"}}, {"question": "where is jack daniels factory", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.021zmy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.021zmy ns:distilled_spirits.distillery.region ?x .\n}\n", "logical_form": "( JOIN ( R [ distilled spirits , distillery , region ] ) [ Jack Daniel's ] )", "golden_entities": {"m.021zmy": "Jack Daniel's"}, "answer_entities": {"m.07h34": "Tennessee"}}, {"question": "where is santa clara university", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027xx3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027xx3 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Santa Clara University ] )", "golden_entities": {"m.027xx3": "Santa Clara University"}, "answer_entities": {"m.01n7q": "California", "m.09c7w0": "United States of America", "m.0r6cx": "Santa Clara"}}, {"question": "where did timothy mcveigh go to prison", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07rp8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07rp8 ns:base.prison.prisoner.imprisoned ?y .\n?y ns:base.prison.imprisonment.prison ?x .\n}\n", "logical_form": "( JOIN ( R [ base , prison , imprisonment , prison ] ) ( JOIN ( R [ base , prison , prisoner , imprisoned ] ) [ Timothy McVeigh ] ) )", "golden_entities": {"m.07rp8": "Timothy McVeigh"}, "answer_entities": {"m.051c03": "ADX Florence"}}, {"question": "what sea does the yangtze river flow into", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01y4t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01y4t ns:geography.river.mouth ?x .\n}\n", "logical_form": "( JOIN ( R [ geography , river , mouth ] ) [ Yangtze ] )", "golden_entities": {"m.01y4t": "Yangtze"}, "answer_entities": {"m.018smn": "East China Sea"}}, {"question": "where do the ny rangers play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hmtk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hmtk ns:sports.sports_team.arena_stadium ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ New York Rangers ] )", "golden_entities": {"m.0hmtk": "New York Rangers"}, "answer_entities": {"m.0j_66": "Madison Square Garden"}}, {"question": "where is jefferson davis buried", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043q0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043q0 ns:people.deceased_person.place_of_burial ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Jefferson Davis ] )", "golden_entities": {"m.043q0": "Jefferson Davis"}, "answer_entities": {"m.048sj4": "Hollywood Cemetery"}}, {"question": "what years have the dallas cowboys won the superbowl", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02896)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02896 ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Dallas Cowboys ] )", "golden_entities": {"m.02896": "Dallas Cowboys"}, "answer_entities": {"m.076n1": "Super Bowl VI", "m.076q3": "Super Bowl XII", "m.076vy": "Super Bowl XXVII", "m.076w8": "Super Bowl XXVIII", "m.076wz": "Super Bowl XXX"}}, {"question": "what awards has louis sachar won", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bq8d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bq8d ns:award.award_winner.awards_won ?y .\n?y ns:award.award_honor.award ?x .\n}\n", "logical_form": "( JOIN ( R [ award , award honor , award ] ) ( JOIN ( R [ award , award winner , awards won ] ) [ Louis Sachar ] ) )", "golden_entities": {"m.01bq8d": "Louis Sachar"}, "answer_entities": {"m.01cd7p": "John Newbery Medal", "m.027x4ws": "Dorothy Canfield Fisher Children's Book Award", "m.03p0vr7": "National Book Award for Young People's Literature", "m.09kkqzd": "Anne V. Zarrow Award for Young Readers' Literature"}}, {"question": "where did benjamin franklin died", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019fz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019fz ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Benjamin Franklin ] )", "golden_entities": {"m.019fz": "Benjamin Franklin"}, "answer_entities": {"m.0dclg": "Philadelphia"}}, {"question": "what is the local language of israel", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03spz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03spz ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Israel ] )", "golden_entities": {"m.03spz": "Israel"}, "answer_entities": {"m.02h40lc": "English Language", "m.03hkp": "Hebrew Language", "m.04gd7": "Lojban", "m.04p7x": "Ladino Language", "m.0880p": "Yiddish Language", "m.0jzc": "Arabic Language"}}, {"question": "what city and state was the air force academy established", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k9wp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k9wp ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ United States Air Force Academy ] ) )", "golden_entities": {"m.0k9wp": "United States Air Force Academy"}, "answer_entities": {"m.01vsl": "Colorado Springs"}}, {"question": "what 's the national sport of puerto rico", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05r7t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05r7t ns:sports.sports_team_location.teams ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team location , teams ] ) [ Puerto Rico ] )", "golden_entities": {"m.05r7t": "Puerto Rico"}, "answer_entities": {"m.02p6lm8": "Capitanes de Arecibo", "m.03wcnxr": "Puerto Rico men's national volleyball team", "m.047g442": "Puerto Rico women's national volleyball team", "m.04h5_c": "Puerto Rico national football team"}}, {"question": "what did shawnee smith play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06t3nj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06t3nj ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Shawnee Smith ] ) )", "golden_entities": {"m.06t3nj": "Shawnee Smith"}, "answer_entities": {"m.025sc21": "The Blob", "m.02pcq92": "Saw IV", "m.02pscpb": "A Slipping-Down Life", "m.02vgy2": "Who's Harry Crumb?", "m.02x6dqb": "Annie", "m.03cjx8n": "Face of Evil", "m.03v6q4": "Summer School", "m.03ylv0s": "Carnival of Souls", "m.0435vm": "The Island", "m.04j2rlx": "Female Perversions", "m.04ljylq": "Repo! The Genetic Opera", "m.04ycv_f": "The Low Life", "m.05jwph": "Saw II", "m.05n543z": "Secrets of an Undercover Wife", "m.05qbdb8": "Saw VI", "m.06_v8dw": "I Saw What You Did", "m.08tl9t": "Desperate Hours", "m.08zjv6": "Breakfast of Champions", "m.09fc83": "The Stand", "m.09rfh9": "Saw III", "m.0cfw7m_": "Twice Upon a Time", "m.0crrh0v": "Slaughter", "m.0crrmht": "The Party Crashers", "m.0dz6hl": "Dogtown", "m.0fpklgd": "Easy Prey", "m.0fq7dv_": "Saw", "m.0fsclx": "The Grudge 3", "m.0g4ftm9": "Something Borrowed, Something Blue", "m.0gm0_nm": "Bombshell", "m.0gw_7xk": "Jayne Mansfield's Car", "m.0m0plj9": "The Almost Guys"}}, {"question": "what movie did angelina jolie direct", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f4vbz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f4vbz ns:film.director.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , director , film ] ) [ Angelina Jolie ] )", "golden_entities": {"m.0f4vbz": "Angelina Jolie"}, "answer_entities": {"m.011q46b6": "By the Sea", "m.0gttw8n": "In the Land of Blood and Honey", "m.0ngxp8g": "A Place in Time", "m.0wjk75w": "Unbroken"}}]