[{"question": "what county is lancaster ca located in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0r0jv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0r0jv ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Lancaster ] )", "golden_entities": {"m.0r0jv": "Lancaster"}, "answer_entities": {"m.0kpys": "Los Angeles County"}}, {"question": "what continent is australia in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chghy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chghy ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mh .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Continent ] ) ( JOIN ( R [ location , location , containedby ] ) [ Australia ] ) )", "golden_entities": {"m.0chghy": "Australia", "m.01mh": "Continent"}, "answer_entities": {"m.05nrg": "Oceania", "m.09pkq0": "Australian Continent"}}, {"question": "what is roshon fegan 's heritage", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04jq2yz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04jq2yz ns:people.person.ethnicity ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , ethnicity ] ) [ Roshon Fegan ] )", "golden_entities": {"m.04jq2yz": "Roshon Fegan"}, "answer_entities": {"m.0x67": "African American"}}, {"question": "where is spanish springs nv", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xdbn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xdbn ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.0kpym_ .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ US County ] ) ( JOIN ( R [ location , location , containedby ] ) [ Spanish Springs ] ) )", "golden_entities": {"m.0xdbn": "Spanish Springs", "m.0kpym_": "US County"}, "answer_entities": {"m.0n6mc": "Washoe County"}}, {"question": "what is the name of the sacred text of islam", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0flw86)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0flw86 ns:religion.religion.texts ?x .\n}\n", "logical_form": "( JOIN ( R [ religion , religion , texts ] ) [ Islam ] )", "golden_entities": {"m.0flw86": "Islam"}, "answer_entities": {"m.02q8xdw": "Sword Verse", "m.03hf62": "Al-Isra", "m.045_sj": "Al-Fatiha", "m.0482d5": "Al-Kawthar", "m.04b286": "Al-Masadd", "m.04b297": "An-Nasr", "m.04b29y": "Al-Kafirun", "m.04b3hq": "Fardh", "m.04fvry": "Fajr prayer", "m.04g0_k": "Quraysh", "m.04vm2_": "Az-Zalzala", "m.04vm29": "Al-Qadr", "m.04vm2n": "Al-Bayyina", "m.04vm51": "At-Takathur", "m.04vpdh": "An-Najm", "m.04vpfj": "Ar-Rahman", "m.04vqkh": "Al-Jumua", "m.04vy82": "An-Naba", "m.04vy9w": "Abasa", "m.04vyhl": "Al-Ala", "m.04vyms": "Ad-Dhuha", "m.04vyn3": "Al-Inshirah", "m.052nbg": "Sahih al-Bukhari", "m.0539s0": "Riba", "m.05jlpz": "Al-Baqara 255", "m.074jc": "Sunnah", "m.096tx": "Quran"}}, {"question": "where did madoff live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051znky)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051znky ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Bernard Madoff ] ) )", "golden_entities": {"m.051znky": "Bernard Madoff"}, "answer_entities": {"m.0cc56": "Manhattan", "m.0ccvx": "Queens", "m.0f8l9c": "France", "m.0rqf1": "Palm Beach", "m.0y34j": "Roslyn", "m.0y8vm": "Montauk"}}, {"question": "where to hang out in chicago", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_d4 ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Chicago ] )", "golden_entities": {"m.01_d4": "Chicago"}, "answer_entities": {"m.01dlzc": "Adler Planetarium", "m.021czc": "Field Museum of Natural History", "m.025v4fb": "Lincoln Park Zoo", "m.027hqc_": "Art Institute of Chicago", "m.02jw0z": "Shedd Aquarium", "m.02rvwrv": "Art Institute of Chicago Building", "m.02vv_6w": "Polish Museum of America", "m.03y4l3": "Gilmore Car Museum", "m.04h9qj": "Brookfield Zoo", "m.05zv09": "Chicago Cultural Center", "m.06_7k": "Willis Tower", "m.07qbm4": "Hyde Park Art Center", "m.094154": "National Museum of Mexican Art", "m.0b0sh": "Wrigley Field", "m.0b28z": "John Hancock Center", "m.0bl8mx": "DuSable Museum of African American History", "m.0c7ln": "Navy Pier", "m.0d9wz": "Museum of Science and Industry", "m.0g_8d0": "Cadillac Palace Theatre", "m.0j2m3px": "Museum of Science and Industry", "m.0n4_xtw": "Chicago Riverwalk", "m.0n8yyvt": "Riis Park", "m.0w7m2x9": "Muslim Community Center"}}, {"question": "what influenced jackson pollock 's work", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04510)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04510 ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Jackson Pollock ] )", "golden_entities": {"m.04510": "Jackson Pollock"}, "answer_entities": {"m.01ny1z": "Thomas Hart Benton", "m.02gcyb": "Mark Tobey", "m.060_7": "Pablo Picasso", "m.0bk5r": "Carl Jung", "m.0bqb_": "Max Ernst", "m.0c241_": "John D. Graham", "m.0g_6k": "Joan Mir"}}, {"question": "what team did doug williams play for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0443ql)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0443ql ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Doug Williams ] ) )", "golden_entities": {"m.0443ql": "Doug Williams"}, "answer_entities": {"m.01n_xh": "Arizona Outlaws", "m.07l24": "Tampa Bay Buccaneers", "m.084l5": "Washington Redskins", "m.0gj8lsd": "Grambling State Tigers football"}}, {"question": "what are the different sports in the philippines", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05v8c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05v8c ns:sports.sports_team_location.teams ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team location , teams ] ) [ Philippines ] )", "golden_entities": {"m.05v8c": "Philippines"}, "answer_entities": {"m.04k3r_": "Philippines national football team", "m.07k3_n0": "Philippines men's national volleyball team", "m.0ll4ndn": "Laos FC"}}, {"question": "where did willy wonka take place", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0347sv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0347sv ns:fictional_universe.fictional_character.appears_in_these_fictional_universes ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , fictional character , appears in these fictional universes ] ) [ Willy Wonka ] )", "golden_entities": {"m.0347sv": "Willy Wonka"}, "answer_entities": {"m.04rn2rz": "Chocolate Factory Universe", "m.0fv9n": "Charlie and the Chocolate Factory"}}, {"question": "who is cameron crowe", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vb6z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vb6z ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Cameron Crowe ] )", "golden_entities": {"m.01vb6z": "Cameron Crowe"}, "answer_entities": {"m.01d_h8": "Film Producer", "m.02h6676": "Editor", "m.02hrh1q": "Actor", "m.02jknp": "Film director", "m.0cbd2": "Writer", "m.0d8qb": "Journalist", "m.0dxtg": "Screenwriter"}}, {"question": "what films did liam neeson star in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h5g_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h5g_ ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Liam Neeson ] ) )", "golden_entities": {"m.0h5g_": "Liam Neeson"}, "answer_entities": {"m.01_0f7": "Kingdom of Heaven", "m.010hct98": "A Monster Calls", "m.012y5v": "The Bounty", "m.019vhk": "Gangs of New York", "m.01dh6f": "Nell", "m.01hdzl3": "Darkman", "m.01l63z": "Excalibur", "m.020bv3": "Love Actually", "m.027rkbd": "The Innocent", "m.027v2lz": "Coral Reef Adventure", "m.02fqrf": "Batman Begins", "m.02ll45": "The Mission", "m.02pm8zp": "Next of Kin", "m.02pnb78": "Lamb", "m.02prwdh": "Breakfast on Pluto", "m.02pxhgv": "After.Life", "m.02q88q8": "The Good Mother", "m.02rq8k8": "Shining Through", "m.02w7c9c": "A Prayer for the Dying", "m.02xhkvz": "Pilgrim's Progress", "m.02xhkwb": "Nailed", "m.033_m2": "Rob Roy", "m.035s95": "The Newton Boys", "m.03c2h8h": "Satisfaction", "m.03m4mj": "Husbands and Wives", "m.03mgw2v": "Big Buck Bunny", "m.03mgx6z": "Taken", "m.03t79f": "The Haunting", "m.046f3p": "Kinsey", "m.04dx7g": "The Dead Pool", "m.04j1b7x": "Sworn to Silence", "m.04j2qhy": "Ethan Frome", "m.04ydvzd": "The Big Man", "m.05p4097": "Five Minutes of Heaven", "m.05sjt9": "Les Mis\u00e9rables", "m.05szq8z": "Clash of the Titans", "m.060hk0": "Lumi\u00e8re and Company", "m.0639bg": "The Chronicles of Narnia: The Lion, the Witch and the Wardrobe", "m.063fh9": "The Chronicles of Narnia: Prince Caspian", "m.0642ykh": "The Chronicles of Narnia: The Voyage of the Dawn Treader", "m.06p361": "Suspect", "m.07_k0c0": "The A-Team", "m.07l4yp8": "Chloe", "m.080p93d": "Gun Shy", "m.092cdq": "Everest", "m.095k_x": "Leap of Faith", "m.09g96w7": "The Next Three Days", "m.09k5kmz": "The Other Man", "m.09lcsj": "Seraphim Falls", "m.0b1c19": "Duet for One", "m.0b7b7v4": "Under Suspicion", "m.0bb2g9p": "Ruby Cairo", "m.0bh5v1y": "Hold the Dream", "m.0bh8tgs": "Battleship", "m.0blvtr": "High Spirits", "m.0bmch_x": "Unknown", "m.0bpm4yw": "The Dark Knight Rises", "m.0bw20": "K-19: The Widowmaker", "m.0cd3kf": "Krull", "m.0crdxqs": "Arthur the King", "m.0crrmnr": "The Man Who Came to Dinner", "m.0crrtl8": "Christiana", "m.0crscqh": "Journey Into Amazing Caves", "m.0cs17mf": "Wrath of the Titans", "m.0cs1dh7": "The Stars of Star Wars", "m.0ddhlx3": "The Wildest Dream", "m.0ddt_": "Star Wars Episode I: The Phantom Menace", "m.0dmnww": "Before and After", "m.0gwys7m": "The Grey", "m.0gxs87f": "A Child's Garden of Poetry", "m.0hfzr": "Schindler's List", "m.0hhggmy": "Taken 2", "m.0j27q89": "Khumba", "m.0jws4d1": "Anchorman 2: The Legend Continues", "m.0n4g1dj": "The Lego Movie", "m.0ng4tdd": "A Walk Among the Tombstones", "m.0ng5055": "Non-Stop", "m.0ngxr4w": "The Third Person", "m.0pbw9qb": "Black Holes: The Other Side of Infinity", "m.0pmfg28": "The Nut Job", "m.0pv54": "Michael Collins", "m.0vnltcd": "The Prophet", "m.0vps74l": "A Million Ways to Die in the West", "m.0w4fbhm": "Run All Night", "m.0wry9ll": "Taken 3"}}, {"question": "what does tim gunn do for a living", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bslxh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bslxh ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Tim Gunn ] )", "golden_entities": {"m.0bslxh": "Tim Gunn"}, "answer_entities": {"m.02hrh1q": "Actor", "m.02jknp": "Film director", "m.02n9jv": "Consultant", "m.03gjzk": "Television producer", "m.0dxtg": "Screenwriter", "m.0dypbr": "TV Personality", "m.0kyk": "Author", "m.0np9r": "Voice Actor"}}, {"question": "what was eli whitney job", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ncr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ncr ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Eli Whitney ] )", "golden_entities": {"m.02ncr": "Eli Whitney"}, "answer_entities": {"m.01d30f": "Teacher", "m.03sbb": "Inventor", "m.09j9h": "Engineer"}}, {"question": "what does taiwan people speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06f32)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06f32 ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Taiwan ] )", "golden_entities": {"m.06f32": "Taiwan"}, "answer_entities": {"m.03115z": "Mandarin Chinese", "m.09q16b": "Taiwanese Mandarin", "m.0dxj6": "Chinese, Hakka Language", "m.0g1jw": "Taiwanese Hokkien"}}, {"question": "where was governor cuomo born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pjpd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pjpd ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Andrew Cuomo ] )", "golden_entities": {"m.02pjpd": "Andrew Cuomo"}, "answer_entities": {"m.0ccvx": "Queens"}}, {"question": "what money to take to sri lanka", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06m_5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06m_5 ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Sri Lanka ] )", "golden_entities": {"m.06m_5": "Sri Lanka"}, "answer_entities": {"m.02gsxw": "Sri Lankan rupee"}}, {"question": "who was leonardo da vinci teacher", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lg6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lg6 ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Leonardo da Vinci ] )", "golden_entities": {"m.04lg6": "Leonardo da Vinci"}, "answer_entities": {"m.01fgbq": "Andrea del Verrocchio", "m.04qj5": "Lorenzo de' Medici", "m.0f87z0": "John Argyropoulos"}}, {"question": "what football teams did emmitt smith play for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01480y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01480y ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Emmitt Smith ] ) )", "golden_entities": {"m.01480y": "Emmitt Smith"}, "answer_entities": {"m.02896": "Dallas Cowboys", "m.0ftf0f": "Florida Gators football", "m.0ws7": "Arizona Cardinals"}}, {"question": "what city is purdue university located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05x_5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05x_5 ns:location.location.street_address ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ location , location , street address ] ) [ Purdue University ] ) )", "golden_entities": {"m.05x_5": "Purdue University"}, "answer_entities": {"m.0sqd0": "West Lafayette"}}, {"question": "what did emily bronte died of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02nzw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02nzw ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Emily Bront\u00eb ] )", "golden_entities": {"m.02nzw": "Emily Bront\u00eb"}, "answer_entities": {"m.07jwr": "Tuberculosis"}}, {"question": "what to do around krabi thailand", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04q9ng)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04q9ng ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Krabi ] )", "golden_entities": {"m.04q9ng": "Krabi"}, "answer_entities": {"m.05_sdt": "Railay Beach", "m.07m1yw": "Ko Lanta Yai", "m.0k6zhbn": "Tiger Cave Temple", "m.0k6zhkl": "Phra Nang Beach", "m.0k6zhn3": "Tup Island", "m.0k6zhpt": "Ao Tha Len Bay", "m.0k6zhtb": "Ao Phra Nang", "m.0k6zjcg": "Nosey Parker's Elephant Camp", "m.0k6zjqf": "Hat Noppharat Beach", "m.0k6zm1_": "Khao Phanom Bencha National Park"}}, {"question": "what country is george washington carver from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03djm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03djm ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ George Washington Carver ] )", "golden_entities": {"m.03djm": "George Washington Carver"}, "answer_entities": {"m.09c7w0": "United States of America"}}, {"question": "what time zone is birmingham england", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k33p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k33p ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Birmingham ] )", "golden_entities": {"m.0k33p": "Birmingham"}, "answer_entities": {"m.03bdv": "Greenwich Mean Time Zone", "m.04q01dj": "British Summer Time"}}, {"question": "what does andy warhol do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kc6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kc6 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Andy Warhol ] )", "golden_entities": {"m.0kc6": "Andy Warhol"}, "answer_entities": {"m.01d_h8": "Film Producer", "m.020xn5": "Illustrator", "m.02hrh1q": "Actor", "m.02jknp": "Film director", "m.02nxqmh": "Painter", "m.03hz6vv": "Visual Artist", "m.03qsdp2": "Printmaker", "m.0b7b55p": "Sculptor", "m.0dgd_": "Cinematographer", "m.0dxtg": "Screenwriter", "m.0kyk": "Author", "m.0lgw7": "Photographer", "m.0n1h": "Artist"}}, {"question": "where is colombia the country", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ls2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ls2 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Colombia ] )", "golden_entities": {"m.01ls2": "Colombia"}, "answer_entities": {"m.06n3y": "South America", "m.07c5l": "Americas"}}, {"question": "where was karl marx buried", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.048cl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.048cl ns:people.deceased_person.place_of_burial ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Karl Marx ] )", "golden_entities": {"m.048cl": "Karl Marx"}, "answer_entities": {"m.0j70p": "Highgate Cemetery"}}, {"question": "what timezone is nevada in right now", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059_c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059_c ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Nevada ] )", "golden_entities": {"m.059_c": "Nevada"}, "answer_entities": {"m.02hczc": "Mountain Time Zone", "m.02lcqs": "Pacific Time Zone"}}, {"question": "what did dr carter g woodson do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042w00)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042w00 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Carter G. Woodson ] )", "golden_entities": {"m.042w00": "Carter G. Woodson"}, "answer_entities": {"m.03jgz": "Historian", "m.0cbd2": "Writer", "m.0d8qb": "Journalist", "m.0kyk": "Author"}}, {"question": "who invented the ford motor company", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02zs4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02zs4 ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ Ford Motor Company ] )", "golden_entities": {"m.02zs4": "Ford Motor Company"}, "answer_entities": {"m.03gxm": "Henry Ford"}}, {"question": "what is ayrton senna", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012pxw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012pxw ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Ayrton Senna ] )", "golden_entities": {"m.012pxw": "Ayrton Senna"}, "answer_entities": {"m.02h6nn_": "Race car driver"}}, {"question": "where was stephen g. breyer born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016m0v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016m0v ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Stephen Breyer ] )", "golden_entities": {"m.016m0v": "Stephen Breyer"}, "answer_entities": {"m.0d6lp": "San Francisco"}}, {"question": "what did charles dickens believe in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01v9724)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01v9724 ns:people.person.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , religion ] ) [ Charles Dickens ] )", "golden_entities": {"m.01v9724": "Charles Dickens"}, "answer_entities": {"m.0n2g": "Anglicanism"}}, {"question": "what religion is sammy davis jr", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bmlb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bmlb ns:people.person.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , religion ] ) [ Sammy Davis, Jr. ] )", "golden_entities": {"m.01bmlb": "Sammy Davis, Jr."}, "answer_entities": {"m.03_gx": "Judaism"}}, {"question": "who started google", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0387r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0387r ns:law.invention.inventor ?x .\n}\n", "logical_form": "( JOIN ( R [ law , invention , inventor ] ) [ Google Search ] )", "golden_entities": {"m.0387r": "Google Search"}, "answer_entities": {"m.0gjpq": "Larry Page", "m.0gjq6": "Sergey Brin"}}, {"question": "in what timezone is arizona", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0vmt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0vmt ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Arizona ] )", "golden_entities": {"m.0vmt": "Arizona"}, "answer_entities": {"m.02hczc": "Mountain Time Zone"}}, {"question": "what year did arizona diamondbacks win the world series", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0x0d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0x0d ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Arizona Diamondbacks ] )", "golden_entities": {"m.0x0d": "Arizona Diamondbacks"}, "answer_entities": {"m.018my": "2001 World Series"}}, {"question": "where was jesus born and raised", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045m1_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.045m1_ ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Jesus Christ ] )", "golden_entities": {"m.045m1_": "Jesus Christ"}, "answer_entities": {"m.065sh7": "Judea"}}, {"question": "where is greyton western cape", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09g125)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09g125 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Greyton, Western Cape ] )", "golden_entities": {"m.09g125": "Greyton, Western Cape"}, "answer_entities": {"m.01tjt2": "Western Cape"}}, {"question": "where is lanzarote in a world map", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01s8wm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01s8wm ns:geography.island.island_group ?x .\n}\n", "logical_form": "( JOIN ( R [ geography , island , island group ] ) [ Lanzarote ] )", "golden_entities": {"m.01s8wm": "Lanzarote"}, "answer_entities": {"m.0hzjwx2": "Canary Islands"}}, {"question": "who plays dante falconeri", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06wc9fm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06wc9fm ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Dante Falconeri ] ) )", "golden_entities": {"m.06wc9fm": "Dante Falconeri"}, "answer_entities": {"m.04ndnk": "Dominic Zamprogna"}}, {"question": "who does northern ireland belong to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05bcl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05bcl ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , administrative parent ] ) [ Northern Ireland ] )", "golden_entities": {"m.05bcl": "Northern Ireland"}, "answer_entities": {"m.07ssc": "United Kingdom"}}, {"question": "where do islamic people go to worship", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0flw86)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0flw86 ns:religion.religion.types_of_places_of_worship ?x .\n}\n", "logical_form": "( JOIN ( R [ religion , religion , types of places of worship ] ) [ Islam ] )", "golden_entities": {"m.0flw86": "Islam"}, "answer_entities": {"m.04_xn": "Mosque", "m.0pc5qwj": "Masjid Hamza, Valley Stream"}}, {"question": "what god does taoism believe in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07gvx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07gvx ns:religion.religion.deities ?x .\n}\n", "logical_form": "( JOIN ( R [ religion , religion , deities ] ) [ Taoism ] )", "golden_entities": {"m.07gvx": "Taoism"}, "answer_entities": {"m.01g7jh": "He Xiangu", "m.01g7kl": "Cao Guojiu", "m.01g7ln": "Li Tieguai", "m.01g7m0": "Lan Caihe", "m.01g7rf": "L\u00fc Dongbin", "m.01gcpc": "Han Xiangzi", "m.01gcpr": "Zhang Guolao", "m.01gcqh": "Zhongli Quan", "m.01tbmq": "Jade Emperor", "m.0258q8": "Queen Mother of the West", "m.025964": "Three Pure Ones", "m.02rj87h": "Magu", "m.09n_d1": "Yuanshi Tianzun", "m.0j626gb": "Cai Shen"}}, {"question": "what college did kris humphries play for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0730b4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0730b4 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.school ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league draft pick , school ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Kris Humphries ] ) )", "golden_entities": {"m.0730b4": "Kris Humphries"}, "answer_entities": {"m.025v3k": "University of Minnesota"}}, {"question": "what do mali people speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04v09)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04v09 ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Mali ] )", "golden_entities": {"m.04v09": "Mali"}, "answer_entities": {"m.01gdq": "Bambara language", "m.05n7jk": "Fula language", "m.064_8sq": "French"}}, {"question": "who is john garcia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_lpf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_lpf ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ John Garcia ] )", "golden_entities": {"m.03_lpf": "John Garcia"}, "answer_entities": {"m.09jwl": "Musician", "m.09l65": "Singer"}}, {"question": "what did lbj die of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f7fy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f7fy ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Lyndon B. Johnson ] )", "golden_entities": {"m.0f7fy": "Lyndon B. Johnson"}, "answer_entities": {"m.0gk4g": "heart attack"}}, {"question": "what does george soros believe", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gyk6w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gyk6w ns:people.person.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , religion ] ) [ George Soros ] )", "golden_entities": {"m.0gyk6w": "George Soros"}, "answer_entities": {"m.03_gx": "Judaism", "m.0kpl": "Atheism"}}]