[{"question": "where did carrie underwood live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.058s57)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.058s57 ns:music.artist.origin ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , origin ] ) [ Carrie Underwood ] )", "golden_entities": {"m.058s57": "Carrie Underwood"}, "answer_entities": {"m.0z7zm": "Checotah"}}, {"question": "when did carolina hurricanes win the cup", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j8cb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j8cb ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Carolina Hurricanes ] )", "golden_entities": {"m.0j8cb": "Carolina Hurricanes"}, "answer_entities": {"m.02d08dj": "2006 Stanley Cup Finals"}}, {"question": "who currently owns the steelers", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05tfm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05tfm ns:sports.professional_sports_team.owner_s ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , professional sports team , owner s ] ) [ Pittsburgh Steelers ] )", "golden_entities": {"m.05tfm": "Pittsburgh Steelers"}, "answer_entities": {"m.03nrwfz": "Rooney family"}}, {"question": "where was toni braxton born and raised", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02h9_l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02h9_l ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Toni Braxton ] )", "golden_entities": {"m.02h9_l": "Toni Braxton"}, "answer_entities": {"m.0ttlb": "Severn"}}, {"question": "where is shoreview mn", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0wfmh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0wfmh ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Shoreview ] )", "golden_entities": {"m.0wfmh": "Shoreview"}, "answer_entities": {"m.0nh57": "Ramsey County"}}, {"question": "what did maria theresa rule", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0czh6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0czh6 ns:royalty.monarch.kingdom ?x .\n}\n", "logical_form": "( JOIN ( R [ royalty , monarch , kingdom ] ) [ Maria Theresa ] )", "golden_entities": {"m.0czh6": "Maria Theresa"}, "answer_entities": {"m.01d8l": "Bohemia", "m.03gj2": "Hungary"}}, {"question": "what was jack london 's education", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bt23)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bt23 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jack London ] ) )", "golden_entities": {"m.0bt23": "Jack London"}, "answer_entities": {"m.025ygr9": "Oakland High School", "m.02zd460": "University of California, Berkeley"}}, {"question": "what county is bradenton fl located in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rmwd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rmwd ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Bradenton ] )", "golden_entities": {"m.0rmwd": "Bradenton"}, "answer_entities": {"m.0jrmq": "Manatee County"}}, {"question": "what is the philadelphia church of god", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ldnm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ldnm ns:base.schemastaging.non_profit_extra.classification ?x .\n}\n", "logical_form": "( JOIN ( R [ base , schemastaging , non profit extra , classification ] ) [ Philadelphia Church of God ] )", "golden_entities": {"m.04ldnm": "Philadelphia Church of God"}, "answer_entities": {"m.0ppgx02": "Protestant Organizations"}}, {"question": "where does luke skywalker live in star wars", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f1bg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f1bg ns:fictional_universe.fictional_character.places_lived ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , fictional character , places lived ] ) [ Luke Skywalker ] )", "golden_entities": {"m.0f1bg": "Luke Skywalker"}, "answer_entities": {"m.0kcq0": "Tatooine"}}, {"question": "what did doctor kevorkian do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ctkj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ctkj ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Jack Kevorkian ] )", "golden_entities": {"m.01ctkj": "Jack Kevorkian"}, "answer_entities": {"m.02nxqmh": "Painter", "m.03gq2jw": "Pathologist", "m.05t4q": "Physician", "m.09jwl": "Musician", "m.0kyk": "Author"}}, {"question": "where is chowchilla located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0r186)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0r186 ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Chowchilla ] )", "golden_entities": {"m.0r186": "Chowchilla"}, "answer_entities": {"m.0l2gz": "Madera County"}}, {"question": "what country is vatican city in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ytt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ytt ns:base.biblioness.bibs_location.country ?x .\n}\n", "logical_form": "( JOIN ( R [ base , biblioness , bibs location , country ] ) [ Vatican City ] )", "golden_entities": {"m.07ytt": "Vatican City"}, "answer_entities": {"m.03rjj": "Italy"}}, {"question": "what did john howard study at university", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chh05)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chh05 ns:people.person.education ?y .\n?y ns:education.education.degree ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , degree ] ) ( JOIN ( R [ people , person , education ] ) [ John Howard ] ) )", "golden_entities": {"m.0chh05": "John Howard"}, "answer_entities": {"m.01rr_d": "Bachelor of Laws"}}, {"question": "what did duke ellington do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bdlj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bdlj ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Duke Ellington ] )", "golden_entities": {"m.0bdlj": "Duke Ellington"}, "answer_entities": {"m.01c72t": "Composer", "m.025352": "Lyricist", "m.029bkp": "Bandleader", "m.02hrh1q": "Actor", "m.04l1gwb": "Film Score Composer", "m.05vyk": "Pianist", "m.09jwl": "Musician"}}, {"question": "where are the atlanta falcons located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0wsr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0wsr ns:sports.sports_team.location ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , location ] ) [ Atlanta Falcons ] )", "golden_entities": {"m.0wsr": "Atlanta Falcons"}, "answer_entities": {"m.013yq": "Atlanta"}}, {"question": "what is st francis patron saint of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.032p8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.032p8 ns:base.saints.saint.patronage ?x .\n}\n", "logical_form": "( JOIN ( R [ base , saints , saint , patronage ] ) [ Francis of Assisi ] )", "golden_entities": {"m.032p8": "Francis of Assisi"}, "answer_entities": {"value": "The Enviroment"}}, {"question": "what type of government does israel", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03spz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03spz ns:location.country.form_of_government ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , form of government ] ) [ Israel ] )", "golden_entities": {"m.03spz": "Israel"}, "answer_entities": {"m.018wl5": "Parliamentary system"}}, {"question": "where is downtown littleton", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g8lsf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g8lsf ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Littleton ] )", "golden_entities": {"m.0g8lsf": "Littleton, Colorado"}, "answer_entities": {"m.01n4w": "Colorado", "m.09c7w0": "United States of America", "m.0flbm": "Douglas County", "m.0p03t": "Jefferson County", "m.0p0fc": "Arapahoe County"}}, {"question": "what division is cincinnati bengals in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01y49)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01y49 ns:american_football.football_team.division ?x .\n}\n", "logical_form": "( JOIN ( R [ american football , football team , division ] ) [ Cincinnati Bengals ] )", "golden_entities": {"m.01y49": "Cincinnati Bengals"}, "answer_entities": {"m.068gzd": "AFC North"}}, {"question": "where was toussaint charbonneau from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wcc7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wcc7 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Toussaint Charbonneau ] )", "golden_entities": {"m.01wcc7": "Toussaint Charbonneau"}, "answer_entities": {"m.02p1lp": "Boucherville"}}, {"question": "what timezone is new mexico currently in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05fjy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05fjy ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ New Mexico ] )", "golden_entities": {"m.05fjy": "New Mexico"}, "answer_entities": {"m.02hczc": "Mountain Time Zone"}}, {"question": "what is the legislature of missouri called", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ych)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ych ns:government.governmental_jurisdiction.government_bodies ?x .\n}\n", "logical_form": "( JOIN ( R [ government , governmental jurisdiction , government bodies ] ) [ Missouri ] )", "golden_entities": {"m.04ych": "Missouri"}, "answer_entities": {"m.02zxrn": "Missouri General Assembly", "m.03qj7vv": "Missouri Court of Appeals", "m.0694qd": "Missouri Senate", "m.069kvr": "Missouri House of Representatives"}}, {"question": "what did harriet beecher stowe do as an abolitionist", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015v00)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015v00 ns:book.author.works_written ?x .\n}\n", "logical_form": "( JOIN ( R [ book , author , works written ] ) [ Harriet Beecher Stowe ] )", "golden_entities": {"m.015v00": "Harriet Beecher Stowe"}, "answer_entities": {"g.15dq1ytr": "", "g.15dq9y23": "", "g.1hb_dnqy_": "", "m.013cf4cq": "The Colored Patriots of the American Revolution", "m.01bfl4": "Dred: A Tale of the Great Dismal Swamp", "m.05kgsr": "The Minister's Wooing", "m.066zl5r": "Sunny Memories Of Foreign Lands", "m.067121h": "The education of freedmen", "m.0672sgp": "Little Pussy Willow", "m.0676fkm": "Cabaa del Tio Tom, La", "m.067h0mw": "Khizhina di\u0361a\ufe21di Toma", "m.067p7nm": "Lady Byron vindicated", "m.0688bm6": "Life and letters of Harriet Beecher Stowe", "m.068j5b5": "Sam Lawson's Oldtown fireside stories", "m.068k0vx": "Two ways of using the Bible", "m.069c1_8": "La case de l'Oncle Tom, ou Vie des ne\u0300gres en Amerique", "m.069xp9p": "Young folks' Uncle Tom's cabin", "m.06b10pl": "Pink and white tyranny", "m.06b1v73": "Sketches-Oldtown Folks", "m.06b6613": "The lives and deeds of our self-made men", "m.06bnnzy": "Stories, Sketches And Studies", "m.06bqcs4": "La caban\u0303a de Tom", "m.06bs6jg": "House and home papers", "m.06c13vw": "Stories and sketches for the young", "m.06c301x": "Christian slave", "m.06cz63w": "'It's none of my business", "m.06d5sph": "The Oxford Harriet Beecher Stowe reader", "m.06dfl80": "The True Story of Lord And Lady Byron", "m.06dsbfy": "Onkel Toms Hu tte", "m.06f0scy": "Harriet Beecher Stowe letters, 1828-1885", "m.06fgpg_": "La clef de la case l'Oncle Tom", "m.06g4j_5": "The Pearl of Orr's Island", "m.06g5g0s": "A slovenly Sunday", "m.06gkjg7": "Poganuc People", "m.06h9rz3": "La Cabana Del Tio Tom / Uncle Tom's Cabin", "m.06jh7sq": "Footsteps of the Master", "m.06jr1pw": "Men of our times", "m.06js41b": "Regional Sketches", "m.06jw7v_": "Dred V2", "m.06jyvf2": "Our Dogs and Other Stories", "m.06k51bl": "Spark Notes Uncle Tom's Cabin", "m.06kgy6l": "Household papers and stories", "m.06kmnkr": "Collected Works of Harriet Beecher Stowe", "m.06l4myr": "Tom avgyn ovookho\u012d", "m.06lcqwv": "Aelwyd f'ewythr Robert", "m.06lfklj": "The First Christmas in New England", "m.06lsp7b": "Bible Heroines", "m.06mgylx": "Life of Harriet Beecher Stowe", "m.06mptzz": "Old Town Folks", "m.06n5fwm": "Betty's Bright Idea", "m.06ncf9p": "Aghbar T\u02bbovmasi tnake\u030c", "m.06ndh20": "Un coup d'\u0153il dans la case de l'oncle Tom", "m.06nh2f9": "Mr. And Mrs. Woodbridge", "m.06nhx6v": "Queer Little Folks", "m.06p_5zn": "Uncle Sam's emancipation", "m.06p182s": "History Of Salem Witchcraft", "m.06pd54z": "Hei nu xu tian lu", "m.06pmx_5": "Agitation -- the doom of slavery", "m.06psh0w": "The Harriet Beecher Stowe Reader", "m.06rh2ft": "Our Charley", "m.06rp20p": "Chimmy Corner", "m.06skkpf": "The chimney-corner", "m.06t4hf": "A Key to Uncle Tom's Cabin", "m.06tnnhg": "De slavernij", "m.06txf7v": "annotated Uncle Tom's cabin", "m.06v7_ng": "Three Novels: Uncle Tom's Cabin, The Minister's Wooing, Oldtown Folks", "m.06vjglg": "A Dog's Mission", "m.06vw7jc": "Woman in sacred history", "m.080p2fk": "Palmetto Leaves", "m.0bbjf1x": "The daisy's first winter", "m.0bhjj4k": "Uncle Tom's cabin, or, Negro life in the slave states of America", "m.0jgd2": "Uncle Tom's Cabin"}}, {"question": "where was the battle of appomattox located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.054pn2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.054pn2 ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ Battle of Appomattox Court House ] )", "golden_entities": {"m.054pn2": "Battle of Appomattox Court House"}, "answer_entities": {"m.01p_6k": "Appomattox Court House", "m.05c627j": "Appomattox Court House National Historical Park"}}, {"question": "what time zone is fresno ca", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0mzy7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0mzy7 ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Fresno ] )", "golden_entities": {"m.0mzy7": "Fresno"}, "answer_entities": {"m.02lcqs": "Pacific Time Zone"}}, {"question": "what was the cause of death for sage stallone", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.091f9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.091f9c ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Sage Stallone ] )", "golden_entities": {"m.091f9c": "Sage Stallone"}, "answer_entities": {"m.0gk4g": "heart attack", "m.0lp66": "Atherosclerosis"}}, {"question": "where did queen isabella live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jd6m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jd6m ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Isabella I of Castile ] )", "golden_entities": {"m.0jd6m": "Isabella I of Castile"}, "answer_entities": {"m.02z8x41": "Madrigal de las Altas Torres"}}, {"question": "who won the super bowl xliv 2010", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_0gs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_0gs ns:sports.sports_championship_event.champion ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports championship event , champion ] ) [ Super Bowl XLIV ] )", "golden_entities": {"m.04_0gs": "Super Bowl XLIV"}, "answer_entities": {"m.05g3v": "New Orleans Saints"}}, {"question": "what years did the yankees win the championship", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cqt41)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cqt41 ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ New York Yankees ] )", "golden_entities": {"m.0cqt41": "New York Yankees"}, "answer_entities": {"m.04j70r": "1996 World Series", "m.04j7sr": "1998 World Series", "m.04j7wv": "1999 World Series", "m.04jfmn": "1978 World Series", "m.04jfsz": "1977 World Series", "m.04n39cg": "2009 World Series", "m.04p1w0": "1956 World Series", "m.04td_r": "1941 World Series", "m.04tf_g": "1932 World Series", "m.04tfmb": "1938 World Series", "m.04tfmp": "1943 World Series", "m.04tfpd": "1952 World Series", "m.04tfpr": "1951 World Series", "m.04tfqf": "1950 World Series", "m.04tfr4": "1962 World Series", "m.04tfrh": "1961 World Series", "m.04tfs5": "1958 World Series", "m.04tfv7": "1923 World Series", "m.04tfwz": "1927 World Series", "m.04tfxn": "1928 World Series", "m.04tg0h": "1936 World Series", "m.04tg15": "1937 World Series", "m.04tg1w": "1939 World Series", "m.04tg3l": "1947 World Series", "m.04tg4_": "1953 World Series", "m.04tg4n": "1949 World Series", "m.0d1bbv": "2000 World Series"}}, {"question": "what did samuel de champlain", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09r57)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09r57 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Samuel de Champlain ] )", "golden_entities": {"m.09r57": "Samuel de Champlain"}, "answer_entities": {"m.016wtf": "Sailor", "m.023nrw": "Navigator", "m.099md": "Soldier"}}, {"question": "what was william faulkner known for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.084w8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.084w8 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ William Faulkner ] )", "golden_entities": {"m.084w8": "William Faulkner"}, "answer_entities": {"m.02xhgwq": "Novelist", "m.0cbd2": "Writer"}}, {"question": "what language did the miwok indians speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02l_wv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02l_wv ns:people.ethnicity.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ people , ethnicity , languages spoken ] ) [ Miwok ] )", "golden_entities": {"m.02l_wv": "Miwok"}, "answer_entities": {"m.02h40lc": "English Language", "m.05tbtz": "Utian languages"}}, {"question": "who were queen elizabeth 1 parents", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02rg_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02rg_ ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ Elizabeth I of England ] )", "golden_entities": {"m.02rg_": "Elizabeth I of England"}, "answer_entities": {"m.03p77": "Henry VIII of England", "m.09sxn": "Anne Boleyn"}}, {"question": "what did robert koch do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03kpt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03kpt ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Robert Koch ] )", "golden_entities": {"m.03kpt": "Robert Koch"}, "answer_entities": {"m.05t4q": "Physician"}}, {"question": "who 's betty white", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025mb_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025mb_ ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Betty White ] )", "golden_entities": {"m.025mb_": "Betty White"}, "answer_entities": {"m.015cjr": "Presenter", "m.018gz8": "Comedian", "m.02hrh1q": "Actor", "m.03gjzk": "Television producer", "m.09l65": "Singer", "m.0cbd2": "Writer", "m.0dypbr": "TV Personality", "m.0kyk": "Author", "m.0np9r": "Voice Actor"}}, {"question": "who is lleyton hewitt", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04k1p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04k1p ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Lleyton Hewitt ] )", "golden_entities": {"m.04k1p": "Lleyton Hewitt"}, "answer_entities": {"m.02xhr73": "Tennis player"}}, {"question": "what movies did quentin tarantino star in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0693l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0693l ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Quentin Tarantino ] ) )", "golden_entities": {"m.0693l": "Quentin Tarantino"}, "answer_entities": {"m.01rxyb": "Kill Bill Volume 1", "m.0234j5": "Jackie Brown", "m.026tqdb": "Sleep with Me", "m.026zsft": "Eddie Presley", "m.027tf87": "Sukiyaki Western Django", "m.029k4p": "From Dusk till Dawn", "m.02h4658": "Reservoir Dogs", "m.02pg45": "Four Rooms", "m.02qb14n": "Double Dare", "m.02yvct": "Inglourious Basterds", "m.02zkjw": "Desperado", "m.03bxrfl": "Death Proof", "m.03bxrfz": "Planet Terror", "m.03z20c": "Little Nicky", "m.04j1mv4": "Somebody to Love", "m.04jr__": "My Best Friend's Birthday", "m.04jryv": "Curdled", "m.04jrzl": "Girl 6", "m.051rk5c": "God Said Ha!", "m.0569lx": "The Muppets' Wizard of Oz", "m.084qpk": "Grindhouse", "m.0b6j4zh": "Destiny Turns on the Radio", "m.0cs1gzj": "Kisses in the Dark", "m.0f4_l": "Pulp Fiction", "m.0gjtfm": "Diary of the Dead", "m.0gwjw0c": "Django Unchained", "m.0gyv0b4": "Kill Bill Volume 2", "m.0rph0cf": "The Coriolis Effect", "m.0w29lz2": "Badlanders", "m.0w4hwpv": "Dance Me to the End of Love"}}, {"question": "what language does the new zealand speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ctw_b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ctw_b ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ New Zealand ] )", "golden_entities": {"m.0ctw_b": "New Zealand"}, "answer_entities": {"m.02h40lc": "English Language", "m.03t17x": "New Zealand Sign Language", "m.0dds9": "M\u0101ori language"}}, {"question": "what county is sacramento located in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07bcn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07bcn ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Sacramento ] )", "golden_entities": {"m.07bcn": "Sacramento"}, "answer_entities": {"m.0bxqq": "Sacramento County"}}, {"question": "what did audrey hepburn died of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dqcm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dqcm ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Audrey Hepburn ] )", "golden_entities": {"m.0dqcm": "Audrey Hepburn"}, "answer_entities": {"m.0fb2z2": "Appendix cancer"}}, {"question": "what country was the treaty of versailles written", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07d4d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07d4d ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ Treaty of Versailles ] )", "golden_entities": {"m.07d4d": "Treaty of Versailles"}, "answer_entities": {"m.05qtj": "Paris"}}, {"question": "what is st mary mascot", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01tntf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01tntf ns:education.educational_institution.mascot ?x .\n}\n", "logical_form": "( JOIN ( R [ education , educational institution , mascot ] ) [ Saint Mary's College of California ] )", "golden_entities": {"m.01tntf": "Saint Mary's College of California"}, "answer_entities": {"m.05k68lf": "Saint Mary's College of California Gael"}}, {"question": "who was irving berlin and what did he do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cyhq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cyhq ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Irving Berlin ] )", "golden_entities": {"m.0cyhq": "Irving Berlin"}, "answer_entities": {"m.01c72t": "Composer", "m.025352": "Lyricist", "m.02hrh1q": "Actor", "m.04l1gwb": "Film Score Composer", "m.0nbcg": "Songwriter"}}, {"question": "who shot j lennon", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vsl3_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vsl3_ ns:user.alexander.misc.murdered_person.murdered_by ?x .\n}\n", "logical_form": "( JOIN ( R [ user , alexander , misc , murdered person , murdered by ] ) [ John Lennon ] )", "golden_entities": {"m.01vsl3_": "John Lennon"}, "answer_entities": {"m.01p64f": "Mark David Chapman"}}, {"question": "where is the denver broncos stadium located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0289q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0289q ns:sports.sports_team.arena_stadium ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Denver Broncos ] )", "golden_entities": {"m.0289q": "Denver Broncos"}, "answer_entities": {"m.02hxv8": "Sports Authority Field at Mile High"}}, {"question": "where did sir ernest shackleton live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gbcz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gbcz ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Sir Ernest Shackleton ] ) )", "golden_entities": {"m.0gbcz": "Sir Ernest Shackleton"}, "answer_entities": {"m.0ng8v": "County Kildare"}}, {"question": "where did the welsh language originate from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.083tk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.083tk ns:base.rosetta.languoid.parent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , rosetta , languoid , parent ] ) [ Welsh Language ] )", "golden_entities": {"m.083tk": "Welsh Language"}, "answer_entities": {"m.05tjlvr": "Brythonic Group"}}, {"question": "what was theodore roosevelt 's political party", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07hyk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07hyk ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n", "logical_form": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Theodore Roosevelt ] ) )", "golden_entities": {"m.07hyk": "Theodore Roosevelt"}, "answer_entities": {"m.07wbk": "Republican Party", "m.0b9lfp": "Progressive Party"}}, {"question": "what year were the cincinnati reds founded", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ypc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ypc ns:sports.sports_team.founded ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , founded ] ) [ Cincinnati Reds ] )", "golden_entities": {"m.01ypc": "Cincinnati Reds"}, "answer_entities": {"value": "1881"}}, {"question": "where ulysses s grant go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07t2k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07t2k ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Ulysses S. Grant ] ) )", "golden_entities": {"m.07t2k": "Ulysses S. Grant"}, "answer_entities": {"m.07x4c": "United States Military Academy"}}]