[{"question": "what county is morristown tn in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xr0t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xr0t ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Morristown ] )", "golden_entities": {"m.0xr0t": "Morristown"}, "answer_entities": {"m.0n5c9": "Morris County"}}, {"question": "where do the houston rockets play basketball", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jmfb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jmfb ns:sports.sports_team.arena_stadium ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Houston Rockets ] )", "golden_entities": {"m.0jmfb": "Houston Rockets"}, "answer_entities": {"m.01tx3t": "Toyota Center", "m.01txlf": "Lakewood Church Central Campus"}}, {"question": "what continent do the falkland islands belong to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02wmy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02wmy ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mh .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Continent ] ) ( JOIN ( R [ location , location , containedby ] ) [ Falkland Islands ] ) )", "golden_entities": {"m.02wmy": "Falkland Islands", "m.01mh": "Continent"}, "answer_entities": {"m.06n3y": "South America", "m.07c5l": "Americas"}}, {"question": "what did alvin smith died from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0261tkp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0261tkp ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Alvin Smith ] )", "golden_entities": {"m.0261tkp": "Alvin Smith"}, "answer_entities": {"m.0dh11": "Poison"}}, {"question": "who has tim howard played for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.026s3n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.026s3n ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Tim Howard ] ) )", "golden_entities": {"m.026s3n": "Tim Howard"}, "answer_entities": {"m.02s9vc": "United States men's national soccer team", "m.04q30l": "North Jersey Imperials", "m.050fh": "Manchester United F.C.", "m.0bxjpy": "New York Red Bulls", "m.0mmd6": "Everton F.C."}}, {"question": "what region of the world is north america in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059g4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059g4 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ North America ] )", "golden_entities": {"m.059g4": "North America"}, "answer_entities": {"m.05k3k": "Northern Hemisphere", "m.07c5l": "Americas", "m.0jntd": "Western Hemisphere"}}, {"question": "where do navajo indians live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08k5jg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08k5jg ns:people.ethnicity.geographic_distribution ?x .\n}\n", "logical_form": "( JOIN ( R [ people , ethnicity , geographic distribution ] ) [ Navajo people ] )", "golden_entities": {"m.08k5jg": "Navajo people"}, "answer_entities": {"m.0162sr": "Navajo Nation", "m.018hq1": "Southwestern United States", "m.01n7q": "California", "m.05fjy": "New Mexico", "m.07srw": "Utah", "m.0vmt": "Arizona"}}, {"question": "what instrument does ringo starr play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vrnsk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vrnsk ns:music.group_member.instruments_played ?x .\n}\n", "logical_form": "( JOIN ( R [ music , group member , instruments played ] ) [ Ringo Starr ] )", "golden_entities": {"m.01vrnsk": "Ringo Starr"}, "answer_entities": {"m.013y1f": "Organ", "m.01wy6": "Clarinet", "m.026t6": "Drums", "m.02fsn": "Double bass", "m.02hnl": "Drums", "m.0342h": "Guitar", "m.03qjg": "Harmonica", "m.04rzd": "Mandolin", "m.05148p4": "Keyboard", "m.05r5c": "Piano", "m.06ncr": "Saxophone", "m.07m2y": "Tuba", "m.0l14j_": "Flute", "m.0l14md": "Percussion"}}, {"question": "what happened to president james garfield", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b22w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b22w ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ James A. Garfield ] )", "golden_entities": {"m.0b22w": "James A. Garfield"}, "answer_entities": {"m.014w_8": "Sepsis", "m.0dq9p": "Pneumonia", "m.0gk4g": "heart attack"}}, {"question": "what time zone am i in missouri", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ych)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ych ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Missouri ] )", "golden_entities": {"m.04ych": "Missouri"}, "answer_entities": {"m.02fqwt": "Central Time Zone"}}, {"question": "who did warren moon play for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01b0dl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01b0dl ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Warren Moon ] ) )", "golden_entities": {"m.01b0dl": "Warren Moon"}, "answer_entities": {"m.0487_": "Kansas City Chiefs", "m.04nmxtk": "Houston Oilers", "m.051q5": "Minnesota Vikings", "m.070xg": "Seattle Seahawks", "m.0fgg8c": "Washington Huskies football"}}, {"question": "what brand of guitar does steve vai play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mxt_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mxt_ ns:music.guitarist.guitars_played ?x .\n?x ns:common.topic.notable_types ns:m.05czz29 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Brand ] ) ( JOIN ( R [ music , guitarist , guitars played ] ) [ Steve Vai ] ) )", "golden_entities": {"m.01mxt_": "Steve Vai", "m.05czz29": "Brand"}, "answer_entities": {"m.03vk8": "Ibanez"}}, {"question": "what do hungarian people speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gj2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gj2 ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ Hungary ] )", "golden_entities": {"m.03gj2": "Hungary"}, "answer_entities": {"m.02ztjwg": "Hungarian language"}}, {"question": "in what town did ned kelly and his family grow up", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.014pyb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.014pyb ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Ned Kelly ] )", "golden_entities": {"m.014pyb": "Ned Kelly"}, "answer_entities": {"m.08mh4_": "Beveridge"}}, {"question": "what is bethenny frankel husband name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_l39)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_l39 ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n}\n", "logical_form": "( JOIN ( R [ people , marriage , spouse ] ) ( JOIN ( R [ people , person , spouse s ] ) [ Bethenny Frankel ] ) )", "golden_entities": {"m.07_l39": "Bethenny Frankel"}, "answer_entities": {"m.0j6k0h7": "Jason Hoppy"}}, {"question": "who influenced arthur conan doyle", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ky1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ky1 ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Arthur Conan Doyle ] )", "golden_entities": {"m.0ky1": "Arthur Conan Doyle"}, "answer_entities": {"m.01bdvj": "Joseph Bell", "m.02lt8": "Edgar Allan Poe", "m.04093": "Jules Verne", "m.06lbp": "Robert Louis Stevenson", "m.06y8v": "Walter Scott", "m.06zjbx": "Ibn-e-Safi"}}, {"question": "when was samuel pepys", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06xxc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06xxc ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Samuel Pepys ] )", "golden_entities": {"m.06xxc": "Samuel Pepys"}, "answer_entities": {"m.07ssc": "United Kingdom", "m.0d05w3": "China"}}, {"question": "what instrument does fela kuti play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01tw0t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01tw0t ns:music.group_member.instruments_played ?x .\n}\n", "logical_form": "( JOIN ( R [ music , group member , instruments played ] ) [ Fela Kuti ] )", "golden_entities": {"m.01tw0t": "Fela Kuti"}, "answer_entities": {"m.02hnl": "Drums", "m.0342h": "Guitar", "m.05148p4": "Keyboard", "m.06ncr": "Saxophone", "m.07gql": "Trumpet"}}, {"question": "where did woodrow wilson go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.083q7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.083q7 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Woodrow Wilson ] ) )", "golden_entities": {"m.083q7": "Woodrow Wilson"}, "answer_entities": {"m.02pdhz": "Davidson College", "m.05qgd9": "University of Virginia School of Law", "m.05zl0": "Princeton University", "m.09kvv": "Johns Hopkins University"}}, {"question": "where can you buy amazon kindle", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03d068f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03d068f ns:base.gadgets.gadget.brand ?x .\n}\n", "logical_form": "( JOIN ( R [ base , gadgets , gadget , brand ] ) [ Amazon Kindle ] )", "golden_entities": {"m.03d068f": "Amazon Kindle"}, "answer_entities": {"m.0mgkg": "Amazon.com"}}, {"question": "what sports do people in france play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f8l9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f8l9c ns:sports.sports_team_location.teams ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team location , teams ] ) [ France ] )", "golden_entities": {"m.0f8l9c": "France"}, "answer_entities": {"m.01l3vx": "France national football team", "m.0265nmb": "Orl\u00e9ans Loiret Basket", "m.026t7kv": "France women's national handball team", "m.02pnh1c": "France Davis Cup team", "m.02r4ht3": "France Fed Cup team", "m.02r6fjx": "France men's national volleyball team", "m.02z62d_": "France women's national rugby union team", "m.03c621f": "France men's national pitch and putt team", "m.03d1s0h": "France national korfball team", "m.03nt95f": "France national baseball team", "m.03t49_": "France national rugby union team", "m.03v1tr": "France national rugby league team", "m.047v1fz": "France women's national volleyball team", "m.059_t25": "France women's national under-18 ice hockey team", "m.05syjdc": "France national speedway team", "m.05syms_": "France men's national water polo team", "m.060wcb": "France national basketball team", "m.069wlg": "ASVEL Basket", "m.06b2z2": "Limoges CSP", "m.06drlz": "France women's national football team", "m.06gd7y": "Strasbourg IG", "m.076_dy9": "French Luge Team", "m.09d8qr": "France men's national ice hockey team", "m.0b_nwg": "France national cricket team", "m.0b25q4": "\u00c9lan B\u00e9arnais Pau-Orthez", "m.0dghw5": "BCM Gravelines", "m.0dghwk": "Cholet Basket", "m.0dghx8": "Chorale Roanne Basket", "m.0dgj84": "Le Mans Sarthe Basket", "m.0fyyrw": "Tarbes Gespe Bigorre", "m.0gksy2": "France national handball team", "m.0gnygq": "France women's national basketball team", "m.0j7lffx": "CJM Bourges Basket"}}, {"question": "what language do native american indians speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059_w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059_w ns:people.ethnicity.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ people , ethnicity , languages spoken ] ) [ Native Americans in the United States ] )", "golden_entities": {"m.059_w": "Native Americans in the United States"}, "answer_entities": {"m.02h40lc": "English Language", "m.064_8sq": "French", "m.06nm1": "Spanish Language", "m.0t_2": "American English"}}, {"question": "where did tennessee williams live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c4y8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c4y8 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Tennessee Williams ] ) )", "golden_entities": {"m.0c4y8": "Tennessee Williams"}, "answer_entities": {"m.04tgp": "Mississippi", "m.06wxw": "St. Louis", "m.0f2tj": "New Orleans", "m.0wptj": "Clarksdale", "m.0wqzb": "Columbus"}}, {"question": "where is port st lucie florida on the map", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rsb4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rsb4 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Port St. Lucie ] )", "golden_entities": {"m.0rsb4": "Port St. Lucie"}, "answer_entities": {"m.02xry": "Florida", "m.09c7w0": "United States of America", "m.0f9080": "Area code 772", "m.0jxjm": "St. Lucie County"}}, {"question": "who juan ponce de leon", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0123f1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0123f1 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Juan Ponce de Le\u00f3n ] )", "golden_entities": {"m.0123f1": "Juan Ponce de Le\u00f3n"}, "answer_entities": {"m.040vc4s": "Explorer"}}, {"question": "where did the loma prieta earthquake occur", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mv1y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mv1y ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ 1989 Loma Prieta earthquake ] )", "golden_entities": {"m.01mv1y": "1989 Loma Prieta earthquake"}, "answer_entities": {"m.06pvr": "San Francisco Bay Area"}}, {"question": "what is time zone in new orleans", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f2tj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f2tj ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ New Orleans ] )", "golden_entities": {"m.0f2tj": "New Orleans"}, "answer_entities": {"m.02fqwt": "Central Time Zone"}}, {"question": "what type of poetry does john donne write", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0413p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0413p ns:book.author.school_or_movement ?x .\n}\n", "logical_form": "( JOIN ( R [ book , author , school or movement ] ) [ John Donne ] )", "golden_entities": {"m.0413p": "John Donne"}, "answer_entities": {"m.01lw_t": "Metaphysical poets"}}, {"question": "where did helen keller die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03ppx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03ppx ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Helen Keller ] )", "golden_entities": {"m.03ppx": "Helen Keller"}, "answer_entities": {"m.0rd55": "Easton"}}, {"question": "where did johann sebastian bach live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_f0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_f0 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Johann Sebastian Bach ] ) )", "golden_entities": {"m.03_f0": "Johann Sebastian Bach"}, "answer_entities": {"m.0135kl": "L\u00fcneburg", "m.01scv0": "K\u00f6then (Anhalt)", "m.047sq2": "M\u00fchlhausen", "m.04kf4": "Leipzig", "m.04pwrt": "Arnstadt", "m.064_v2": "Ohrdruf", "m.0cpyv": "Weimar", "m.0g8gq": "Eisenach"}}, {"question": "what timezone is malaysia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09pmkv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09pmkv ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Malaysia ] )", "golden_entities": {"m.09pmkv": "Malaysia"}, "answer_entities": {"m.0ch2v5": "Malaysia Time Zone"}}, {"question": "where is alex smith from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05dfhp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05dfhp ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Alex Smith ] )", "golden_entities": {"m.05dfhp": "Alex Smith"}, "answer_entities": {"m.010rvx": "Bremerton"}}, {"question": "where was alice walker born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bv70)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bv70 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Alice Walker ] )", "golden_entities": {"m.0bv70": "Alice Walker"}, "answer_entities": {"m.0frf_": "Putnam County"}}, {"question": "when did joe mcelderry won x factor", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09d89qd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09d89qd ns:award.competitor.competitions_won ?x .\n}\n", "logical_form": "( JOIN ( R [ award , competitor , competitions won ] ) [ Joseph McElderry ] )", "golden_entities": {"m.09d89qd": "Joseph McElderry"}, "answer_entities": {"m.06wcg5g": "The X Factor (UK) - Season 6"}}, {"question": "who was the members of blackstreet", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01fm10)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01fm10 ns:music.musical_group.member ?y .\n?y ns:music.group_membership.member ?x .\n}\n", "logical_form": "( JOIN ( R [ music , group membership , member ] ) ( JOIN ( R [ music , musical group , member ] ) [ Blackstreet ] ) )", "golden_entities": {"m.01fm10": "Blackstreet"}, "answer_entities": {"m.01t8c_8": "Eric Williams", "m.01wrbpv": "Edward Theodore Riley", "m.02rnwqn": "Terrell Phillips", "m.03f4qq_": "Chauncey Black", "m.03h1wwg": "Joseph Stonestreet", "m.0b90b2": "Dave Hollister", "m.0dhrg5": "Mark Middleton", "m.0h4xf1r": "Sherman Tinsdale", "m.0h4xf2b": "Levi Little", "m.0l239b8": "Tony Tyler", "m.0wk_8qw": "Lenny Harold"}}, {"question": "what does a american rottweiler look like", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01nw62)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01nw62 ns:base.petbreeds.dog_breed.color ?x .\n}\n", "logical_form": "( JOIN ( R [ base , petbreeds , dog breed , color ] ) [ Rottweiler ] )", "golden_entities": {"m.01nw62": "Rottweiler"}, "answer_entities": {"m.019sc": "Black", "m.037zsb": "Tan", "m.05n23l": "Mahogany"}}, {"question": "who created the character of sherlock holmes", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06rkl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06rkl ns:fictional_universe.fictional_character.character_created_by ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , fictional character , character created by ] ) [ Sherlock Holmes ] )", "golden_entities": {"m.06rkl": "Sherlock Holmes"}, "answer_entities": {"m.0ky1": "Arthur Conan Doyle"}}, {"question": "what does scottish people speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06q1r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06q1r ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Scotland ] )", "golden_entities": {"m.06q1r": "Scotland"}, "answer_entities": {"m.01bvf": "British English", "m.01v58_": "Scottish English", "m.05p2d": "Old English", "m.070zw": "Scottish Gaelic", "m.0h407": "Scots Language"}}, {"question": "who all has kim kardashian dated", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0261x8t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0261x8t ns:base.popstra.celebrity.dated ?y .\n?y ns:base.popstra.dated.participant ?x .\n}\n", "logical_form": "( JOIN ( R [ base , popstra , dated , participant ] ) ( JOIN ( R [ base , popstra , celebrity , dated ] ) [ Kim Kardashian ] ) )", "golden_entities": {"m.0261x8t": "Kim Kardashian"}, "answer_entities": {"m.01d1st": "Nick Cannon", "m.01nr7rn": "Ray J", "m.033t8w": "Ben Roethlisberger", "m.039bpc": "Nick Lachey", "m.0521n6": "Joe Francis", "m.05cb70": "Reggie Bush"}}, {"question": "what channel is the mtv vma awards on", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r470)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r470 ns:award.award.presented_by ?x .\n}\n", "logical_form": "( JOIN ( R [ award , award , presented by ] ) [ MTV Video Music Award ] )", "golden_entities": {"m.01r470": "MTV Video Music Award"}, "answer_entities": {"m.04rqd": "MTV"}}, {"question": "where is usc from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03tw2s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03tw2s ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ University of South Carolina ] )", "golden_entities": {"m.03tw2s": "University of South Carolina"}, "answer_entities": {"m.06yxd": "South Carolina", "m.09c7w0": "United States of America", "m.0fv_t": "Columbia"}}, {"question": "what to see in dallas tx", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f2rq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f2rq ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Dallas ] )", "golden_entities": {"m.0f2rq": "Dallas"}, "answer_entities": {"m.01phy6": "American Airlines Center", "m.01vpjb": "Dealey Plaza", "m.0277mw9": "George W. Bush Presidential Center", "m.0285_gh": "Dallas World Aquarium", "m.02vk8s": "Cotton Bowl", "m.03byk46": "Cavanaugh Flight Museum", "m.03c_nbv": "Dallas County Courthouse", "m.047dvy5": "Dallas Holocaust Museum/Center for Education & Tolerance", "m.059k_2": "Dallas Museum of Art", "m.059l1m": "Nasher Sculpture Center", "m.06cdr9": "Sixth Floor Museum at Dealey Plaza", "m.06h1db": "FC Dallas Stadium", "m.06q9lq": "Texas Theatre", "m.06w96j": "Dallas Zoo", "m.077c_4": "Galleria Dallas", "m.07s8wz": "White Rock Lake", "m.0c4k7b": "Trammell & Margaret Crow Collection of Asian Art", "m.0ct4dp": "Dallas Arboretum and Botanical Garden", "m.0fr_0v": "Meadows Museum", "m.0g9v1q": "AT&T Stadium", "m.0glzkm": "Kay Bailey Hutchison Convention Center"}}, {"question": "what is president abraham lincoln known for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Abraham Lincoln ] )", "golden_entities": {"m.0gzh": "Abraham Lincoln"}, "answer_entities": {"m.016fc2": "Statesman", "m.04gc2": "Lawyer", "m.0fj9f": "Politician"}}, {"question": "what year did the vietnam war happen", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_nf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_nf ns:time.event.start_date ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , start date ] ) [ Vietnam War ] )", "golden_entities": {"m.07_nf": "Vietnam War"}, "answer_entities": {"value": "1955-11-01"}}, {"question": "who inspired antonio vivaldi", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pth)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pth ns:influence.influence_node.influenced ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced ] ) [ Antonio Vivaldi ] )", "golden_entities": {"m.0pth": "Antonio Vivaldi"}, "answer_entities": {"m.03_f0": "Johann Sebastian Bach"}}, {"question": "who started up mcdonalds", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07gyp7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07gyp7 ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ McDonald's ] )", "golden_entities": {"m.07gyp7": "McDonald's"}, "answer_entities": {"m.01n4dv": "Ray Kroc", "m.0wf57dc": "Richard McDonald", "m.0wf5829": "Maurice McDonald"}}, {"question": "what is st james palace", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01yv_q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01yv_q ns:architecture.building.building_function ?x .\n}\n", "logical_form": "( JOIN ( R [ architecture , building , building function ] ) [ St James's Palace ] )", "golden_entities": {"m.01yv_q": "St James's Palace"}, "answer_entities": {"m.05zp8": "Palace"}}, {"question": "what airport to fly into to get to clearwater florida", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rqyx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rqyx ns:location.location.nearby_airports ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , nearby airports ] ) [ Clearwater ] )", "golden_entities": {"m.0rqyx": "Clearwater"}, "answer_entities": {"m.03d2j65": "Clearwater Air Park"}}, {"question": "what currency do they use in qatar", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0697s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0697s ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Qatar ] )", "golden_entities": {"m.0697s": "Qatar"}, "answer_entities": {"m.05lf7w": "Qatari riyal"}}, {"question": "what did thoreau die from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bwx3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bwx3 ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Henry David Thoreau ] )", "golden_entities": {"m.0bwx3": "Henry David Thoreau"}, "answer_entities": {"m.07jwr": "Tuberculosis"}}, {"question": "who is carl edwards racing for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059s1q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059s1q ns:base.nascar.nascar_driver.team ?x .\n}\n", "logical_form": "( JOIN ( R [ base , nascar , nascar driver , team ] ) [ Carl Edwards ] )", "golden_entities": {"m.059s1q": "Carl Edwards"}, "answer_entities": {"m.06l92_": "Roush Fenway Racing"}}, {"question": "where are the florida marlins from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02__x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02__x ns:sports.sports_team.location ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , location ] ) [ Miami Marlins ] )", "golden_entities": {"m.02__x": "Miami Marlins"}, "answer_entities": {"m.03msbs": "Little Havana", "m.0f2v0": "Miami"}}, {"question": "what language does romanian people speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c1y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c1y ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Romania ] )", "golden_entities": {"m.06c1y": "Romania"}, "answer_entities": {"m.012psb": "Romani language", "m.02hxc3j": "Romanian Language", "m.02ztjwg": "Hungarian language", "m.08p4cr": "Torlakian dialect", "m.0cjk9": "Ukrainian Language"}}]