[{"question": "what is there to do around austin texas", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0vzm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0vzm ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Austin ] )", "golden_entities": {"m.0vzm": "Austin"}, "answer_entities": {"m.0163ss": "Lady Bird Lake", "m.0163z0": "Zilker Park", "m.0165v1": "Lake Austin", "m.02j53x": "Texas State Capitol", "m.02pvcrn": "William Sidney Porter House", "m.02rlk08": "Ann W. Richards Congress Avenue Bridge", "m.02vr6yr": "Texas Memorial Museum", "m.03s9xh": "Harry Ransom Center", "m.03xlkf": "Barton Springs Pool", "m.055p3fc": "Cathedral of Junk", "m.05r95y": "Lyndon Baines Johnson Library and Museum", "m.0bxyz_": "Blanton Museum of Art", "m.0fljtq": "Bullock Texas State History Museum", "m.0fpc1v3": "Texas Department of Public Safety Historical Museum and Research Center", "m.0jwl321": "Lady Bird Johnson Wildflower Center", "m.0vzsjtm": "Austin Aquarium"}}, {"question": "what kind of money do the netherlands use", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059j2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059j2 ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Netherlands ] )", "golden_entities": {"m.059j2": "Netherlands"}, "answer_entities": {"m.02l6h": "Euro", "m.09nqf": "United States Dollar"}}, {"question": "who is henry david thoreau", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bwx3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bwx3 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Henry David Thoreau ] )", "golden_entities": {"m.0bwx3": "Henry David Thoreau"}, "answer_entities": {"m.02h6fbs": "Philosopher", "m.05z96": "Poet", "m.0cbd2": "Writer"}}, {"question": "who are richard pryor children", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01hmk9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01hmk9 ns:people.person.children ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , children ] ) [ Richard Pryor ] )", "golden_entities": {"m.01hmk9": "Richard Pryor"}, "answer_entities": {"m.05z2sbw": "Kelsey Pryor", "m.05z2sc1": "Franklin Pryor", "m.05z2scg": "Elizabeth Pryor", "m.05z2scn": "Richard Pryor Jr.", "m.05z2scv": "Steven Pryor", "m.06xlb2": "Rain Pryor"}}, {"question": "what club did santi cazorla play for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0264yjz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0264yjz ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Santi Cazorla ] ) )", "golden_entities": {"m.0264yjz": "Santi Cazorla"}, "answer_entities": {"m.02w64f": "Spain national football team", "m.03fnrc": "M\u00e1laga CF", "m.03tck1": "Villarreal CF", "m.04f1glf": "Villarreal CF B", "m.0ksy_": "Recreativo de Huelva", "m.0xbm": "Arsenal F.C."}}, {"question": "where does the atlanta braves play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0x2p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0x2p ns:sports.sports_team.arena_stadium ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Atlanta Braves ] )", "golden_entities": {"m.0x2p": "Atlanta Braves"}, "answer_entities": {"m.020fp1": "Turner Field", "m.0ctrnf": "State Mutual Stadium"}}, {"question": "what year did detroit pistons win nba championships", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jm8l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jm8l ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Detroit Pistons ] )", "golden_entities": {"m.0jm8l": "Detroit Pistons"}, "answer_entities": {"m.07p0zz": "2004 NBA Finals", "m.08x9rj": "1990 NBA Finals", "m.08x9tm": "1989 NBA Finals"}}, {"question": "what political party did john bell belong to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035vw8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035vw8 ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n", "logical_form": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ John Bell ] ) )", "golden_entities": {"m.035vw8": "John Bell"}, "answer_entities": {"m.01s0cz": "Know Nothing", "m.01spy8": "National Republican Party", "m.02_dv1": "Constitutional Union Party", "m.07wdw": "Whig Party", "m.07wf9": "Democratic-Republican Party", "m.0d075m": "Democratic Party"}}, {"question": "what religion is mary queen of scots", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.055l1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.055l1 ns:people.person.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , religion ] ) [ Mary, Queen of Scots ] )", "golden_entities": {"m.055l1": "Mary, Queen of Scots"}, "answer_entities": {"m.0c8wxp": "Catholicism"}}, {"question": "where is port st johns florida", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rhs4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rhs4 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Port St. John ] )", "golden_entities": {"m.0rhs4": "Port St. John"}, "answer_entities": {"m.02xry": "Florida", "m.09c7w0": "United States of America", "m.0jgj7": "Brevard County"}}, {"question": "what teams does kroenke own", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dg6f6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dg6f6 ns:sports.sports_team_owner.teams_owned ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team owner , teams owned ] ) [ Stan Kroenke ] )", "golden_entities": {"m.0dg6f6": "Stan Kroenke"}, "answer_entities": {"m.01kkjq": "Colorado Rapids", "m.06x76": "St. Louis Rams", "m.0jbqf": "Colorado Avalanche", "m.0jmdb": "Denver Nuggets", "m.0xbm": "Arsenal F.C."}}, {"question": "where was the battle of shiloh", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0127mr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0127mr ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ Battle of Shiloh ] )", "golden_entities": {"m.0127mr": "Battle of Shiloh"}, "answer_entities": {"m.07h34": "Tennessee", "m.0mtch": "Hardin County"}}, {"question": "where is kate spade from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bkdx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bkdx ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Kate Spade ] )", "golden_entities": {"m.06bkdx": "Kate Spade"}, "answer_entities": {"m.04f_d": "Kansas City"}}, {"question": "what countries are in the caribbean", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0261m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0261m ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ Caribbean ] ) )", "golden_entities": {"m.0261m": "Caribbean", "m.01mp": "Country"}, "answer_entities": {"m.0162v": "Barbados", "m.0168t": "British Virgin Islands", "m.02phy_9": "Collectivity of Saint Martin", "m.05byy": "Netherlands Antilles", "m.05r7t": "Puerto Rico", "m.06ryl": "Saint Kitts and Nevis", "m.06s0l": "Saint Lucia", "m.0bwhs8r": "Caribbean special municipalities of the Netherlands", "m.0n3g": "Anguilla"}}, {"question": "what party was woodrow wilson from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.083q7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.083q7 ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n", "logical_form": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Woodrow Wilson ] ) )", "golden_entities": {"m.083q7": "Woodrow Wilson"}, "answer_entities": {"m.0d075m": "Democratic Party"}}, {"question": "what did ben hall do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08sx40)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08sx40 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Ben Hall ] )", "golden_entities": {"m.08sx40": "Ben Hall"}, "answer_entities": {"m.0fckr": "Bushranger"}}, {"question": "what division did the baltimore colts play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03wnh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03wnh ns:american_football.football_team.division ?x .\n}\n", "logical_form": "( JOIN ( R [ american football , football team , division ] ) [ Indianapolis Colts ] )", "golden_entities": {"m.03wnh": "Indianapolis Colts"}, "answer_entities": {"m.068g_2": "AFC South"}}, {"question": "what ethnicity are people from iran", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04nrnz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04nrnz ns:people.ethnicity.includes_groups ?x .\n}\n", "logical_form": "( JOIN ( R [ people , ethnicity , includes groups ] ) [ Iranian peoples ] )", "golden_entities": {"m.04nrnz": "Iranian peoples"}, "answer_entities": {"m.03nvq": "Hazaras", "m.09743": "Pashtun", "m.09f5v": "Tajiks", "m.0bymc": "Parsi", "m.0c29q8": "Irani", "m.0h9bz": "Baloch people"}}, {"question": "what country did francis drake represent", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.031t2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.031t2 ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Francis Drake ] )", "golden_entities": {"m.031t2": "Francis Drake"}, "answer_entities": {"m.024pcx": "Kingdom of England", "m.02jx1": "England"}}, {"question": "what timezone is indianapolis indiana in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ftxw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ftxw ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Indianapolis ] )", "golden_entities": {"m.0ftxw": "Indianapolis"}, "answer_entities": {"m.02hcv8": "Eastern Time Zone"}}, {"question": "what books did lincoln write", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:book.author.works_written ?x .\n}\n", "logical_form": "( JOIN ( R [ book , author , works written ] ) [ Abraham Lincoln ] )", "golden_entities": {"m.0gzh": "Abraham Lincoln"}, "answer_entities": {"m.05c_79h": "Of the People, By the People, For the People", "m.05c_f7l": "This Fiery Trial: The Speeches and Writings of Abraham Lincoln", "m.05yq8nb": "Lincoln on Race and Slavery", "m.066yn4z": "The Portable Abraham Lincoln", "m.0673mv3": "The Papers of Abraham Lincoln: Legal Documents and Cases", "m.068b0v9": "Selections From the Works of Abraham Lincoln", "m.068nrrf": "Lincoln's Devotional", "m.069bhf3": "Anecdotes Of Abraham Lincoln And Lincoln's Stories", "m.06cygqy": "Gems from Abraham Lincoln", "m.06dyrpv": "Life and Public Services", "m.06fl0v_": "Poems of Abraham Lincoln", "m.06g06ld": "The Writings of Abraham Lincoln", "m.06g1chq": "Complete Works Of Abraham Lincoln V10", "m.06g3j11": "Letters And Addresses of Abraham Lincoln", "m.06gqt1k": "Lincoln Dictionary", "m.06hmfmc": "4 Speeches by Abraham Lincoln", "m.06hn5dd": "Calligraphy Is Fun", "m.06j5xzx": "Speeches and Letters of Abraham Lincoln, 1832-1865", "m.06kjp__": "A Place to Live", "m.06krc3w": "A review of the work done by the Church Missioanry Society in South India between the years 1816 to 1850", "m.06l5jgq": "An Anthology Of The Epigrams And Sayings Of Abraham Lincoln", "m.06lt3v9": "The Collected Works of Abraham Lincoln/First Supplement 1832-1865", "m.06mgy7c": "The Life And Public Service Of General Zachary Taylor", "m.06mngvt": "Hunt Speedball Calligraphy Workbook", "m.06mzpmv": "The Address of the Hon. Abraham Lincoln, in", "m.06n0txx": "The Gettysburg Address and Other Speeches", "m.06ncmyq": "Art of Illumination Classic French Manuscript", "m.06q__t8": "Message Of The President Of The United States, And Accompanying Documents To The Two Houses Of Congress", "m.06rlzdx": "Wisdom and Wit", "m.06v7q2v": "State Of The Union Addresses", "m.06vlrpv": "My Life as Abraham Lincoln", "m.0bhjd84": "Abraham Lincoln's autobiography", "m.0bhjd87": "The Gettysburg address and a portrait", "m.0bhjd8b": "Lincoln's autobiography", "m.0bhjd8f": "Lincoln's Kalamazoo address against extending slavery", "m.0bhjd8j": "The words of Abraham Lincoln", "m.0bqqy7y": "Discoveries and inventions", "m.0bqqy82": "A letter ... in reply to an invitation to address a meeting in honor of the birthday of Thomas Jefferson", "m.0bqqy87": "Lincoln letters", "m.0bqqy8d": "Lincoln's last speech in Springfield in the campaign of 1858", "m.0bqqy8k": "Political debates between Abraham Lincoln and Stephen A. Douglas in the celebrated campaign of 1858 in Illinois", "m.0bqqy8q": "The Speeches of Abraham Lincoln, including inaugurals and proclamations; with biographical introductions and prefatory notes", "m.0c1t0dg": "Abraham Lincoln", "m.0c1t0dk": "Abraham Lincoln's pen and voice", "m.0c1t0dn": "Abraham Lincoln's second inaugural address, March 4, 1865", "m.0c1t0dr": "Address of Abraham Lincoln", "m.0c1t0dv": "An autobiography of Abraham Lincoln", "m.0c1t0dy": "Collected works", "m.0c1t0f0": "Complete works", "m.0c1t0f3": "Complete works of Abraham Lincoln", "m.0c1t0f6": "Created equal?", "m.0c1t0f9": "Debates of Lincoln & Douglas", "m.0c1t0fd": "In Lincoln's hand", "m.0c1t0fh": "Life and works of Abraham Lincoln", "m.0c1t0fl": "The life and writings of Abraham Lincoln", "m.0c1t0fp": "Lincoln's inaugurals, the Emancipation proclamation, etc", "m.0c1t0fs": "The literary works of Abraham Lincoln", "m.0c1t0fw": "New Letters and papers of Lincoln", "m.0c1t0fz": "Papers, 1833-1916", "m.0c1t0g1": "The political thought of Abraham Lincoln", "m.0c1t0g4": "Quotations from Abraham Lincoln", "m.0c1t0g7": "Selected writings of Abraham Lincoln", "m.0c1t0gb": "Selections from the letters, speeches, and state papers of Abraham Lincoln", "m.0c1t0gf": "Speeches and writings 1832-1858", "m.0c1t0gj": "Speeches and writings 1859-1865", "m.0c1t0gm": "The table talk of Abraham Lincoln", "m.0c1t0gq": "Words of Lincoln", "m.0chv00": "Birchard Letter", "m.0py1qgr": "President Lincoln's 75,000 Volunteers", "m.0y4kc50": "Partial Personal Journal of Abraham Lincoln"}}, {"question": "what did corey haim act in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kyn0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kyn0 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Corey Haim ] ) )", "golden_entities": {"m.01kyn0": "Corey Haim"}, "answer_entities": {"m.016kmf": "Murphy's Romance", "m.02vn90b": "Universal Groove", "m.02xb1zf": "Lost Boys: The Tribe", "m.031ssn": "The Lost Boys", "m.034vk8": "Lucas", "m.036k42": "National Lampoon's Last Resort", "m.03gtwh_": "Crank: High Voltage", "m.04gph00": "Shark City", "m.05g12v": "Silver Bullet", "m.06zn6ky": "Trade In", "m.07x6zk": "Dickie Roberts: Former Child Star", "m.080cw8": "License to Drive", "m.08c18v": "The Backlot Murders", "m.08cjtf": "Secret Admirer", "m.09bdph": "Dream Machine", "m.09bfrf": "Dream a Little Dream", "m.09djr_": "Demolition University", "m.09gqhc": "Fast Getaway", "m.09hd1l": "Watchers", "m.09jkqt": "Prayer of the Rollerboys", "m.09jlst": "Oh, What a Night", "m.09jnbv": "Blown Away", "m.09jnjc": "The Double 0 Kid", "m.09kk_4": "Fever Lake", "m.09kktv": "Demolition High", "m.09kml0": "Firstborn", "m.09kpss": "Life 101", "m.09kq4h": "Dream a Little Dream 2", "m.09kqbg": "Busted", "m.09kqwb": "Anything for Love", "m.09kv40": "Fast Getaway II", "m.09kvhc": "Snowboard Academy", "m.09lfqv": "Never Too Late", "m.0b6h4fc": "Lost Boys: The Thirst", "m.0b8s869": "A Time to Live", "m.0bv8vqd": "American Sunset", "m.0bwhk07": "Merlin: The Quest Begins", "m.0h0znl7": "Starz Inside: Bloodsucking Cinema", "m.0h4yh2k": "Decisions"}}, {"question": "who is the publisher of the wall street journal", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.017b3j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.017b3j ns:book.newspaper.owner ?x .\n}\n", "logical_form": "( JOIN ( R [ book , newspaper , owner ] ) [ The Wall Street Journal ] )", "golden_entities": {"m.017b3j": "The Wall Street Journal"}, "answer_entities": {"m.0clj7": "Dow Jones & Company", "m.0sxdg": "News Corporation"}}, {"question": "what do tibetan people speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01l0ty)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01l0ty ns:people.ethnicity.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ people , ethnicity , languages spoken ] ) [ Tibetan people ] )", "golden_entities": {"m.01l0ty": "Tibetan people"}, "answer_entities": {"m.01kbdv": "Tibetan languages", "m.01r2l": "Chinese language", "m.02hx61y": "Baima Language", "m.02hx8f0": "Muya Language", "m.064r7fk": "Standard Tibetan", "m.0h0t4": "Nepali Language"}}, {"question": "what form of government does afghanistan have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jdd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jdd ns:location.country.form_of_government ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , form of government ] ) [ Afghanistan ] )", "golden_entities": {"m.0jdd": "Afghanistan"}, "answer_entities": {"m.01fgl7": "Islamic republic"}}, {"question": "what position did john stockton play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r6lw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r6lw ns:basketball.basketball_player.position_s ?x .\n}\n", "logical_form": "( JOIN ( R [ basketball , basketball player , position s ] ) [ John Stockton ] )", "golden_entities": {"m.01r6lw": "John Stockton"}, "answer_entities": {"m.02sf_r": "Point guard"}}, {"question": "who played bernie focker", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.087gyr3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.087gyr3 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Bernie Focker ] ) )", "golden_entities": {"m.087gyr3": "Bernie Focker"}, "answer_entities": {"m.0bl2g": "Dustin Hoffman"}}, {"question": "where is universal studios california theme park", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qsy8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qsy8 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ location , location , containedby ] ) [ Universal Studios Hollywood ] ) )", "golden_entities": {"m.05qsy8": "Universal Studios Hollywood", "m.01m9": "City/Town/Village"}, "answer_entities": {"m.0285tn": "Universal City"}}, {"question": "where the grimm brothers were born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.046nx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.046nx ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Jacob Grimm ] )", "golden_entities": {"m.046nx": "Jacob Grimm"}, "answer_entities": {"m.028_0l": "Hanau"}}, {"question": "what sport is popular in china", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d05w3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d05w3 ns:sports.sports_team_location.teams ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team location , teams ] ) [ China ] )", "golden_entities": {"m.0d05w3": "China"}, "answer_entities": {"m.026p73l": "China women's national softball team", "m.026wfcr": "China national under-23 football team", "m.02p_3xb": "China Davis Cup team", "m.02r4hn_": "China Fed Cup team", "m.02v_s16": "China men's national ice hockey team", "m.03c1v2g": "China women's national rugby union team", "m.03d1rtp": "China national korfball team", "m.03gt8qn": "China women's national handball team", "m.03lygq": "China national football team", "m.03qhjj9": "China women's national volleyball team", "m.03qhjys": "China men's national volleyball team", "m.03tx5m": "Shanghai Sharks", "m.03ylztx": "China women's national basketball team", "m.04_12zx": "China men's national junior ice hockey team", "m.043rwjh": "China national handball team", "m.04gqs4t": "China men's national water polo team", "m.04gwb2l": "China women's national water polo team", "m.04mz1tr": "China national beach soccer team", "m.04n0n07": "China national under-20 football team", "m.04n43m5": "China women's national under-20 football team", "m.04n4zfv": "China national under-17 football team", "m.04n53nh": "China women's national under-17 football team", "m.04n5qgw": "China national futsal team", "m.04qbn26": "Qingdao DoubleStar", "m.051xccw": "Zhejiang Lions", "m.0521w0d": "Tianjin Ronggang", "m.05p_j5": "Liaoning Flying Leopards", "m.05q1_v": "Bayi Rockets", "m.05q1wm": "Beijing Ducks", "m.05q21y": "Jilin Northeast Tigers", "m.05q230": "Foshan Dralions", "m.05q24s": "Shandong Lions", "m.05q264": "Shanxi Zhongyu", "m.05q26v": "Jiangsu Dragons", "m.05q27j": "Guangdong Southern Tigers", "m.05q2bb": "Zhejiang Golden Bulls", "m.05q2d5": "Fujian Sturgeons", "m.05qdgz": "China women's national ice hockey team", "m.069_v9b": "Bayi Yiyang High-Tech District", "m.074zsw": "China women's national football team", "m.08x_xh": "Dongguan Leopards", "m.0bwvnm": "China national baseball team", "m.0gczkp": "China men's national basketball team", "m.0glgx6": "China national cricket team", "m.0h31g8": "China women's national cricket team"}}, {"question": "who made the ancient egyptian pyramids", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.036mk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.036mk ns:base.worldwonders.ancient_wonder.wonder_creator ?x .\n}\n", "logical_form": "( JOIN ( R [ base , worldwonders , ancient wonder , wonder creator ] ) [ Great Pyramid of Giza ] )", "golden_entities": {"m.036mk": "Great Pyramid of Giza"}, "answer_entities": {"m.0kg9": "Ancient Egypt"}}, {"question": "where did the san diego chargers originate", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06rpd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06rpd ns:sports.sports_team.previously_known_as ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , previously known as ] ) [ San Diego Chargers ] )", "golden_entities": {"m.06rpd": "San Diego Chargers"}, "answer_entities": {"m.06mprtt": "Los Angeles Chargers"}}, {"question": "who was king george v father", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cmpn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cmpn ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ George V ] ) )", "golden_entities": {"m.0cmpn": "George V", "m.05zppz": "Male"}, "answer_entities": {"m.0cm03": "Edward VII"}}, {"question": "what happened to nagasaki", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05gqf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05gqf ns:location.location.events ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , events ] ) [ Nagasaki ] )", "golden_entities": {"m.05gqf": "Nagasaki"}, "answer_entities": {"m.010s1gny": "Shinee World 2014", "m.035jnk": "Atomic bombings of Hiroshima and Nagasaki", "m.0czc6wq": "Miss International 1986"}}, {"question": "what movies did james franco play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05bnp0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05bnp0 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ James Franco ] ) )", "golden_entities": {"m.05bnp0": "James Franco"}, "answer_entities": {"g.11b7f0w03f": "Wild Horses", "g.11b7k0v3hq": "In Dubious Battle", "m.010pdd45": "The Sound and the Fury", "m.010qclb4": "The Adderall Diaries", "m.0125_5q5": "Zeroville", "m.012s1d": "Spider-Man", "m.0135_65p": "The Long Home", "m.026_5f7": "James Dean", "m.027bbtg": "The Dead Girl", "m.02825nf": "Pineapple Express", "m.02vmj_0": "In the Valley of Elah", "m.02wgk1": "Spider-Man 2", "m.031dtk": "The Company", "m.0340hj": "Spider-Man 3", "m.03c3tpw": "Nights in Rodanthe", "m.03hkch7": "Milk", "m.0411ygx": "At Any Cost", "m.04j0plv": "Mother Ghost", "m.04mzkcp": "Sonny", "m.04p2fy8": "Camille", "m.06ksnc": "Never Been Kissed", "m.073cyc": "The Great Raid", "m.073f2t": "Deuces Wild", "m.07k8rt4": "The Green Hornet", "m.07kdkfj": "Eat Pray Love", "m.07kg878": "Your Highness", "m.080lkt7": "Howl", "m.0830vk": "The Holiday", "m.0907zk": "Tristan & Isolde", "m.09gb_4p": "127 Hours", "m.09v_zl": "City by the Sea", "m.09v54x": "Annapolis", "m.0bbd8t9": "Grasshopper", "m.0bppn_": "Mean People Suck", "m.0btyf5z": "Rise of the Planet of the Apes", "m.0bvn25": "Knocked Up", "m.0c34n5": "Whatever It Takes", "m.0crrmdj": "Some Body", "m.0crthhx": "The Ape", "m.0crtslz": "Wholphin: Issue 8", "m.0crw8tk": "Good Time Max", "m.0crxlns": "Celebrating AFI", "m.0ct37m0": "Fool's Gold", "m.0dk297": "An American Crime", "m.0dk937": "Flyboys", "m.0dqcs3": "The Wicker Man", "m.0fvbd5": "Interview", "m.0g57n3s": "Love & Distrust", "m.0g7pm1": "Date Night", "m.0g9_64m": "The Iceman", "m.0ghhrl8": "To Serve and Protect", "m.0gjcnch": "Shadows and Lies", "m.0gwz9sl": "The Letter", "m.0gx160j": "The Broken Tower", "m.0gxbc__": "Blind Spot", "m.0gxbcvz": "Rebel", "m.0gxbcw8": "Masculinity & Me", "m.0gxbd09": "The Car Kid", "m.0gxbd16": "If Tomorrow Comes", "m.0gxbd1r": "1973", "m.0gysshc": "Oz the Great and Powerful", "m.0gywj6f": "About Cherry", "m.0gz5fq": "Finishing the Game", "m.0h25k5l": "Maladies", "m.0hn8s1j": "Charles & Ray Eames: The Architect and the Painter", "m.0hr256b": "Spring Breakers", "m.0hz4j2j": "This Is the End", "m.0j2b8qf": "Lovelace", "m.0jmx259": "Sal", "m.0n05bkp": "Dawn of the Planet of the Apes", "m.0nfljp9": "Homefront", "m.0ngns90": "Queen of the Desert", "m.0ngxr14": "Tar", "m.0ngxr4w": "The Third Person", "m.0q2lm3f": "Interior. Leather Bar.", "m.0t51133": "As I Lay Dying", "m.0tl4n6t": "Child of God", "m.0v1zf3t": "The Garden of Last Days", "m.0v25xrh": "The Ten O'Clock People", "m.0v26gl_": "Palo Alto", "m.0v275l3": "Good People", "m.0v39cn4": "Every Thing Will Be Fine", "m.0w1fbk2": "Veronica Mars", "m.0w4swb_": "True Story", "m.0ztkpwz": "The Interview", "m.0zwqnxs": "Sausage Party"}}, {"question": "what to do in palo alto ca with kids", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f04c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f04c ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Palo Alto ] )", "golden_entities": {"m.0f04c": "Palo Alto"}, "answer_entities": {"m.029fr3": "Iris & B. Gerald Cantor Center for Visual Arts", "m.02mw8v": "Stanford Shopping Center", "m.02q09z8": "Professorville", "m.04fx6c": "Stanford Memorial Church", "m.06_4n7_": "Hewlett-Packard House and Garage", "m.0878f": "PARC", "m.097pyg": "Hoover Tower", "m.0bmnsf": "Arastradero Preserve", "m.0gfflw8": "Palo Alto Baylands Nature Preserve", "m.0j67y9q": "Leland Stanford Junior University Museum of Art", "m.0jwjx3f": "SLAC National Accelerator Laboratory"}}, {"question": "what country did jacques cartier came from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j8t3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j8t3 ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Jacques Cartier ] )", "golden_entities": {"m.0j8t3": "Jacques Cartier"}, "answer_entities": {"m.0f8l9c": "France"}}, {"question": "what represents ghana", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035dk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035dk ns:symbols.flag_referent.flag ?y .\n?y ns:symbols.flag_use.flag ?x .\n}\n", "logical_form": "( JOIN ( R [ symbols , flag use , flag ] ) ( JOIN ( R [ symbols , flag referent , flag ] ) [ Ghana ] ) )", "golden_entities": {"m.035dk": "Ghana"}, "answer_entities": {"m.02c0s8": "Flag of Ghana"}}]