[{"question": "what did martin luther king jr go to college for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:people.person.education ?y .\n?y ns:education.education.major_field_of_study ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , major field of study ] ) ( JOIN ( R [ people , person , education ] ) [ Martin Luther King, Jr. ] ) )", "golden_entities": {"m.051cc": "Martin Luther King, Jr."}, "answer_entities": {"m.0329p4": "Systematic theology", "m.06ms6": "Sociology"}}, {"question": "where did sir ernest shackleton come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gbcz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gbcz ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Sir Ernest Shackleton ] )", "golden_entities": {"m.0gbcz": "Sir Ernest Shackleton"}, "answer_entities": {"m.07s6dm7": "Kilkea"}}, {"question": "what made jimi hendrix great", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vsy3q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vsy3q ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Jimi Hendrix ] )", "golden_entities": {"m.01vsy3q": "Jimi Hendrix"}, "answer_entities": {"m.012qdp": "Military Officer", "m.01c72t": "Composer", "m.039v1": "Guitarist", "m.09jwl": "Musician", "m.09l65": "Singer", "m.09wct1s": "Music Producer", "m.09x_r": "Entrepreneur", "m.0dz3r": "Record producer", "m.0fq0t_c": "Music artist", "m.0n1h": "Artist", "m.0nbcg": "Songwriter"}}, {"question": "who did aaron rodgers play college football 4", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04q06_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04q06_ ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.school ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league draft pick , school ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Aaron Rodgers ] ) )", "golden_entities": {"m.04q06_": "Aaron Rodgers"}, "answer_entities": {"m.02zd460": "University of California, Berkeley"}}, {"question": "who plays nathan scott", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09p1z3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09p1z3 ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Nathan Scott ] ) )", "golden_entities": {"m.09p1z3": "Nathan Scott"}, "answer_entities": {"m.0532c_": "James Lafferty"}}, {"question": "when did the houston rockets win the championship", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jmfb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jmfb ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Houston Rockets ] )", "golden_entities": {"m.0jmfb": "Houston Rockets"}, "answer_entities": {"m.08x9cq": "1994 NBA Finals", "m.08x9k6": "1995 NBA Finals"}}, {"question": "where is mount whitney", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01jlyt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01jlyt ns:geography.mountain.mountain_range ?x .\n}\n", "logical_form": "( JOIN ( R [ geography , mountain , mountain range ] ) [ Mount Whitney ] )", "golden_entities": {"m.01jlyt": "Mount Whitney"}, "answer_entities": {"m.0db94": "Sierra Nevada"}}, {"question": "who created the character of romeo", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02qnhw1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02qnhw1 ns:fictional_universe.fictional_character.character_created_by ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , fictional character , character created by ] ) [ Romeo ] )", "golden_entities": {"m.02qnhw1": "Romeo"}, "answer_entities": {"m.081k8": "William Shakespeare"}}, {"question": "where is puntland somalia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01hywq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01hywq ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Puntland ] )", "golden_entities": {"m.01hywq": "Puntland"}, "answer_entities": {"m.06tgw": "Somalia"}}, {"question": "what is kareem abdul jabbar real name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.049sb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.049sb ns:base.schemastaging.context_name.official_name ?x .\n}\n", "logical_form": "( JOIN ( R [ base , schemastaging , context name , official name ] ) [ Kareem Abdul-Jabbar ] )", "golden_entities": {"m.049sb": "Kareem Abdul-Jabbar"}, "answer_entities": {"value": "Ferdinand Lewis Alcindor, Jr."}}, {"question": "what countries fall in eastern europe", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09b69)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09b69 ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ Eastern Europe ] ) )", "golden_entities": {"m.09b69": "Eastern Europe", "m.01mp": "Country"}, "answer_entities": {"m.015qh": "Bulgaria", "m.01rdm0": "Kingdom of Romania", "m.01rhrd": "Socialist Federal Republic of Yugoslavia", "m.021hd9": "Grand Duchy of Lithuania", "m.03msdy": "Belarusian People's Republic", "m.03pn9": "Second Polish Republic", "m.04w4s": "Moldova", "m.06c1y": "Romania", "m.08z6cq": "Belarusian Central Council", "m.0c81v": "Kievan Rus'", "m.0d0kn": "Georgia"}}, {"question": "what are taylor swift 's albums", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dl567)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dl567 ns:music.artist.album ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , album ] ) [ Taylor Swift ] )", "golden_entities": {"m.0dl567": "Taylor Swift"}, "answer_entities": {"g.11b6hzvg95": "Shake It Off", "g.11b7_l6mtp": "Bad Blood", "g.11btzxkr6h": "Teardrops on My Guitar", "g.12hhhh17b": "iTunes Live From SoHo", "m.011lmhtd": "Shake It Off", "m.011lmk0n": "1989", "m.012_y_jq": "You Are In Love", "m.012mpq38": "Red", "m.012wtwn0": "Blank Space", "m.012yb9pt": "Fifteen", "m.013022f7": "Wonderland", "m.013780bj": "Haunted (acoustic version)", "m.01384jbf": "Style", "m.03cl661": "Sounds of the Season: The Taylor Swift Holiday Collection", "m.03g7rsz": "Taylor Swift", "m.04fzl64": "Beautiful Eyes", "m.04glrxj": "Fearless", "m.0cmdv8y": "Speak Now", "m.0dx87fz": "You Belong With Me", "m.0dyfhdr": "Change", "m.0f9j46z": "Love Story", "m.0fsvq5r": "Mine", "m.0h32z_v": "Stripped Raw & Real", "m.0h64xty": "Speak Now - World Tour Live", "m.0kt11l5": "We Are Never Ever Getting Back Together", "m.0l8mh7y": "Red", "m.0ncnjcy": "Ronan", "m.0np7lyc": "Back to December", "m.0np8z3z": "You're Not Sorry (CSI Remix)", "m.0q8fd99": "I Knew You Were Trouble", "m.0qbj764": "State of Grace", "m.0qcj7kz": "Mean", "m.0qdjmwp": "Ours", "m.0qhct4y": "Begin Again", "m.0qhcyx7": "Safe & Sound", "m.0qhdszl": "If This Was a Movie", "m.0qs2v1z": "Highway Don't Care", "m.0rzq3vt": "Red", "m.0v90pw0": "Today Was a Fairytale", "m.0v90yqv": "22", "m.0v90ysy": "Eyes Open", "m.0v90yvp": "Long Live", "m.0v90ywq": "Connect Set", "m.0w1gb4n": "Rhapsody Originals", "m.0w1gbng": "Speak Now", "m.0w1gbxc": "American Girl", "m.0w1gc7j": "You're Not Sorry", "m.0w1gcgg": "Breathe", "m.0w1gcr6": "Everything Has Changed", "m.0xnlcw8": "Tim McGraw", "m.0xnldx7": "Teardrops on My Guitar", "m.0xnlfj0": "Our Song", "m.0xnlg6g": "Picture to Burn", "m.0xnlgv6": "Should've Said No", "m.0xnlhtx": "White Horse", "m.0xnljbl": "Crazier", "m.0xnlk03": "Fifteen", "m.0xnln6f": "Fearless", "m.0xnlptf": "The Story of Us", "m.0xnltf5": "Sparks Fly", "m.0y603xz": "The Last Time", "m.0ychqg1": "Everything Has Changed (Remix)", "m.0ymh9t3": "Sweeter Than Fiction", "m.0zt7wlh": "CMT Crossroads"}}, {"question": "when was mary poppins made", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kcn7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kcn7 ns:film.film.initial_release_date ?x .\n}\n", "logical_form": "( JOIN ( R [ film , film , initial release date ] ) [ Mary Poppins ] )", "golden_entities": {"m.0kcn7": "Mary Poppins"}, "answer_entities": {"value": "1964-08-27"}}, {"question": "what did king edward vi died from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02s82)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02s82 ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Edward VI of England ] )", "golden_entities": {"m.02s82": "Edward VI of England"}, "answer_entities": {"m.07jwr": "Tuberculosis"}}, {"question": "who did johnny bench play for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0476l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0476l ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Johnny Bench ] ) )", "golden_entities": {"m.0476l": "Johnny Bench"}, "answer_entities": {"m.01ypc": "Cincinnati Reds"}}, {"question": "where is napoleon buried", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j5b8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j5b8 ns:people.deceased_person.place_of_burial ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Napoleon Bonaparte ] )", "golden_entities": {"m.0j5b8": "Napoleon Bonaparte"}, "answer_entities": {"m.0gxqj": "Les Invalides"}}, {"question": "what to see and do in galway ireland", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0m__z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0m__z ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Galway ] )", "golden_entities": {"m.0m__z": "Galway"}, "answer_entities": {"m.01798p": "NUI Galway", "m.017hs7": "Galway International Arts Festival", "m.01bx21": "St. Nicholas' Collegiate Church", "m.01cm11": "Taibhdhearc na Gaillimhe", "m.0269xds": "Spanish Arch", "m.02z573b": "Eyre Square", "m.03cbp7t": "Galway City Museum", "m.047d2xk": "Hotel Meyrick", "m.0ch85h": "Galway Sportsgrounds", "m.0ft87m": "Cathedral of Our Lady Assumed into Heaven and St Nicholas, Galway"}}, {"question": "what year did brandon roy get drafted", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cf_p_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cf_p_ ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Brandon Roy ] ) )", "golden_entities": {"m.0cf_p_": "Brandon Roy"}, "answer_entities": {"m.09th87": "2006 NBA draft"}}, {"question": "what book did niccolo machiavelli write", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05cvs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05cvs ns:book.author.book_editions_published ?x .\n}\n", "logical_form": "( JOIN ( R [ book , author , book editions published ] ) [ Niccol\u00f2 Machiavelli ] )", "golden_entities": {"m.05cvs": "Niccol\u00f2 Machiavelli"}, "answer_entities": {"m.059cj5q": "The Prince", "m.059cj66": "The Prince", "m.059cj6r": "The Prince", "m.059cj77": "The Prince", "m.059cj7r": "The Prince", "m.059cj87": "The Prince", "m.059cj8r": "The Prince", "m.059cj97": "The Prince", "m.059cj9r": "The Prince", "m.059cjb7": "The Prince", "m.059cjbr": "The Prince", "m.059cjc7": "The Prince", "m.059cjcr": "The Prince", "m.059cjd7": "The Prince", "m.059cjdl": "The Prince", "m.059cjf1": "The Prince", "m.059cjfk": "The Prince", "m.059cjg1": "The Prince", "m.059cjgk": "The Prince", "m.059cjgw": "The Prince"}}, {"question": "where is the mtv headquarters", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04rqd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04rqd ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ MTV ] ) )", "golden_entities": {"m.04rqd": "MTV"}, "answer_entities": {"m.02_286": "New York City"}}, {"question": "what is guatemala current system of government", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0345_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0345_ ns:location.country.form_of_government ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , form of government ] ) [ Guatemala ] )", "golden_entities": {"m.0345_": "Guatemala"}, "answer_entities": {"m.01d9r3": "Presidential system", "m.01fpfn": "Unitary state", "m.0c9rw5": "Constitutional republic"}}, {"question": "what is anderson silva trained in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0djnt1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0djnt1 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Anderson Silva ] )", "golden_entities": {"m.0djnt1": "Anderson Silva"}, "answer_entities": {"m.02_8dlt": "Mixed Martial Artist", "m.02hrh1q": "Actor"}}, {"question": "what does pixar produce", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kk9v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kk9v ns:film.production_company.films ?x .\n}\n", "logical_form": "( JOIN ( R [ film , production company , films ] ) [ Pixar ] )", "golden_entities": {"m.0kk9v": "Pixar"}, "answer_entities": {"m.0_fp_zm": "Party Central", "m.011114yr": "Lava", "m.0134y27d": "Sanjay's Super Team", "m.01c22t": "Monsters, Inc.", "m.01jrbb": "Finding Nemo", "m.01xdxy": "Toy Story 2", "m.027s39y": "WALL-E", "m.02c7k4": "A Bug's Life", "m.02lp2p": "Tin Toy", "m.02p_3d5": "Tiny Toy Stories", "m.02qm_f": "The Incredibles", "m.02rn00y": "Up", "m.02xckn6": "Your Friend the Rat", "m.03h2br3": "Pixar Short Films Collection, Volume 1", "m.03psgx": "For the Birds", "m.03q0r1": "Cars", "m.03wp2q": "Knick Knack", "m.03x7hd": "Ratatouille", "m.0407v2n": "Newt", "m.0407yfx": "Brave", "m.0407yj_": "Cars 2", "m.0409199": "Presto", "m.0421jh2": "Mr. Incredible and Pals", "m.046p4h": "Luxo Jr.", "m.047sk1j": "BURN-E", "m.04hp18": "Geri's Game", "m.04hwbq": "Toy Story 3", "m.04jmpdl": "1906", "m.04kfn7": "Boundin'", "m.05f80xj": "Partly Cloudy", "m.05p1h4": "Jack-Jack Attack", "m.05ttpm": "Red's Dream", "m.05yt15": "The Adventures of Andr\u00e9 and Wally B.", "m.064pff0": "Dug's Special Mission", "m.06jb92": "One Man Band", "m.07fp10": "Mike's New Car", "m.0805f5_": "Exploring the Reef", "m.09gmczn": "George & A.J.", "m.0bhbv_6": "Day & Night", "m.0bq2wj": "Buzz Lightyear of Star Command: The Adventure Begins", "m.0dyb1": "Toy Story", "m.0g1dyx": "Mater and the Ghostlight", "m.0gwndqr": "Monsters University", "m.0gwymwr": "Hawaiian Vacation", "m.0h2mkmw": "La Luna", "m.0h50n6": "Lifted", "m.0hhs76t": "Small Fry", "m.0l8ptqj": "Partysaurus Rex", "m.0ll4d9b": "Pixar Short Films Collection, Volume 2", "m.0p7686_": "Tokyo Mater", "m.0pdnx8k": "The Blue Umbrella", "m.0qzzd_7": "Toy Story 4", "m.0wpwlgl": "Inside Out"}}, {"question": "what did emily dickinson die of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01509d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01509d ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Emily Dickinson ] )", "golden_entities": {"m.01509d": "Emily Dickinson"}, "answer_entities": {"m.024f_f": "Bright's disease"}}, {"question": "what was elie wiesel 's father 's name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vsp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vsp ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ Elie Wiesel ] ) )", "golden_entities": {"m.02vsp": "Elie Wiesel", "m.05zppz": "Male"}, "answer_entities": {"m.0nfv34z": "Shlomo Wiesel"}}, {"question": "what victoria beckham kids names", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cgfb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cgfb ns:people.person.children ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , children ] ) [ Victoria Beckham ] )", "golden_entities": {"m.0cgfb": "Victoria Beckham"}, "answer_entities": {"m.02vk62d": "Romeo James Beckham", "m.04dylr1": "Brooklyn Joseph Beckham", "m.04dylr8": "Cruz David Beckham", "m.0gxvrw2": "Harper Seven Beckham"}}, {"question": "where is new york in the map", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059rby)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059rby ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ New York ] )", "golden_entities": {"m.059rby": "New York"}, "answer_entities": {"m.018v5k": "Mid-Atlantic states", "m.02jwvm": "Eastern United States", "m.04_1l0v": "Contiguous United States", "m.09c7w0": "United States of America"}}, {"question": "what did jimmy valvano die with", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wb5r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wb5r ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Jim Valvano ] )", "golden_entities": {"m.04wb5r": "Jim Valvano"}, "answer_entities": {"m.0qcr0": "Cancer"}}, {"question": "where did giovanni pierluigi da palestrina live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03bx_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03bx_ ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Giovanni Pierluigi da Palestrina ] )", "golden_entities": {"m.03bx_": "Giovanni Pierluigi da Palestrina"}, "answer_entities": {"m.02w93f": "Palestrina"}}, {"question": "when michael jordan got drafted", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.054c1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.054c1 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Michael Jordan ] ) )", "golden_entities": {"m.054c1": "Michael Jordan"}, "answer_entities": {"m.06jncs": "1984 NBA draft"}}, {"question": "what kind of money do the philippines use", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05v8c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05v8c ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Philippines ] )", "golden_entities": {"m.05v8c": "Philippines"}, "answer_entities": {"m.01h5bw": "Philippine peso"}}, {"question": "what did lucille ball die of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04nw9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04nw9 ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Lucille Ball ] )", "golden_entities": {"m.04nw9": "Lucille Ball"}, "answer_entities": {"m.01p3jd": "Aortic dissection"}}, {"question": "what religion was john f kennedy", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:base.popstra.celebrity.religion ?y .\n?y ns:base.popstra.religion_choice.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ base , popstra , religion choice , religion ] ) ( JOIN ( R [ base , popstra , celebrity , religion ] ) [ John F. Kennedy ] ) )", "golden_entities": {"m.0d3k14": "John F. Kennedy"}, "answer_entities": {"m.0c8wxp": "Catholicism"}}, {"question": "where was the earthquake in chile 2010", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bmhrmh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bmhrmh ns:event.disaster.areas_affected ?x .\n}\n", "logical_form": "( JOIN ( R [ event , disaster , areas affected ] ) [ 2010 Chile earthquake ] )", "golden_entities": {"m.0bmhrmh": "2010 Chile earthquake"}, "answer_entities": {"m.036fp1": "Maule Region"}}, {"question": "what movies did ron howard do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g2lq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g2lq ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Ron Howard ] ) )", "golden_entities": {"m.0g2lq": "Ron Howard"}, "answer_entities": {"m.01vd7y": "Return to Mayberry", "m.0273yvf": "Welcome to Hollywood", "m.02mh4b": "Night Shift", "m.02rylzd": "The Courtship of Eddie's Father", "m.02yf34": "Grand Theft Auto", "m.04d_tqm": "Act of Love", "m.04j34jb": "Eat My Dust!", "m.05y48m": "More American Graffiti", "m.069ym_": "The First Nudie Musical", "m.06r6r_": "The Independent", "m.06rqp_": "Fire on the Mountain", "m.06w2sxf": "The Spikes Gang", "m.06zsyy6": "Five Minutes to Live", "m.079h70": "The Shootist", "m.07cqxs": "Village of the Giants", "m.09gf7yk": "The Journey", "m.09m6kg": "A Beautiful Mind", "m.0b66flr": "When Your Lover Leaves", "m.0b7b2_b": "The Wild Country", "m.0cqnss": "The Music Man", "m.0crjcw1": "Huckleberry Finn", "m.0crrc8": "Dr. Seuss' How the Grinch Stole Christmas", "m.0crrhfn": "Cannes: All Access", "m.0crwz48": "I'm a Fool", "m.0dgkzwj": "Bitter Harvest", "m.0dqwvw": "Osmosis Jones", "m.0gxdf11": "Under the Boardwalk: The Monopoly Story", "m.0hv8w": "American Graffiti", "m.0wxvvw1": "Happy Mother's Day, Love George"}}, {"question": "what county is charlotte north carolina", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fsb8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fsb8 ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Charlotte ] )", "golden_entities": {"m.0fsb8": "Charlotte"}, "answer_entities": {"m.025rst1": "Mecklenburg County"}}, {"question": "who is michelle obama", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025s5v9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025s5v9 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Michelle Obama ] )", "golden_entities": {"m.025s5v9": "Michelle Obama"}, "answer_entities": {"m.04gc2": "Lawyer", "m.0cbd2": "Writer"}}, {"question": "what kourtney kardashian name her daughter", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043ttm7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043ttm7 ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , children ] ) [ Kourtney Kardashian ] ) )", "golden_entities": {"m.043ttm7": "Kourtney Kardashian", "m.02zsn": "Female"}, "answer_entities": {"m.0k3cqw1": "Penelope Scotland Disick"}}, {"question": "what kind of government does chile have today", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p1v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p1v ns:location.country.form_of_government ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , form of government ] ) [ Chile ] )", "golden_entities": {"m.01p1v": "Chile"}, "answer_entities": {"m.01d9r3": "Presidential system", "m.01fpfn": "Unitary state", "m.0c9rw5": "Constitutional republic", "m.0fpgmpz": "Democratic republic"}}, {"question": "where did richard arkwright die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01tglh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01tglh ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Richard Arkwright ] )", "golden_entities": {"m.01tglh": "Richard Arkwright"}, "answer_entities": {"m.03k9xq": "Cromford"}}, {"question": "where was hackney 2012 held", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0yx1g5l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0yx1g5l ns:time.event.locations ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , locations ] ) [ Radio 1\u2032s Hackney Weekend 2012 ] )", "golden_entities": {"m.0yx1g5l": "Radio 1\u2032s Hackney Weekend 2012"}, "answer_entities": {"m.031dy5": "Hackney Marshes"}}, {"question": "where does the st louis rams play football", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06x76)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06x76 ns:sports.sports_team.arena_stadium ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ St. Louis Rams ] )", "golden_entities": {"m.06x76": "St. Louis Rams"}, "answer_entities": {"m.02b99h": "Edward Jones Dome"}}, {"question": "what year did scottie pippen come into the nba", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vpgl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vpgl ns:sports.pro_athlete.career_start ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , pro athlete , career start ] ) [ Scottie Pippen ] )", "golden_entities": {"m.01vpgl": "Scottie Pippen"}, "answer_entities": {"value": "1987"}}, {"question": "where are you if you re in zagreb", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fhzy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fhzy ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , administrative parent ] ) [ Zagreb ] )", "golden_entities": {"m.0fhzy": "Zagreb"}, "answer_entities": {"m.01pj7": "Croatia"}}, {"question": "what city was selena gomez born in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gs6vr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gs6vr ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Selena Gomez ] )", "golden_entities": {"m.0gs6vr": "Selena Gomez"}, "answer_entities": {"m.013mbz": "Grand Prairie"}}, {"question": "what is the current time in nigeria lagos", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lnfy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lnfy ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Lagos ] )", "golden_entities": {"m.0lnfy": "Lagos"}, "answer_entities": {"m.02llzg": "Central European Time Zone"}}, {"question": "what state was texaco gas founded", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g499)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g499 ns:organization.organization.place_founded ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , place founded ] ) [ Texaco ] )", "golden_entities": {"m.0g499": "Texaco"}, "answer_entities": {"m.0104lr": "Beaumont"}}, {"question": "what is brazil time zone", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015fr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015fr ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Brazil ] )", "golden_entities": {"m.015fr": "Brazil"}, "answer_entities": {"m.0jy1pqp": "Bras\u00edlia Time Zone", "m.0y496y2": "Amazon Time Zone", "m.0y49b8w": "Fernando de Noronha\u00a0Time Zone"}}, {"question": "who was tex beneke", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.076yxy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.076yxy ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Tex Beneke ] )", "golden_entities": {"m.076yxy": "Tex Beneke"}, "answer_entities": {"m.029bkp": "Bandleader", "m.02h66dr": "Saxophonist", "m.09jwl": "Musician", "m.09l65": "Singer"}}]