[{"question": "what games did bungie make", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09h57)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09h57 ns:cvg.cvg_developer.game_versions_developed ?x .\n}\n", "logical_form": "( JOIN ( R [ cvg , cvg developer , game versions developed ] ) [ Bungie ] )", "golden_entities": {"m.09h57": "Bungie"}, "answer_entities": {"m.02_5m4d": "Halo 2", "m.02hl36h": "Halo: Combat Evolved", "m.02hl4g1": "Marathon Infinity", "m.02hl7gm": "Oni", "m.02hl7q3": "Oni", "m.02hl81g": "Marathon", "m.02hl9p6": "Oni", "m.02hlczs": "Marathon 2: Durandal", "m.02hldps": "Oni", "m.02hlknf": "Halo 2", "m.02hll5w": "Pathways into Darkness", "m.02hm22b": "Operation Desert Storm", "m.02hm6f9": "Marathon 2: Durandal", "m.02hm6sf": "Halo: Combat Evolved", "m.02hmc8n": "Minotaur: The Labyrinths of Crete", "m.02hmf94": "Gnop!", "m.02hmnts": "Halo: Combat Evolved", "m.02hmrp5": "Halo 3", "m.040qs85": "Marathon 2: Durandal", "m.05nsphn": "Halo 3: ODST", "m.0kyn_zb": "Myth II: Soulblighter", "m.0kyny5f": "Myth: The Fallen Lords", "m.0kyq2t6": "Myth: The Fallen Lords", "m.0kyq53c": "Myth II: Soulblighter", "m.0kyr83h": "Marathon", "m.0kyrc3g": "Super Marathon", "m.0kyrw35": "Halo: Combat Evolved", "m.0kys0mb": "Marathon", "m.0kys0zq": "Marathon Infinity", "m.0kys2h1": "Halo: Reach", "m.0kyw665": "Myth: The Fallen Lords", "m.0kyxmvv": "Myth II: Soulblighter"}}, {"question": "where was ancient carthage located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xpg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xpg ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Carthage ] )", "golden_entities": {"m.01xpg": "Carthage"}, "answer_entities": {"m.07fj_": "Tunisia"}}, {"question": "what were frederick douglass achievements", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02zg0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02zg0 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Frederick Douglass ] )", "golden_entities": {"m.02zg0": "Frederick Douglass"}, "answer_entities": {"m.016fc2": "Statesman", "m.02h668d": "Publisher", "m.080ntlp": "Diplomat", "m.0cbd2": "Writer", "m.0hpjt": "Orator", "m.0kyk": "Author"}}, {"question": "what is zip code for davenport iowa", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02d6c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02d6c ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ Davenport ] )", "golden_entities": {"m.02d6c": "Davenport"}, "answer_entities": {"m.03dqrd_": "52801", "m.03dqrfd": "52802", "m.03dqrft": "52803", "m.03dqrg6": "52804", "m.03dqrgm": "52806", "m.03dqrh0": "52807", "m.07nqqx8": "52809", "m.07nqqxh": "52808", "m.07nqqxq": "52805"}}, {"question": "what was the name of william shakespeare 's children", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081k8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081k8 ns:people.person.children ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , children ] ) [ William Shakespeare ] )", "golden_entities": {"m.081k8": "William Shakespeare"}, "answer_entities": {"m.026db4d": "Hamnet Shakespeare", "m.02rqr_w": "Judith Quiney", "m.0c0xwb": "Susanna Hall"}}, {"question": "what organization did dr. carter g. woodson found", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042w00)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042w00 ns:organization.organization_founder.organizations_founded ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization founder , organizations founded ] ) [ Carter G. Woodson ] )", "golden_entities": {"m.042w00": "Carter G. Woodson"}, "answer_entities": {"m.08lhk3": "Association for the Study of African American Life and History"}}, {"question": "what inventions did leonardo da vinci made", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lg6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lg6 ns:base.argumentmaps.innovator.original_ideas ?x .\n}\n", "logical_form": "( JOIN ( R [ base , argumentmaps , innovator , original ideas ] ) [ Leonardo da Vinci ] )", "golden_entities": {"m.04lg6": "Leonardo da Vinci"}, "answer_entities": {"m.05my_3": "Viola organista"}}, {"question": "where is eric cantor from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027z_f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027z_f ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Eric Cantor ] )", "golden_entities": {"m.027z_f": "Eric Cantor"}, "answer_entities": {"m.0dzt9": "Richmond"}}, {"question": "what is the currency of sweden called", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d0vqn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d0vqn ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Sweden ] )", "golden_entities": {"m.0d0vqn": "Sweden"}, "answer_entities": {"m.0485n": "Swedish krona"}}, {"question": "where did tim mcgraw grew up", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lk95)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lk95 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Tim McGraw ] )", "golden_entities": {"m.02lk95": "Tim McGraw"}, "answer_entities": {"m.0tl_z": "Delhi"}}, {"question": "when did kerry run for president", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3qd0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3qd0 ns:government.politician.election_campaigns ?x .\n}\n", "logical_form": "( JOIN ( R [ government , politician , election campaigns ] ) [ John Kerry ] )", "golden_entities": {"m.0d3qd0": "John Kerry"}, "answer_entities": {"m.02jnr7": "John Kerry presidential campaign, 2004"}}, {"question": "where is rihanna from ethnically", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mt91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mt91 ns:people.person.ethnicity ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , ethnicity ] ) [ Rihanna ] )", "golden_entities": {"m.06mt91": "Rihanna"}, "answer_entities": {"m.09c8kp": "Afro-Guyanese"}}, {"question": "where was the assyrian civilization located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0wmn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0wmn ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Assyria ] )", "golden_entities": {"m.0wmn": "Assyria"}, "answer_entities": {"m.04wsz": "Middle East"}}, {"question": "what did baron de montesquieu die from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f9wd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f9wd ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Montesquieu ] )", "golden_entities": {"m.0f9wd": "Montesquieu"}, "answer_entities": {"m.0cjf0": "Fever"}}, {"question": "what do do in nashville tn", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05jbn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05jbn ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Nashville ] )", "golden_entities": {"m.05jbn": "Nashville"}, "answer_entities": {"m.01r0x4": "The Hermitage", "m.0289mp6": "Rocketown", "m.02q1jxj": "Downtown Presbyterian Church", "m.02z1wcp": "Country Music Marathon", "m.02z6zt": "Bridgestone Arena", "m.03cq2l6": "Warner Parks", "m.03cwct": "Nashville Municipal Auditorium", "m.03smg2": "Opryland USA", "m.04041r": "Ryman Auditorium", "m.047vmqj": "Belmont Mansion", "m.04jhkzc": "Lane Motor Museum", "m.04k8jf": "Nashville Zoo at Grassmere", "m.04n4m_c": "Clement Railroad Hotel Museum", "m.04q29_0": "Travellers Rest", "m.04x2jb": "Bicentennial Capitol Mall State Park", "m.05hs17": "Mount Olivet Cemetery", "m.05yhxg": "Centennial Park (Nashville)", "m.05zm4lr": "Nashville Film Festival", "m.061gsk": "Tennessee State Capitol", "m.06c2l0": "Fort Negley", "m.06j9j7": "Parthenon", "m.07t4nd": "International Bluegrass Music Association", "m.0b8fz5": "Fort Nashborough", "m.0bh7wr": "Cheekwood Botanical Garden and Museum of Art", "m.0cx8by": "Tennessee State Museum", "m.0fpc2gp": "Tennessee Agricultural Museum", "m.0k0n9s_": "Frist Center for the Visual Arts", "m.0k3d2jj": "Country Music Hall of Fame and Museum", "m.0k4wxyc": "Adventure Science Center"}}, {"question": "what nationality is zack de la rocha", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01gdlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01gdlz ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Zack de la Rocha ] )", "golden_entities": {"m.01gdlz": "Zack de la Rocha"}, "answer_entities": {"m.09c7w0": "United States of America"}}, {"question": "what did doc holliday die from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01rl_m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01rl_m ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Doc Holliday ] )", "golden_entities": {"m.01rl_m": "Doc Holliday"}, "answer_entities": {"m.07jwr": "Tuberculosis"}}, {"question": "who was the owner of kfc", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09b6t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09b6t ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ KFC ] )", "golden_entities": {"m.09b6t": "KFC"}, "answer_entities": {"m.09b78": "Colonel Sanders"}}, {"question": "where did robin gibb die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0137hn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0137hn ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Robin Gibb ] )", "golden_entities": {"m.0137hn": "Robin Gibb"}, "answer_entities": {"m.04jpl": "London"}}, {"question": "who plays jim halpert", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09x660)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09x660 ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Jim Halpert ] ) )", "golden_entities": {"m.09x660": "Jim Halpert"}, "answer_entities": {"m.060j8b": "John Krasinski"}}, {"question": "who is john cabot 's parents", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.040t9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.040t9 ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ John Cabot ] )", "golden_entities": {"m.040t9": "John Cabot"}, "answer_entities": {"m.0qg2wdg": "Guilo Caboto"}}, {"question": "what is the capital city of montana usa", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.050l8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.050l8 ns:base.aareas.schema.administrative_area.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , capital ] ) [ Montana ] )", "golden_entities": {"m.050l8": "Montana"}, "answer_entities": {"m.0fvxg": "Helena"}}, {"question": "what george washington carver famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03djm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03djm ns:common.topic.notable_types ?x .\n}\n", "logical_form": "( JOIN ( R [ common , topic , notable types ] ) [ George Washington Carver ] )", "golden_entities": {"m.03djm": "George Washington Carver"}, "answer_entities": {"m.02k76m0": "Inventor"}}, {"question": "what is the zip code for wildwood", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xm82)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xm82 ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ Wildwood ] )", "golden_entities": {"m.0xm82": "Wildwood"}, "answer_entities": {"m.020796r": "08260"}}, {"question": "where did bronx tale take place", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02t4w7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02t4w7 ns:film.film.country ?x .\n}\n", "logical_form": "( JOIN ( R [ film , film , country ] ) [ A Bronx Tale ] )", "golden_entities": {"m.02t4w7": "A Bronx Tale"}, "answer_entities": {"m.09c7w0": "United States of America"}}, {"question": "what kind of money do they use in russia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bnz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bnz ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Russia ] )", "golden_entities": {"m.06bnz": "Russia"}, "answer_entities": {"m.01hy_q": "Russian ruble"}}, {"question": "what does uvm stand for college", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01q7q2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01q7q2 ns:type.object.name ?x .\n}\n", "logical_form": "( JOIN ( R [ type , object , name ] ) [ University of Vermont ] )", "golden_entities": {"m.01q7q2": "University of Vermont"}, "answer_entities": {"value": "University of Vermont"}}, {"question": "who plays edward elric", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.074qkg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.074qkg ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Edward Elric ] ) )", "golden_entities": {"m.074qkg": "Edward Elric"}, "answer_entities": {"m.03dkz7": "Romi Park"}}, {"question": "where did frank baum live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04mby)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04mby ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ L. Frank Baum ] ) )", "golden_entities": {"m.04mby": "L. Frank Baum"}, "answer_entities": {"m.071cn": "Syracuse"}}, {"question": "what time is the grand prix starting", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f5cl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f5cl ns:time.recurring_event.date_of_first_occurance ?x .\n}\n", "logical_form": "( JOIN ( R [ time , recurring event , date of first occurance ] ) [ Grand Prix motorcycle racing ] )", "golden_entities": {"m.0f5cl": "Grand Prix motorcycle racing"}, "answer_entities": {"value": "1949"}}, {"question": "what are the places to see in dubai", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01f08r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01f08r ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Dubai ] )", "golden_entities": {"m.01f08r": "Dubai"}, "answer_entities": {"m.025smcz": "Palm Jumeirah", "m.02768mb": "Saeed Al Maktoum House", "m.027tlcs": "Jumeirah Beach Hotel", "m.02q24rq": "Dubai Museum", "m.02qkhn8": "Madinat Jumeirah", "m.02qmbrc": "Jumeirah Mosque", "m.02qyvdt": "Universal Studios Dubailand", "m.03c3yb1": "Dubai Creek", "m.03cn0v": "Burj Khalifa", "m.03m57sn": "Restless Planet", "m.03nyg2": "Wild Wadi Water Park", "m.03whtz_": "Deira Clocktower", "m.03yb84v": "Hindu Temple, Dubai", "m.0405p7v": "Fish Roundabout", "m.04q5nb": "The World", "m.05bf4c": "Mushrif Park", "m.06152r": "Grand Mosque", "m.065z06l": "Dubai Zoo", "m.06jpgt": "Emirates Towers", "m.06zn69y": "The Dubai Fountain", "m.084blh": "Dubai International Convention Centre", "m.084z1l": "Dubai Autodrome", "m.09cwdq": "Dubai Waterfront", "m.0bsbx_": "Ski Dubai", "m.0bxdn4": "The Dubai Mall", "m.0cnyfm6": "Jumeirah Beach", "m.0q40862": "Jumeirah Zabeel Saray"}}, {"question": "where is johnny depp from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jfx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jfx1 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Johnny Depp ] )", "golden_entities": {"m.0jfx1": "Johnny Depp"}, "answer_entities": {"m.0pqz3": "Owensboro"}}, {"question": "what language do pakistani people talk", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05sb1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05sb1 ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Pakistan ] )", "golden_entities": {"m.05sb1": "Pakistan"}, "answer_entities": {"m.01hk9": "Brahui Language", "m.01wb_k": "Sindhi Language", "m.01yc4j": "Hindko dialect", "m.02h40lc": "English Language", "m.02hxcvy": "Urdu Language", "m.02jxdd": "Seraiki Language", "m.04jph7t": "Pakistani English", "m.0688f": "Punjabi language", "m.0gl97": "Balochi language", "m.0hlyy": "Hindustani language", "m.0swlx": "Pashto language"}}, {"question": "what does china border", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d05w3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d05w3 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n}\n", "logical_form": "( JOIN ( R [ location , adjoining relationship , adjoins ] ) ( JOIN ( R [ location , location , adjoin s ] ) [ China ] ) )", "golden_entities": {"m.0d05w3": "China"}, "answer_entities": {"m.016zwt": "Nepal", "m.01crd5": "Vietnam", "m.02jffn": "Oudomxay Province", "m.02jfhv": "Luang Namtha Province", "m.02jfm5": "Phongsaly Province", "m.03_3d": "Japan", "m.03rk0": "India", "m.047lj": "Kazakhstan", "m.04hhv": "Laos", "m.04w8f": "Mongolia", "m.04xn_": "Myanmar", "m.05b7q": "North Korea", "m.05sb1": "Pakistan", "m.06bnz": "Russia", "m.06f32": "Taiwan", "m.07bxhl": "Bhutan", "m.07dvs": "Tajikistan", "m.0dpsf": "Mainland Southeast Asia", "m.0jdd": "Afghanistan", "m.0jt3tjf": "Kyrgyzstan"}}, {"question": "what was alice walker famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bv70)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bv70 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Alice Walker ] )", "golden_entities": {"m.0bv70": "Alice Walker"}, "answer_entities": {"m.02xhgwq": "Novelist", "m.05z96": "Poet", "m.0cbd2": "Writer", "m.0kyk": "Author"}}, {"question": "where is the time zone in kentucky", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0498y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0498y ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Kentucky ] )", "golden_entities": {"m.0498y": "Kentucky"}, "answer_entities": {"m.02_37z": "UTC\u221205:00", "m.02fqwt": "Central Time Zone", "m.02hcv8": "Eastern Time Zone"}}, {"question": "what albums did john frusciante play on", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0191h5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0191h5 ns:music.artist.album ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , album ] ) [ John Frusciante ] )", "golden_entities": {"m.0191h5": "John Frusciante"}, "answer_entities": {"m.01022704": "Enclosure", "m.012r4mlt": "Trickfinger", "m.012r4w47": "Sect In Sgt", "m.01md96d": "The Will to Death", "m.01md97f": "To Record Only Water for Ten Days", "m.01md9b1": "Demo & Acoustic Shadows Collide With People", "m.01md9fk": "Smile From The Streets You Hold", "m.01md9g_": "DC EP", "m.01md9hj": "Curtains", "m.01md9jh": "Inside of Emptiness", "m.01md9kf": "Niandra Lades and Usually Just a T-Shirt", "m.01md9nh": "From the Sounds Inside", "m.01r4vpc": "A Sphere in the Heart of Silence", "m.026yhz8": "Solo X", "m.0282sm_": "Going Inside", "m.0282t7l": "Estrus", "m.0282vcx": "The Brown Bunny", "m.04q3cf2": "The Empyrean", "m.0bs2hyk": "Omar Rodriguez Lopez & John Frusciante", "m.0jwvsmg": "Letur-Lefr", "m.0qbj2cj": "PBX Funicular Intaglio Zone", "m.0w7klj3": "Outsides"}}, {"question": "what influenced whitman 's poetry", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.085gk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.085gk ns:influence.influence_node.influenced_by ?x .\n}\n", "logical_form": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Walt Whitman ] )", "golden_entities": {"m.085gk": "Walt Whitman"}, "answer_entities": {"m.02lt8": "Edgar Allan Poe", "m.039n1": "Georg Wilhelm Friedrich Hegel", "m.05np2": "Oscar Wilde", "m.06jkm": "Ralph Waldo Emerson", "m.06y8v": "Walter Scott", "m.0bwx3": "Henry David Thoreau", "m.0gzh": "Abraham Lincoln"}}, {"question": "what did martin luther king jr do in his life", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:base.activism.activist.area_of_activism ?x .\n}\n", "logical_form": "( JOIN ( R [ base , activism , activist , area of activism ] ) [ Martin Luther King, Jr. ] )", "golden_entities": {"m.051cc": "Martin Luther King, Jr."}, "answer_entities": {"m.018cwm": "Nonviolence", "m.020mgv": "Anti-racism", "m.04lxyz0": "Anti-Apartheid", "m.065qmpf": "Humanitarian", "m.074v_1j": "Black Liberation", "m.097s4": "Civil and political rights", "m.0g4pf68": "African Americans' rights"}}, {"question": "where did jimmy hoffa live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lx0r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lx0r ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Jimmy Hoffa ] ) )", "golden_entities": {"m.01lx0r": "Jimmy Hoffa"}, "answer_entities": {"m.03v1s": "Indiana"}}, {"question": "where people speak welsh", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.083tk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.083tk ns:language.human_language.countries_spoken_in ?x .\n}\n", "logical_form": "( JOIN ( R [ language , human language , countries spoken in ] ) [ Welsh Language ] )", "golden_entities": {"m.083tk": "Welsh Language"}, "answer_entities": {"m.014tss": "Kingdom of Great Britain", "m.0576g9": "Principality of Wales", "m.07ssc": "United Kingdom"}}, {"question": "what children 's books did suzanne collins wrote", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bpd5z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bpd5z ns:book.author.works_written ?x .\n?x ns:book.book.genre ns:m.0dwly .\n}\n", "logical_form": "( AND ( JOIN [ book , book , genre ] [ Children's literature ] ) ( JOIN ( R [ book , author , works written ] ) [ Suzanne Collins ] ) )", "golden_entities": {"m.0bpd5z": "Suzanne Collins", "m.0dwly": "Children's literature"}, "answer_entities": {"m.04t448_": "The Underland Chronicles Book Three", "m.04t448h": "Gregor and the Code of Claw", "m.04t44bh": "FIRE PROOF", "m.0dsx8l": "Gregor and the Prophecy of Bane"}}, {"question": "where did elvis presley live before he died", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02jq1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02jq1 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Elvis Presley ] ) )", "golden_entities": {"m.02jq1": "Elvis Presley"}, "answer_entities": {"m.0c_m3": "Memphis", "m.0wqwj": "Tupelo"}}, {"question": "what to do in daytona", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rsjf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rsjf ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Daytona Beach ] )", "golden_entities": {"m.0rsjf": "Daytona Beach"}, "answer_entities": {"m.0260dxn": "Halifax Historical Museum", "m.027rnt": "Daytona International Speedway", "m.02z4mj0": "Museum of Arts and Sciences", "m.04mz450": "Daytona Lagoon", "m.067f5c": "Jackie Robinson Ballpark", "m.068vzy": "Ocean Center", "m.08j0k7": "Daytona Beach Bike Week", "m.0c18rf": "Daytona 500 Experience", "m.0fqspb": "South Beach Street Historic District", "m.0h4ncm": "Mary McLeod Bethune Home"}}, {"question": "who was the vice president during george w bush", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09b6zr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09b6zr ns:government.us_president.vice_president ?x .\n}\n", "logical_form": "( JOIN ( R [ government , us president , vice president ] ) [ George W. Bush ] )", "golden_entities": {"m.09b6zr": "George W. Bush"}, "answer_entities": {"m.0d0vj4": "Dick Cheney"}}, {"question": "where did kevin hart go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ggp1n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ggp1n ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Kevin Hart ] ) )", "golden_entities": {"m.0ggp1n": "Kevin Hart"}, "answer_entities": {"m.01jt2w": "Temple University", "m.0gy5x53": "Castlemont High School"}}, {"question": "where does the name melbourne come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chgzm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chgzm ns:symbols.namesake.named_after ?x .\n}\n", "logical_form": "( JOIN ( R [ symbols , namesake , named after ] ) [ Melbourne ] )", "golden_entities": {"m.0chgzm": "Melbourne"}, "answer_entities": {"m.0bx7q": "William Lamb, 2nd Viscount Melbourne"}}, {"question": "what did susan atkins die of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02h8k7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02h8k7 ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Susan Atkins ] )", "golden_entities": {"m.02h8k7": "Susan Atkins"}, "answer_entities": {"m.09969": "Brain tumor", "m.0qcr0": "Cancer"}}, {"question": "what country did marco polo come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wwh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wwh ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Marco Polo ] )", "golden_entities": {"m.04wwh": "Marco Polo"}, "answer_entities": {"m.02wm6l": "Republic of Venice"}}, {"question": "where did patrick henry live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k5tb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k5tb ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Patrick Henry ] )", "golden_entities": {"m.0k5tb": "Patrick Henry"}, "answer_entities": {"m.0mns1": "Hanover County"}}, {"question": "what kind of government does mongolia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04w8f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04w8f ns:location.country.form_of_government ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , form of government ] ) [ Mongolia ] )", "golden_entities": {"m.04w8f": "Mongolia"}, "answer_entities": {"m.01dw03": "Semi-presidential system", "m.0glnsx": "Parliamentary republic"}}]