[{"question": "what to do in nadi fiji", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.022wr3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.022wr3 ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Nadi, Fiji ] )", "golden_entities": {"m.022wr3": "Nadi, Fiji"}, "answer_entities": {"m.03cybpb": "Kula Eco Park", "m.0921g5": "Yasawa", "m.0934gl": "Mamanuca Islands", "m.094tcx": "Sri Siva Subramaniya temple", "m.095sm6": "Nananu-i-Ra", "m.0jz1q62": "Garden of the Sleeping Giant", "m.0jz1q6f": "Koroyanitu National Park", "m.0k6xpc5": "Navala Bures", "m.0k6xpst": "Subar Maniya", "m.0k6xq19": "Denerau Beach"}}, {"question": "what is the postcode for seoul south korea", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hsqf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hsqf ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ Seoul ] )", "golden_entities": {"m.0hsqf": "Seoul"}, "answer_entities": {"m.0cvrg0c": "139-799"}}, {"question": "where is bosnia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0166b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0166b ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Bosnia and Herzegovina ] )", "golden_entities": {"m.0166b": "Bosnia and Herzegovina"}, "answer_entities": {"m.02j9z": "Europe"}}, {"question": "where is amazon based out of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0mgkg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0mgkg ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Amazon.com ] ) )", "golden_entities": {"m.0mgkg": "Amazon.com"}, "answer_entities": {"m.0d9jr": "Seattle"}}, {"question": "where did robert boyle study", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d98m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d98m ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Robert Boyle ] ) )", "golden_entities": {"m.0d98m": "Robert Boyle"}, "answer_entities": {"m.0dzbl": "Eton College", "m.0ymf1": "University College, Oxford"}}, {"question": "what is there to see near the grand canyon", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cns5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cns5 ns:travel.tourist_attraction.near_travel_destination ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , tourist attraction , near travel destination ] ) [ Grand Canyon ] )", "golden_entities": {"m.0cns5": "Grand Canyon"}, "answer_entities": {"m.01z_xr": "Lake Powell", "m.0cnrr": "Grand Canyon National Park", "m.0d35y": "Phoenix"}}, {"question": "where was anne frank born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03d9rk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03d9rk ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Anne Frank ] )", "golden_entities": {"m.03d9rk": "Anne Frank"}, "answer_entities": {"m.02z0j": "Frankfurt"}}, {"question": "what are the kennedys", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fbrl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fbrl ns:people.family.members ?x .\n}\n", "logical_form": "( JOIN ( R [ people , family , members ] ) [ Kennedy family ] )", "golden_entities": {"m.0fbrl": "Kennedy family"}, "answer_entities": {"m.0150p7": "John F. Kennedy Jr.", "m.0194xc": "Ted Kennedy", "m.01kyns": "Rosemary Kennedy", "m.01n4xb": "David A. Kennedy", "m.01qlg1": "Joseph P. Kennedy, Sr.", "m.01w83z": "Maria Shriver", "m.01x4d5": "Rose Kennedy", "m.01y603": "Caroline Kennedy", "m.0202g7": "Patrick J. Kennedy", "m.020t1x": "Joseph P. Kennedy, Jr.", "m.028qh_": "Jean Kennedy Smith", "m.02f95t": "Kathleen Kennedy Townsend", "m.02frvc": "Bobby Shriver", "m.02frws": "Timothy Shriver", "m.02frx4": "Mark Shriver", "m.02frxh": "Anthony Shriver", "m.02h40b": "Edward M. Kennedy, Jr.", "m.02l5km": "Robert F. Kennedy, Jr.", "m.02l87p": "Joseph P. Kennedy II", "m.02l88c": "Michael LeMoyne Kennedy", "m.02l8dg": "Rory Kennedy", "m.02shr7": "Patrick Bouvier Kennedy", "m.03tryx": "Courtney Kennedy Hill", "m.03ts1h": "Christopher G. Kennedy", "m.03ts2x": "Max Kennedy", "m.03ts5s": "Douglas Harriman Kennedy", "m.04f1nm": "Kathleen Cavendish", "m.04f1qs": "Patricia Kennedy Lawford", "m.04syk4": "Christopher Lawford", "m.06hx2": "Robert F. Kennedy", "m.07b5gj": "William Kennedy Smith", "m.07ydlp5": "John Schlossberg", "m.07ydlpp": "Tatiana Schlossberg", "m.07ydlq2": "Rose Schlossberg", "m.08w6qf": "Kerry Kennedy", "m.0bt9c": "Eunice Kennedy Shriver", "m.0d3k14": "John F. Kennedy"}}, {"question": "where is sarajevo located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06n8j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06n8j ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Sarajevo ] )", "golden_entities": {"m.06n8j": "Sarajevo"}, "answer_entities": {"m.0166b": "Bosnia and Herzegovina", "m.021yyx": "Federation of Bosnia and Herzegovina", "m.03g99x": "Sarajevo Canton", "m.0gfgdgx": "Sanjak of Bosnia"}}, {"question": "what teams are left in the nfl", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059yj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059yj ns:sports.sports_league.teams ?y .\n?y ns:sports.sports_league_participation.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league participation , team ] ) ( JOIN ( R [ sports , sports league , teams ] ) [ National Football League ] ) )", "golden_entities": {"m.059yj": "National Football League"}, "answer_entities": {"m.01c_d": "Buffalo Bills", "m.01ct6": "Baltimore Ravens", "m.01ddr_": "Canton Bulldogs", "m.01ddrm": "Akron Pros", "m.01ddsc": "Cleveland Bulldogs", "m.01ddsr": "Frankford Yellow Jackets", "m.01ddt3": "Providence Steam Roller", "m.01jr_f": "Chicago Tigers", "m.01jr_s": "Cincinnati Celts", "m.01jr9j": "Dallas Texans", "m.01jrvs": "Boston Yanks", "m.01jrw4": "Buffalo All-Stars", "m.01jrww": "Minneapolis Marines", "m.01jrx6": "Detroit Heralds", "m.01jrxk": "Washington Senators", "m.01jryn": "Pottsville Maroons", "m.01jrz0": "Orange Tornadoes", "m.01jrzc": "Duluth Kelleys", "m.01js03": "Cincinnati Reds", "m.01js0h": "St. Louis Gunners", "m.01js16": "Cleveland Tigers", "m.01js1y": "Cleveland Indians", "m.01js31": "Columbus Panhandles", "m.01js3f": "Dayton Triangles", "m.01js45": "Evansville Crimson Giants", "m.01js4j": "Los Angeles Buccaneers", "m.01js4x": "Muncie Flyers", "m.01js5y": "Louisville Brecks", "m.01js6_": "Hartford Blues", "m.01js68": "New York Yankees", "m.01js7b": "Oorang Indians", "m.01js7p": "Hammond Pros", "m.01js80": "Kenosha Maroons", "m.01js8c": "Milwaukee Badgers", "m.01js8r": "Racine Legion", "m.01js9f": "Rochester Jeffersons", "m.01js9t": "All-Tonawanda All-Stars", "m.01jsb4": "Rock Island Independents", "m.01jsbx": "Staten Island Stapletons", "m.01jsc8": "St. Louis All-Stars", "m.01jscm": "Toledo Maroons", "m.01xvb": "Cleveland Browns", "m.01y3c": "Carolina Panthers", "m.01y3v": "Chicago Bears", "m.01y49": "Cincinnati Bengals", "m.025hfj": "Brooklyn Dodgers", "m.025hfx": "Brooklyn Lions", "m.02896": "Dallas Cowboys", "m.0289q": "Denver Broncos", "m.02c_4": "Detroit Lions", "m.02n0s5": "New York Brickley Giants", "m.030xrm": "New York Yanks", "m.03b3j": "Green Bay Packers", "m.03lsq": "Houston Texans", "m.03wnh": "Indianapolis Colts", "m.043vc": "Jacksonville Jaguars", "m.047mhnr": "Syracuse Pros", "m.0487_": "Kansas City Chiefs", "m.04nmxtk": "Houston Oilers", "m.04vn5": "Miami Dolphins", "m.051q5": "Minnesota Vikings", "m.05g3b": "New England Patriots", "m.05g3v": "New Orleans Saints", "m.05g49": "New York Jets", "m.05gg4": "New York Giants", "m.05l71": "Oakland Raiders", "m.05tfm": "Pittsburgh Steelers", "m.05tg3": "Philadelphia Eagles", "m.060jft": "Baltimore Colts", "m.06f2k5d": "Tennessee Oilers", "m.06hcqq": "Kansas City Blues", "m.06l_dbw": "Pittsburgh Pirates", "m.06lxrxk": "Phoenix Cardinals", "m.06lxvwt": "St. Louis Cardinals", "m.06lycgb": "Portsmouth Spartans", "m.06lz35s": "Chicago Staleys", "m.06mp_z5": "Boston Redskins", "m.06mp1hm": "Boston Patriots", "m.06mp7tp": "Los Angeles Raiders", "m.06mpvs8": "Los Angeles Rams", "m.06mpwv_": "Cleveland Rams", "m.06mq172": "Boston Braves", "m.06rny": "San Francisco 49ers", "m.06rpd": "San Diego Chargers", "m.06rrsy3": "Akron Indians", "m.06rsr2m": "Boston Bulldogs", "m.06rvwhv": "Brooklyn Tigers", "m.06tft9v": "Columbus Tigers", "m.06tm2c_": "New York Bulldogs", "m.06vw_65": "Louisville Colonels", "m.06vw_gf": "Minneapolis Red Jackets", "m.06vw_wb": "Detroit Panthers", "m.06vw_x7": "Detroit Wolverines", "m.06vwxb3": "Buffalo Niagaras", "m.06vwxfc": "Buffalo Prospects", "m.06vwxhp": "Buffalo All-Americans", "m.06vwxkr": "Buffalo Bisons", "m.06vwxmr": "Buffalo Rangers", "m.06vwzf5": "Detroit Tigers", "m.06vx04k": "Duluth Eskimos", "m.06vx0jg": "Kansas City Cowboys", "m.06vx0vy": "Newark Tornadoes", "m.06vx115": "Racine Tornadoes", "m.06x76": "St. Louis Rams", "m.070xg": "Seattle Seahawks", "m.0738cbk": "Baltimore Colts", "m.0738w43": "Buffalo Bisons", "m.07l24": "Tampa Bay Buccaneers", "m.07l2m": "Tennessee Titans", "m.07xmq9": "Philadelphia-Pittsburgh Steagles", "m.084l5": "Washington Redskins", "m.0fb2wm": "Card-Pitt", "m.0ws7": "Arizona Cardinals", "m.0wsr": "Atlanta Falcons"}}, {"question": "what are historical places in new york", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059rby)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059rby ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ New York ] )", "golden_entities": {"m.059rby": "New York"}, "answer_entities": {"m.013r41": "Coney Island", "m.0163ff": "Rockefeller Center", "m.016p8t": "Carnegie Hall", "m.016xm_": "Radio City Music Hall", "m.0179bc": "Thousand Islands", "m.01kht3": "St. Patrick's Cathedral", "m.01lnd3": "Flatiron Building", "m.01nbpn": "Little Italy", "m.01nq4x": "Woolworth Building", "m.01pdsd": "New York Harbor", "m.01pdy0": "New York City Hall", "m.01rs7b": "The Cloisters", "m.01rxnm": "Brooklyn Botanic Garden", "m.01rz3c": "Grand Central Terminal", "m.01s7jw": "Prospect Park", "m.01zmd": "Chrysler Building", "m.0209mm": "New York Botanical Garden", "m.020nlt": "Apollo Theater", "m.021848": "Frick Collection", "m.023r9j": "American Museum of Natural History", "m.026bmdr": "Hotel Pennsylvania", "m.026kp2": "Liberty Island", "m.02cj9_": "GE Building", "m.02gyzc": "Waldorf Astoria New York", "m.02nd_": "Empire State Building", "m.02nyg": "Ellis Island", "m.02vqw3": "Brooklyn Museum", "m.02zrs": "Finger Lakes", "m.037lpb": "Destiny USA", "m.03vgd_": "Bryant Park", "m.0426n1": "Glimmerglass State Park", "m.04jpg0f": "Statue of Liberty National Monument", "m.04k2zh": "Queens Museum", "m.051vm6": "Museum of the Moving Image", "m.05l9fg": "Barclays Center", "m.06qvwg": "Whiteface Mountain", "m.06w5wh8": "Metropolitan Opera House", "m.072p8": "Statue of Liberty", "m.07jwwf": "High Line", "m.07qdr": "Times Square", "m.09c7b": "Metropolitan Museum of Art", "m.09c7v": "Central Park", "m.0cjp7w": "Webster Hall", "m.0cv4c": "Brooklyn Bridge", "m.0dpk_": "Niagara Falls", "m.0ds4dt3": "Harmanus Bleecker Library", "m.0fb18": "Adirondack Mountains", "m.0gfhhy8": "The Big Up Festival", "m.0hhjk": "Museum of Modern Art", "m.0hrg52m": "Holiday Valley", "m.0j_66": "Madison Square Garden", "m.0mzkb": "Bronx Zoo", "m.0pnb8": "Chinatown", "m.0q9h2": "Solomon R. Guggenheim Museum"}}, {"question": "what countries are included in the continent of asia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j0k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j0k ns:base.locations.continents.countries_within ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , continents , countries within ] ) [ Asia ] )", "golden_entities": {"m.0j0k": "Asia"}, "answer_entities": {"m.0161c": "Bahrain", "m.0162b": "Bangladesh", "m.0167v": "Brunei", "m.016zwt": "Nepal", "m.01c4pv": "Turkmenistan", "m.01crd5": "Vietnam", "m.01xbgx": "Cambodia", "m.01z215": "Saudi Arabia", "m.01z88t": "Yemen", "m.02lx0": "Timor-Leste", "m.03__y": "Jordan", "m.03_3d": "Japan", "m.03h64": "Hong Kong", "m.03rk0": "India", "m.03ryn": "Indonesia", "m.03shp": "Iran", "m.03spz": "Israel", "m.047lj": "Kazakhstan", "m.047yc": "Kuwait", "m.04hhv": "Laos", "m.04hqz": "Lebanon", "m.04thp": "Macau", "m.04ty8": "Maldives", "m.04w8f": "Mongolia", "m.04xn_": "Myanmar", "m.05b7q": "North Korea", "m.05l8y": "Oman", "m.05sb1": "Pakistan", "m.05v8c": "Philippines", "m.0697s": "Qatar", "m.06f32": "Taiwan", "m.06m_5": "Sri Lanka", "m.06qd3": "South Korea", "m.06t2t": "Singapore", "m.06vbd": "Syria", "m.07bxhl": "Bhutan", "m.07dvs": "Tajikistan", "m.07f1x": "Thailand", "m.07t_x": "Uzbekistan", "m.09pmkv": "Malaysia", "m.0d05q4": "Iraq", "m.0d05w3": "China", "m.0j1z8": "United Arab Emirates", "m.0jdd": "Afghanistan", "m.0jt3tjf": "Kyrgyzstan"}}, {"question": "when did miami dolphins win super bowl", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04vn5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04vn5 ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Miami Dolphins ] )", "golden_entities": {"m.04vn5": "Miami Dolphins"}, "answer_entities": {"m.076nd": "Super Bowl VII", "m.076nr": "Super Bowl VIII"}}, {"question": "what timezone is minnesota in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ykg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ykg ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Minnesota ] )", "golden_entities": {"m.04ykg": "Minnesota"}, "answer_entities": {"m.02fqwt": "Central Time Zone"}}, {"question": "where did lauren conrad live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dq9wx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dq9wx ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Lauren Conrad ] ) )", "golden_entities": {"m.0dq9wx": "Lauren Conrad"}, "answer_entities": {"m.030qb3t": "Los Angeles", "m.0d6lp": "San Francisco", "m.0r2gj": "Laguna Beach"}}, {"question": "what bella name her baby", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027b7y9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027b7y9 ns:fictional_universe.fictional_character.children ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , fictional character , children ] ) [ Bella Swan ] )", "golden_entities": {"m.027b7y9": "Bella Swan"}, "answer_entities": {"m.04gk8n0": "Renesmee Carlie Cullen"}}, {"question": "what is the houston rockets mascot", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jmfb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jmfb ns:sports.sports_team.team_mascot ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , team mascot ] ) [ Houston Rockets ] )", "golden_entities": {"m.0jmfb": "Houston Rockets"}, "answer_entities": {"m.02qmvfb": "Clutch"}}, {"question": "where did matthias schleiden do his work", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dd3q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dd3q ns:people.person.employment_history ?y .\n?y ns:business.employment_tenure.company ?x .\n}\n", "logical_form": "( JOIN ( R [ business , employment tenure , company ] ) ( JOIN ( R [ people , person , employment history ] ) [ Matthias Jakob Schleiden ] ) )", "golden_entities": {"m.0dd3q": "Matthias Jakob Schleiden"}, "answer_entities": {"m.01fy2s": "University of Tartu"}}, {"question": "what songs does katherine jenkins sing", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01qrf09)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01qrf09 ns:music.artist.track_contributions ?y .\n?y ns:music.track_contribution.track ?x .\n}\n", "logical_form": "( JOIN ( R [ music , track contribution , track ] ) ( JOIN ( R [ music , artist , track contributions ] ) [ Katherine Jenkins ] ) )", "golden_entities": {"m.01qrf09": "Katherine Jenkins"}, "answer_entities": {"m.0137q7dm": "Come What May (From Moulin Rouge)", "m.019db6x": "You Are My Miracle", "m.0dt_k5d": "I Will Always Love You", "m.0dvc1_d": "Music of the Night", "m.0dwf0l4": "Hallelujah", "m.0dxcr7l": "I Could Have Danced All Night", "m.0dxl9kt": "Pie Jesu", "m.0f19nx0": "(Everything I Do) I Do It for You", "m.0f1d618": "Nella Fantasia", "m.0f27vgt": "I Vow to Thee My Country", "m.0f6gq_w": "Music of the Night", "m.0fcnz2q": "The Flower Duet", "m.0fd_qhr": "O Mio Babbino Caro", "m.0nmjh_0": "Don't Cry for Me Argentina", "m.0q6ycw3": "Come What May", "m.0qcgnh8": "I've Dreamed of You", "m.0ztmg3": "Time to Say Goodbye", "m.0ztmgb": "Caruso", "m.0ztmhw": "Vide Cor Meum", "m.0ztmj2": "Calon Lan", "m.0ztmj9": "Hymn to the Fallen"}}, {"question": "what is ryan seacrest famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02b9g4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02b9g4 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Ryan Seacrest ] )", "golden_entities": {"m.02b9g4": "Ryan Seacrest"}, "answer_entities": {"m.015cjr": "Presenter", "m.01d_h8": "Film Producer", "m.02hrh1q": "Actor", "m.03gjzk": "Television producer", "m.08z956": "Radio personality", "m.0cbd2": "Writer", "m.0dxtg": "Screenwriter", "m.0dypbr": "TV Personality", "m.0np9r": "Voice Actor"}}, {"question": "what does george soros own", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gyk6w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gyk6w ns:organization.organization_founder.organizations_founded ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization founder , organizations founded ] ) [ George Soros ] )", "golden_entities": {"m.0gyk6w": "George Soros"}, "answer_entities": {"m.01xfs8": "Stefan Batory Foundation", "m.01xfsm": "Soros Foundation", "m.01xfsz": "Open Society Foundations", "m.0257nv": "MoveOn.org", "m.026q3wk": "Democracy Alliance", "m.02x7ztl": "Open Society Initiative for Southern Africa", "m.02y2n1": "Central European University", "m.03jqnf": "International Crisis Group", "m.0412s5k": "J Street", "m.043pjr5": "Open Society Archives", "m.048h_7": "Drug Policy Alliance", "m.04g4w2y": "Soros Foundations Network", "m.04lg6qs": "Alliance for Open Society International", "m.04nhs7": "Soros Fund Management", "m.064pprm": "Scholar Rescue Fund", "m.0b77zy_": "Institute for New Economic Thinking", "m.0cmf161": "Secretary of State Project"}}, {"question": "what time zone is maryville tn", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0_swz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0_swz ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Maryville ] )", "golden_entities": {"m.0_swz": "Maryville"}, "answer_entities": {"m.02hcv8": "Eastern Time Zone"}}, {"question": "who started the federal reserve board", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02xmb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02xmb ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ Federal Reserve System ] )", "golden_entities": {"m.02xmb": "Federal Reserve System"}, "answer_entities": {"m.02yy8": "Franklin D. Roosevelt", "m.03gfcd": "Carter Glass", "m.05n2sf": "Paul Warburg", "m.083q7": "Woodrow Wilson"}}, {"question": "where was emperor tiberius born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07hz1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07hz1 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Tiberius ] )", "golden_entities": {"m.07hz1": "Tiberius"}, "answer_entities": {"m.06c62": "Rome"}}, {"question": "what movies did zoe saldana play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qg6g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qg6g ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Zoe Saldana ] ) )", "golden_entities": {"m.05qg6g": "Zoe Saldana"}, "answer_entities": {"m.010kk6fr": "Star Trek 3", "m.012z22by": "Nina", "m.01vksx": "Pirates of the Caribbean: The Curse of the Black Pearl", "m.02814fp": "Constellation", "m.028b4ys": "Premium", "m.02rrh1w": "Vantage Point", "m.0322yj": "The Terminal", "m.03mg8qr": "Blackout", "m.048qrd": "Crossroads", "m.04f285v": "Takers", "m.04j08s9": "After Sex", "m.04ycptv": "Burning Palms", "m.050jdw": "Center Stage", "m.056p3k": "Get Over It", "m.05ldk6": "Guess Who", "m.05vnln": "Haven", "m.05zrdxt": "The Skeptic", "m.07mqwn": "Dirty Deeds", "m.07yjndt": "Death at a Funeral", "m.08jml6": "Drumline", "m.08phg9": "Star Trek", "m.0b6l1st": "The Losers", "m.0bth54": "Avatar", "m.0crwvd1": "Snipes", "m.0ddg_bs": "Colombiana", "m.0g53spr": "The Heart Specialist", "m.0gmbk1g": "Avatar 2", "m.0gwqhhn": "Avatar 3", "m.0gxt36r": "Idiots", "m.0h37n51": "The Words", "m.0hhqv27": "Star Trek Into Darkness", "m.0j9pkrn": "Out of the Furnace", "m.0jwsfxg": "Blood Ties", "m.0ryw0v0": "Guardians of the Galaxy", "m.0wbjb6l": "Infinitely Polar Bear", "m.0ynxx40": "The Book of Life"}}, {"question": "what does matt dallas do now", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dfyw6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dfyw6 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Matt Dallas ] )", "golden_entities": {"m.0dfyw6": "Matt Dallas"}, "answer_entities": {"m.02hrh1q": "Actor", "m.0d1pc": "Model"}}, {"question": "where was abraham buried", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pwb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pwb ns:people.deceased_person.place_of_burial ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Abraham ] )", "golden_entities": {"m.0pwb": "Abraham"}, "answer_entities": {"m.0jxp0": "Cave of the Patriarchs"}}, {"question": "where 's the hudson river", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cvyp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cvyp ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Hudson River ] )", "golden_entities": {"m.0cvyp": "Hudson River"}, "answer_entities": {"m.059g4": "North America", "m.09c7w0": "United States of America"}}, {"question": "where does the jordan river end", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cvy5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cvy5 ns:geography.river.mouth ?x .\n}\n", "logical_form": "( JOIN ( R [ geography , river , mouth ] ) [ Jordan River ] )", "golden_entities": {"m.0cvy5": "Jordan River"}, "answer_entities": {"m.02cnp": "Dead Sea"}}, {"question": "what school did michael jackson attend", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Michael Jackson ] ) )", "golden_entities": {"m.09889g": "Michael Jackson"}, "answer_entities": {"m.06lhpy": "Montclair College Preparatory School"}}, {"question": "what does kenya moore do for a living", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08cpnf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08cpnf ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Kenya Moore ] )", "golden_entities": {"m.08cpnf": "Kenya Moore"}, "answer_entities": {"m.01d_h8": "Film Producer", "m.02hrh1q": "Actor", "m.0d1pc": "Model", "m.0kyk": "Author"}}, {"question": "what country is barack obama from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Barack Obama ] )", "golden_entities": {"m.02mjmr": "Barack Obama"}, "answer_entities": {"m.09c7w0": "United States of America"}}, {"question": "who was wale signed to", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.049fb8r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.049fb8r ns:music.artist.label ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , label ] ) [ Wale ] )", "golden_entities": {"m.049fb8r": "Wale"}, "answer_entities": {"m.01trtc": "Interscope Records", "m.03rhqg": "Warner Bros. Records", "m.05zsdjw": "Roc Nation", "m.073tm9": "Def Jam Recordings", "m.0892fn": "Allido Records", "m.0dgnk3v": "Maybach Music Group", "m.0g768": "Atlantic Records"}}, {"question": "who did tyson chandler play for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05j8c8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05j8c8 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Tyson Chandler ] ) )", "golden_entities": {"m.05j8c8": "Tyson Chandler"}, "answer_entities": {"m.0jm3v": "New York Knicks", "m.0jmcv": "Dallas Mavericks"}}, {"question": "who played princess leia in star wars movies", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ddqw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ddqw ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Leia Organa ] ) )", "golden_entities": {"m.0ddqw": "Leia Organa"}, "answer_entities": {"m.01tnbn": "Carrie Fisher", "m.01wm357": "Eden Espinosa"}}, {"question": "where was saint joseph from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c08y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c08y ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Saint Joseph ] )", "golden_entities": {"m.0c08y": "Saint Joseph"}, "answer_entities": {"m.01cy_": "Bethlehem"}}, {"question": "what job did george w bush have", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09b6zr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09b6zr ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ George W. Bush ] )", "golden_entities": {"m.09b6zr": "George W. Bush"}, "answer_entities": {"m.012t_z": "Businessperson", "m.01qdsm": "Public speaker", "m.02hrh1q": "Actor", "m.0fj9f": "Politician", "m.0hltv": "Pilot", "m.0kyk": "Author"}}, {"question": "what are countries in south asia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06nn1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06nn1 ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ South Asia ] ) )", "golden_entities": {"m.06nn1": "South Asia", "m.01mp": "Country"}, "answer_entities": {"m.0162b": "Bangladesh", "m.0168b": "British Indian Ocean Territory", "m.016zwt": "Nepal", "m.02hjn": "Republic of Afghanistan", "m.03rk0": "India", "m.04ty8": "Maldives", "m.06m_5": "Sri Lanka", "m.07bxhl": "Bhutan", "m.0bq0p9": "British Raj", "m.0dbpy": "Democratic Republic of Afghanistan", "m.0jdd": "Afghanistan"}}, {"question": "where is the caribbean geographically located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0261m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0261m ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Caribbean ] )", "golden_entities": {"m.0261m": "Caribbean"}, "answer_entities": {"m.02613": "Caribbean Sea", "m.059g4": "North America", "m.07c5l": "Americas"}}]