[{"question": "what to do in venice beach ca", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_fl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_fl ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Venice ] )", "golden_entities": {"m.07_fl": "Venice"}, "answer_entities": {"m.01z4sg": "Muscle Beach", "m.027l5dg": "Venice United Methodist Church", "m.02rfng5": "Binoculars Building", "m.047b_hk": "Venice Canal Historic District", "m.047c1tt": "Venice Branch", "m.05p3m29": "Beyond Baroque Literary Arts Center", "m.09z99h": "First Lutheran Church of Venice", "m.0f7zgx": "Social and Public Art Resource Center", "m.0fy0rf": "L.A. Louver", "m.0hr5dd1": "72 Market Street Oyster Bar and Grill"}}, {"question": "where is fresno texas located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.010190)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.010190 ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Fresno ] )", "golden_entities": {"m.010190": "Fresno"}, "answer_entities": {"m.0mrs1": "Fort Bend County"}}, {"question": "what team rasheed wallace", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02hdjz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02hdjz ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Rasheed Wallace ] ) )", "golden_entities": {"m.02hdjz": "Rasheed Wallace"}, "answer_entities": {"m.0bwjj": "Boston Celtics", "m.0jm3v": "New York Knicks", "m.0jm5b": "Washington Wizards", "m.0jm64": "Atlanta Hawks", "m.0jm8l": "Detroit Pistons", "m.0jmm4": "Portland Trail Blazers"}}, {"question": "what county is orlando fl in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ply0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ply0 ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Orlando ] )", "golden_entities": {"m.0ply0": "Orlando"}, "answer_entities": {"m.0jrtv": "Orange County"}}, {"question": "where did sir donald bradman live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lylw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lylw ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Don Bradman ] )", "golden_entities": {"m.0lylw": "Don Bradman"}, "answer_entities": {"m.04_356": "Cootamundra"}}, {"question": "what is the name of the broncos mascot", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0289q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0289q ns:sports.sports_team.team_mascot ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , team mascot ] ) [ Denver Broncos ] )", "golden_entities": {"m.0289q": "Denver Broncos"}, "answer_entities": {"m.0_h1qbn": "Thunder", "m.027l54x": "Miles"}}]