[{"question": "what is zip code for chicago illinois", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_d4 ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ Chicago ] )", "golden_entities": {"m.01_d4": "Chicago"}, "answer_entities": {"m.01_6p_k": "60626", "m.01_6p6k": "60618", "m.01_6p8l": "60601", "m.01_6p9s": "60610", "m.01_6pdj": "60602", "m.01_6pgd": "60622", "m.01_6ph7": "60614", "m.01_6pmb": "60607", "m.01_6pnb": "60649", "m.01_6pp5": "60660", "m.01_6ps8": "60611", "m.01_6pvy": "60646", "m.01_6pxw": "60657", "m.01_6q0k": "60613", "m.01_6q1q": "60640", "m.01_6q8p": "60619", "m.01_6q9q": "60605", "m.01_6qcm": "60659", "m.01_6qjr": "60616", "m.01_6qp4": "60608", "m.01_6qrp": "60661", "m.01_6qsj": "60625", "m.01_6qz6": "60647", "m.01_6r1z": "60630", "m.01_6r78": "60603", "m.01_6r82": "60631", "m.01_6rf1": "60606", "m.01_6rfw": "60655", "m.01_6s_6": "60634", "m.01_6s0l": "60617", "m.01_6smy": "60609", "m.01_6sws": "60632", "m.01_6t1b": "60623", "m.01_6t43": "60629", "m.01_6t4y": "60652", "m.01_6t5r": "60638", "m.01_6t95": "60645", "m.01_6tgy": "60615", "m.01_6v4j": "60604", "m.01_6v6w": "60637", "m.01_6y3n": "60643", "m.01_6zk1": "60624", "m.01_7140": "60653", "m.01_71cx": "60666", "m.01_72xz": "60628", "m.01_73_n": "60641", "m.01_75zb": "60612", "m.01_77qt": "60639", "m.01_77x6": "60636", "m.01_78lh": "60651", "m.01_78nm": "60620", "m.01_78wb": "60654", "m.01_795b": "60644", "m.01_7gfz": "60656", "m.03dpqpb": "60621", "m.03dpqrm": "60633", "m.065rklh": "60642", "m.07nqmf7": "60701", "m.07nqmfg": "60699", "m.07nqmfp": "60697", "m.07nqmfx": "60696", "m.07nqmg_": "60690", "m.07nqmg3": "60695", "m.07nqmgb": "60694", "m.07nqmgk": "60693", "m.07nqmgs": "60691", "m.07nqmh6": "60689", "m.07nqmhf": "60688", "m.07nqmhn": "60687", "m.07nqmhw": "60686", "m.07nqmj2": "60685", "m.07nqmj9": "60684", "m.07nqmjj": "60682", "m.07nqmjr": "60681", "m.07nqmjz": "60680", "m.07nqmk5": "60678", "m.07nqmkd": "60677", "m.07nqmkm": "60675", "m.07nqmkv": "60674", "m.07nqml1": "60673", "m.07nqml8": "60670", "m.07nqmlh": "60669", "m.07nqmlq": "60668", "m.07nqmly": "60664", "m.07nqms5": "60290", "m.09sh942": "60657-3241", "m.0gs227r": "60637-1424"}}, {"question": "what is the name of book written by helen keller", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03ppx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03ppx ns:book.author.works_written ?x .\n?x ns:common.topic.notable_types ns:m.01xryvm .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Book ] ) ( JOIN ( R [ book , author , works written ] ) [ Helen Keller ] ) )", "golden_entities": {"m.03ppx": "Helen Keller", "m.01xryvm": "Book"}, "answer_entities": {"m.01ct51": "Light in My Darkness", "m.05mms2v": "The World I Live In", "m.068vwb6": "Let us have faith", "m.06clt38": "The open door", "m.06ct5x4": "Peace at eventide", "m.06d40b6": "Helen Keller, her Socialist years", "m.06gm4jn": "We bereaved", "m.06jh36g": "The faith of Helen Keller", "m.06l8ytp": "The miracle of life", "m.06qbwkz": "Teacher: Anne Sullivan Macy", "m.06vdh41": "My key of life", "m.0c1t3s9": "The modern woman", "m.0c1t3sh": "Optimism", "m.0c1t3sl": "Out of the dark", "m.0c1t3sp": "The song of the stone wall", "m.0d4wd9": "The Story of My Life"}}, {"question": "what year did aaron rodgers get drafted", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04q06_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04q06_ ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Aaron Rodgers ] ) )", "golden_entities": {"m.04q06_": "Aaron Rodgers"}, "answer_entities": {"m.05vsb7": "2005 NFL draft"}}, {"question": "where does the philadelphia union soccer team play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03mck3c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03mck3c ns:sports.sports_team.arena_stadium ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Philadelphia Union ] )", "golden_entities": {"m.03mck3c": "Philadelphia Union"}, "answer_entities": {"m.03clwrg": "PPL Park"}}, {"question": "where is the portuguese language derived from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05zjd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05zjd ns:base.rosetta.languoid.parent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , rosetta , languoid , parent ] ) [ Portuguese Language ] )", "golden_entities": {"m.05zjd": "Portuguese Language"}, "answer_entities": {"m.05tk9jx": "Portuguese-Galician Group"}}, {"question": "what city is the university of maryland university college in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mw1g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mw1g ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ University of Maryland University College ] )", "golden_entities": {"m.02mw1g": "University of Maryland University College"}, "answer_entities": {"m.01_kvkx": "Adelphi", "m.04rrd": "Maryland", "m.09c7w0": "United States of America"}}, {"question": "where was joseph p kennedy born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01qlg1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01qlg1 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Joseph P. Kennedy, Sr. ] )", "golden_entities": {"m.01qlg1": "Joseph P. Kennedy, Sr."}, "answer_entities": {"m.01cx_": "Boston"}}, {"question": "what musical instruments did duke ellington play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bdlj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bdlj ns:music.group_member.instruments_played ?x .\n}\n", "logical_form": "( JOIN ( R [ music , group member , instruments played ] ) [ Duke Ellington ] )", "golden_entities": {"m.0bdlj": "Duke Ellington"}, "answer_entities": {"m.05r5c": "Piano", "m.06ch55": "Jazz piano"}}, {"question": "where is the bank of america pavilion", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04790b8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04790b8 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Blue Hills Bank Pavilion ] )", "golden_entities": {"m.04790b8": "Blue Hills Bank Pavilion"}, "answer_entities": {"m.01cx_": "Boston", "m.0k3l5": "Suffolk County"}}, {"question": "who plays ray barone", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05h7f2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05h7f2 ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Ray Barone ] ) )", "golden_entities": {"m.05h7f2": "Ray Barone"}, "answer_entities": {"m.01h910": "Ray Romano"}}, {"question": "what movies did robert blake play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01jx92)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01jx92 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Robert Blake ] ) )", "golden_entities": {"m.01jx92": "Robert Blake"}, "answer_entities": {"m.01d259": "Lost Highway", "m.01wb95": "The Greatest Story Ever Told", "m.026hy89": "Coast to Coast", "m.0279xlz": "Three Violent People", "m.02q5nj9": "Second-Hand Hearts", "m.02vptkn": "Busting", "m.02vrr6j": "Ripped Off", "m.03ltls": "PT 109", "m.03w54r": "Pork Chop Hill", "m.04j12jk": "The Return of Rin Tin Tin", "m.04m_9jn": "Auto Antics", "m.04mwvdc": "Alfalfa's Double", "m.04mxbcs": "Time Out for Lessons", "m.04n2nzk": "Dad for a Day", "m.04n36xd": "Joy Scouts", "m.04n5zhb": "Captain Spanky's Show Boat", "m.04q0p56": "Calling All Kids", "m.04q0x8_": "Melodies Old and New", "m.04q0xcr": "Going to Press", "m.04q1nn_": "Come Back, Miss Pipps", "m.04q1qpp": "Wedding Worries", "m.04q1x_3": "The New Pupil", "m.04q2pmc": "Bubbling Troubles", "m.04q3hcr": "Three Smart Guys", "m.04q3pzw": "Unexpected Riches", "m.04q3t9s": "Baby Blues", "m.04q6gwh": "Doin' Their Bit", "m.04q6v3j": "The Big Premiere", "m.04q6vqs": "Helping Hands", "m.04q7lth": "Robot Wrecks", "m.04q7mlx": "Ye Olde Minstrels", "m.04q8716": "Tale of a Dog", "m.04q8dj0": "1-2-3 Go", "m.04q9wp8": "All About Hash", "m.04q9xgk": "Radio Bugs", "m.05fgnv": "Dancing Romeo", "m.05h114": "Electra Glide in Blue", "m.05z12j": "Tell Them Willie Boy Is Here", "m.07khwht": "Heart of a Champion: The Ray Mancini Story", "m.07shqj2": "Blood Feud", "m.08zdy_": "The Big Noise", "m.096z6g": "In Cold Blood", "m.09pggs1": "Bridal Suite", "m.09pghrc": "Andy Hardy's Double Life", "m.09pghy3": "Mokey", "m.09pgky9": "Apache War Smoke", "m.09rz5yy": "Marshal of Laredo", "m.09s26_l": "Trouble on the Trail", "m.09s26qc": "The Purple Gang", "m.0b3tsj6": "Homesteaders of Paradise Valley", "m.0b3txfm": "Great Stagecoach Robbery", "m.0bb_jhd": "Oregon Trail Scouts", "m.0bhh9g": "Money Train", "m.0c0l3nh": "Stagecoach to Denver", "m.0c1cdnr": "Revolt in the Big House", "m.0cg9l6_": "Tucson Raiders", "m.0cg9l76": "Colorado Pioneers", "m.0chvjcz": "Corky", "m.0d7fjb": "This Property Is Condemned", "m.0hndx7h": "Judgment Day: The John List Story", "m.0kv7x7": "Family Troubles"}}, {"question": "what city was barack obama born in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:people.person.place_of_birth ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ people , person , place of birth ] ) [ Barack Obama ] ) )", "golden_entities": {"m.02mjmr": "Barack Obama", "m.01m9": "City/Town/Village"}, "answer_entities": {"m.02hrh0_": "Honolulu"}}, {"question": "what films have johnny depp been in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jfx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jfx1 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Johnny Depp ] ) )", "golden_entities": {"m.0jfx1": "Johnny Depp"}, "answer_entities": {"m.010pd7hh": "Black Mass", "m.011lzwh3": "Yoga Hosers", "m.01s3vk": "Edward Scissorhands", "m.01vksx": "Pirates of the Caribbean: The Curse of the Black Pearl", "m.025_5c": "The Ninth Gate", "m.028f12": "Benny & Joon", "m.02kvpf": "Secret Window", "m.02lxrv": "Ed Wood", "m.02qfnrg": "London Fields", "m.02qr8lh": "The Source", "m.02r79_h": "The Imaginarium of Doctor Parnassus", "m.02t276": "Once Upon a Time in Mexico", "m.02wwmhc": "The Rum Diary", "m.0306c6": "What's Eating Gilbert Grape", "m.034nnw": "Don Juan DeMarco", "m.03y0pn": "Pirates of the Caribbean: Dead Man's Chest", "m.03z9585": "The Tourist", "m.04165w": "Finding Neverland", "m.042w0v2": "Sonic the Hedgehog", "m.047dsy7": "Cannes Man", "m.04jpg2p": "Alice in Wonderland", "m.04lgx5r": "Slow Burn", "m.04pk1f": "Charlie and the Chocolate Factory", "m.050xxm": "Corpse Bride", "m.052q5y": "Cry-Baby", "m.056n0f": "The Man Who Cried", "m.05890x6": "When You're Strange", "m.05nlx4": "Pirates of the Caribbean: At World's End", "m.05s077": "The Brave", "m.05v38p": "Chocolat", "m.063dp0": "Nick of Time", "m.06cpd9": "Donnie Brasco", "m.06lspc": "Arizona Dream", "m.06r1z1": "The Libertine", "m.06v_2g": "The Astronaut's Wife", "m.06w99h3": "Rango", "m.08dl83": "Freddy's Dead: The Final Nightmare", "m.08ll52": "A Nightmare on Elm Street", "m.099vtk": "Shantaram", "m.09g7vfw": "Dark Shadows", "m.09gp2cp": "The Devil, the Sinner, and His Journey", "m.09hq9g": "Private Resort", "m.09v8clw": "Pirates of the Caribbean: On Stranger Tides", "m.0bmfzxx": "Wild Roses, Tender Roses", "m.0bq8tmw": "21 Jump Street", "m.0c34mt": "From Hell", "m.0ch3dxb": "Divine Rapture", "m.0ch3qr1": "Jack and Jill", "m.0clh4y": "Before Night Falls", "m.0ds11z": "Sweeney Todd: The Demon Barber of Fleet Street", "m.0dsf7lf": "The Lone Ranger", "m.0f8j13": "Fear and Loathing in Las Vegas", "m.0fg04": "Sleepy Hollow", "m.0g3zrd": "Public Enemies", "m.0g7nb_": "Deep Sea 3D", "m.0h_dv23": "Pirates of the Caribbean: Dead Men Tell No Tales", "m.0kv5xw": "Happily Ever After", "m.0kvd2g": "L.A. Without a Map", "m.0n_hp": "Blow", "m.0sxmx": "Platoon", "m.0symg": "Dead Man", "m.0v8_gw0": "Transcendence", "m.0w2sx8x": "Into the Woods", "m.0x15942": "Tusk", "m.0y4m_xb": "Alice in Wonderland: Through the Looking Glass", "m.0y4n1sq": "Mortdecai"}}, {"question": "what country did vasco da gama came from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c8dk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c8dk ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Vasco da Gama ] )", "golden_entities": {"m.0c8dk": "Vasco da Gama"}, "answer_entities": {"m.01hk04": "Portuguese Empire"}}, {"question": "what is the current government of vietnam", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01crd5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01crd5 ns:location.country.form_of_government ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , form of government ] ) [ Vietnam ] )", "golden_entities": {"m.01crd5": "Vietnam"}, "answer_entities": {"m.01fkst": "Communist state", "m.025tbxf": "Socialist state", "m.0py4y": "Single-party state"}}, {"question": "who did jason segel date", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06q5t7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06q5t7 ns:base.popstra.celebrity.dated ?y .\n?y ns:base.popstra.dated.participant ?x .\n}\n", "logical_form": "( JOIN ( R [ base , popstra , dated , participant ] ) ( JOIN ( R [ base , popstra , celebrity , dated ] ) [ Jason Segel ] ) )", "golden_entities": {"m.06q5t7": "Jason Segel"}, "answer_entities": {"m.02pjvc": "Linda Cardellini"}}, {"question": "where christopher columbus was born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pwz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pwz ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Christopher Columbus ] )", "golden_entities": {"m.01pwz": "Christopher Columbus"}, "answer_entities": {"m.0hknf": "Genoa"}}, {"question": "what are the main sports in new zealand", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ctw_b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ctw_b ns:sports.sports_team_location.teams ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team location , teams ] ) [ New Zealand ] )", "golden_entities": {"m.0ctw_b": "New Zealand"}, "answer_entities": {"m.0148q6": "New Zealand national rugby union team", "m.0260pzv": "New Zealand women's national field hockey team", "m.02fbb5": "New Zealand national cricket team", "m.02q1tv9": "New Zealand Davis Cup team", "m.02r5mr_": "New Zealand Fed Cup team", "m.02wbmc2": "New Zealand men's national ice hockey team", "m.03_44z": "New Zealand national football team", "m.0341ld": "New Zealand Warriors", "m.03d1rs_": "New Zealand national korfball team", "m.03svm9": "New Zealand national rugby league team", "m.03yj5rj": "New Zealand national handball team", "m.03yj691": "New Zealand women's national basketball team", "m.0400zd": "New Zealand national netball team", "m.04cyzks": "Junior Kiwis", "m.04d0vm": "New Zealand national basketball team", "m.04g2874": "New Zealand national badminton team", "m.04h1bh": "Wheel Blacks", "m.04j9x_0": "New Zealand women's national under-20 football team", "m.04jntyb": "New Zealand women's national under-17 football team", "m.05szm73": "New Zealand men's national water polo team", "m.06qvwt": "New Zealand women's national cricket team", "m.06rnv3": "A1 Team New Zealand", "m.07djk2": "New Zealand A cricket team", "m.09bnzz": "New Zealand national Australian rules football team", "m.09nm9w": "New Zealand women's national rugby union team", "m.0c_76q": "Junior All Blacks", "m.0f4rf7": "New Zealand women's national football team", "m.0fyd4k": "Stone Brothers Racing"}}, {"question": "what language do you speak in finland", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vzc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vzc ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Finland ] )", "golden_entities": {"m.02vzc": "Finland"}, "answer_entities": {"m.01gp_d": "Finnish Language", "m.02lpg6": "Saami, Inari Language", "m.04d36l": "Saami, North Language", "m.06mp7": "Swedish Language"}}, {"question": "what are shirley temple kids names", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03d9v8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03d9v8 ns:people.person.children ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , children ] ) [ Shirley Temple ] )", "golden_entities": {"m.03d9v8": "Shirley Temple"}, "answer_entities": {"m.028bpn9": "Lori Black", "m.0gy7501": "Charles Alden Black Jr.", "m.0gy7508": "Linda Susan Agar"}}, {"question": "what position does terrell owens play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027ddp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027ddp ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.position ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , position ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Terrell Owens ] ) )", "golden_entities": {"m.027ddp": "Terrell Owens"}, "answer_entities": {"m.02g_6x": "Wide receiver"}}, {"question": "what did kourtney kardashian go to college for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043ttm7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043ttm7 ns:people.person.education ?y .\n?y ns:education.education.major_field_of_study ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , major field of study ] ) ( JOIN ( R [ people , person , education ] ) [ Kourtney Kardashian ] ) )", "golden_entities": {"m.043ttm7": "Kourtney Kardashian"}, "answer_entities": {"m.03qsdpk": "Theatre"}}, {"question": "where is bergen belsen concentration camp located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0139dh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0139dh ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Bergen-Belsen concentration camp ] )", "golden_entities": {"m.0139dh": "Bergen-Belsen concentration camp"}, "answer_entities": {"m.0345h": "Germany"}}, {"question": "who was louis xvi", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dj9w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dj9w ns:royalty.noble_person.titles ?y .\n?y ns:royalty.noble_title_tenure.noble_title ?x .\n}\n", "logical_form": "( JOIN ( R [ royalty , noble title tenure , noble title ] ) ( JOIN ( R [ royalty , noble person , titles ] ) [ Louis XVI of France ] ) )", "golden_entities": {"m.0dj9w": "Louis XVI of France"}, "answer_entities": {"m.0290vf": "Duke of Normandy", "m.05st_0j": "King of France", "m.063032x": "King of Navarre"}}, {"question": "what did donna summers die from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0136p1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0136p1 ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Donna Summer ] )", "golden_entities": {"m.0136p1": "Donna Summer"}, "answer_entities": {"m.04p3w": "Lung cancer", "m.0qcr0": "Cancer"}}, {"question": "what year did allen iverson get married", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01sg7_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01sg7_ ns:people.person.spouse_s ?y .\n?y ns:people.marriage.from ?x .\n}\n", "logical_form": "( JOIN ( R [ people , marriage , from ] ) ( JOIN ( R [ people , person , spouse s ] ) [ Allen Iverson ] ) )", "golden_entities": {"m.01sg7_": "Allen Iverson"}, "answer_entities": {"value": "2001-08-03"}}, {"question": "when did the battle of thermopylae occur", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.014px1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.014px1 ns:time.event.start_date ?x .\n}\n", "logical_form": "( JOIN ( R [ time , event , start date ] ) [ Battle of Thermopylae ] )", "golden_entities": {"m.014px1": "Battle of Thermopylae"}, "answer_entities": {"value": "-479"}}, {"question": "where did eleanor roosevelt go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02n9k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02n9k ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Eleanor Roosevelt ] ) )", "golden_entities": {"m.02n9k": "Eleanor Roosevelt"}, "answer_entities": {"m.03j_v35": "Allenswood Academy", "m.06thjt": "The New School"}}, {"question": "who played jacob black", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02qd_td)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02qd_td ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Jacob Black ] ) )", "golden_entities": {"m.02qd_td": "Jacob Black"}, "answer_entities": {"m.07ldhs": "Taylor Lautner"}}, {"question": "what movies star adam sandler", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pz91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pz91 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Adam Sandler ] ) )", "golden_entities": {"m.0pz91": "Adam Sandler"}, "answer_entities": {"m.010rdrd1": "Pixels", "m.0118fw_v": "Hotel Transylvania 2", "m.012z_7zt": "The Ridiculous Six", "m.01h3y_": "The Hot Chick", "m.01x_hw": "The Waterboy", "m.023vcd": "Happy Gilmore", "m.02bhsc": "The Wedding Singer", "m.02d003": "Anger Management", "m.02dxrm": "Confessions of a Teenage Drama Queen", "m.02f6g5": "50 First Dates", "m.02hwd1n": "Reign Over Me", "m.02hxhz": "Big Daddy", "m.02m7tn": "Eight Crazy Nights", "m.02ph9tm": "You Don't Mess with the Zohan", "m.02q3pj": "Dirty Work", "m.02qdrjx": "Bedtime Stories", "m.02tgz4": "Mr Deeds", "m.02ylg6": "Punch-Drunk Love", "m.036z1n": "Billy Madison", "m.03qfpk": "Airheads", "m.03z20c": "Little Nicky", "m.047419": "Bulletproof", "m.047svrl": "Funny People", "m.04p7q_": "Spanglish", "m.05s14k": "Deuce Bigalow: Male Gigolo", "m.05yxmk": "Coneheads", "m.0640m69": "Grown Ups", "m.06j0d5": "The Animal", "m.070rc_": "Pauly Shore Is Dead", "m.074w86": "Deuce Bigalow: European Gigolo", "m.07hq75": "Shakes the Clown", "m.07kb7vh": "Zookeeper", "m.07ktmd": "Going Overboard", "m.087pfc": "Click", "m.095z4q": "The Longest Yard", "m.0bshwmp": "Just Go With It", "m.0ch3qr1": "Jack and Jill", "m.0crryph": "Comedy Club Shoot-out: Vol. 1", "m.0d0stl": "Mixed Nuts", "m.0f2sx4": "I Now Pronounce You Chuck and Larry", "m.0gj96ln": "Hotel Transylvania", "m.0glpgxk": "Pearl Jam Twenty", "m.0gwgn1k": "That's My Boy", "m.0j_z7p9": "Singing with the Stars", "m.0jwnx61": "Saturday Night Live: The Best of Adam Sandler", "m.0mzt5cs": "Grown Ups 2", "m.0v_ckgv": "Blended", "m.0w7c5jm": "Blossoms & Blood", "m.0w7c7c3": "Couch", "m.0zrq8j3": "Men, Women & Children", "m.0zrxc1v": "The Cobbler"}}, {"question": "where did president kennedy go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ John F. Kennedy ] ) )", "golden_entities": {"m.0d3k14": "John F. Kennedy"}, "answer_entities": {"m.01mpwj": "Harvard College", "m.02bb47": "Stanford Graduate School of Business", "m.02hdpx": "Choate Rosemary Hall", "m.03ksy": "Harvard University", "m.03qs17": "Noble and Greenough School", "m.05yk0g": "Canterbury School", "m.05zl0": "Princeton University", "m.08kml_": "Riverdale Country School", "m.0b7824": "Dexter School", "m.0ccg42": "Edward Devotion School"}}, {"question": "what happened at fukushima daiichi nuclear plant", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vkzy2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vkzy2 ns:common.topic.notable_for ?y .\n?y ns:common.notable_for.notable_object ?x .\n}\n", "logical_form": "( JOIN ( R [ common , notable for , notable object ] ) ( JOIN ( R [ common , topic , notable for ] ) [ Fukushima Daiichi Nuclear Power Plant ] ) )", "golden_entities": {"m.02vkzy2": "Fukushima Daiichi Nuclear Power Plant"}, "answer_entities": {"m.05czkfp": "Disaster-affected structure"}}, {"question": "who was louis kossuth", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.021xrk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.021xrk ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Lajos Kossuth ] )", "golden_entities": {"m.021xrk": "Lajos Kossuth"}, "answer_entities": {"m.04gc2": "Lawyer", "m.0fj9f": "Politician"}}, {"question": "what country do arabic people come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xff)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xff ns:people.ethnicity.includes_groups ?x .\n}\n", "logical_form": "( JOIN ( R [ people , ethnicity , includes groups ] ) [ Arabs ] )", "golden_entities": {"m.0xff": "Arabs"}, "answer_entities": {"m.02pfy17": "Syrian people", "m.0466nw8": "Lebanese people", "m.07478ps": "Arabs in India", "m.0c09hgt": "Iraqi people", "m.0gwgnk": "Arabs in Turkey", "m.0jt7v76": "Palestinians"}}, {"question": "when did the red sox win the pennant", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01d5z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01d5z ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Boston Red Sox ] )", "golden_entities": {"m.01d5z": "Boston Red Sox"}, "answer_entities": {"m.018n8": "1903 World Series", "m.0268bkj": "2007 World Series", "m.044ym6": "2004 World Series", "m.0469hv": "1918 World Series", "m.04tf98": "1912 World Series", "m.04tg7d": "1916 World Series", "m.04tg7r": "1915 World Series", "m.0ds324c": "2013 World Series"}}, {"question": "where did harry truman die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09bg4l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09bg4l ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Harry S. Truman ] )", "golden_entities": {"m.09bg4l": "Harry S. Truman"}, "answer_entities": {"m.04f_d": "Kansas City"}}, {"question": "what was prince charles last name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xnc3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xnc3 ns:base.schemastaging.context_name.official_name ?x .\n}\n", "logical_form": "( JOIN ( R [ base , schemastaging , context name , official name ] ) [ Charles, Prince of Wales ] )", "golden_entities": {"m.0xnc3": "Charles, Prince of Wales"}, "answer_entities": {"value": "Charles Philip Arthur George"}}, {"question": "what website did mark zuckerberg co founder", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.086dny)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.086dny ns:internet.website_owner.websites_owned ?x .\n}\n", "logical_form": "( JOIN ( R [ internet , website owner , websites owned ] ) [ Mark Zuckerberg ] )", "golden_entities": {"m.086dny": "Mark Zuckerberg"}, "answer_entities": {"m.02y1vz": "Facebook"}}, {"question": "what bass does jared followill use", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01w3xqs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01w3xqs ns:music.group_member.instruments_played ?x .\n?x ns:music.instrument.family ns:m.01vj9c .\n}\n", "logical_form": "( AND ( JOIN [ music , instrument , family ] [ Bass ] ) ( JOIN ( R [ music , group member , instruments played ] ) [ Jared Followill ] ) )", "golden_entities": {"m.01w3xqs": "Jared Followill", "m.01vj9c": "Bass"}, "answer_entities": {"m.018vs": "Bass guitar"}}]