[{"question": "what cities are in oakland county michigan", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0nj7b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0nj7b ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ location , location , contains ] ) [ Oakland County ] ) )", "golden_entities": {"m.0nj7b": "Oakland County", "m.01m9": "City/Town/Village"}, "answer_entities": {"m.01_n1z_": "Bingham Farms", "m.01_sd2f": "Lake Angelus", "m.01_sdrk": "Lake Orion", "m.01_srp0": "Leonard", "m.01_wrzy": "Sylvan Lake", "m.013f50": "Northville", "m.01m8tz": "Bloomfield Township", "m.01m8vb": "West Bloomfield Township", "m.03gygh": "Pontiac Township", "m.048myk": "Drayton Plains", "m.048n0x": "Union Lake", "m.049__g_": "Rose Corners", "m.049_1l3": "Charing Cross", "m.049_5lr": "Newark", "m.049_6ys": "Rudds Mill", "m.049_8yl": "Yates", "m.049_d6j": "Seven Harbors", "m.049_ffc": "Bunny Run", "m.049_gwb": "Groveland Corners", "m.049_j2k": "Farmington Hills Post Office", "m.049_j41": "Hazel Park Post Office", "m.049_j51": "Briarwood Senior Housing", "m.049_j7k": "Keego Harbor Post Office", "m.049_k6c": "Andersonville", "m.049_kjf": "Auburn Heights", "m.049_kl_": "Austin Corners", "m.049_lg0": "Big Beaver", "m.049_lv8": "Brandon Gardens", "m.049_mht": "Campbells Corner", "m.049_nd8": "Clyde", "m.049_p0h": "Davisburg", "m.049_pr8": "East Highland", "m.049_qgf": "Farmington Acres", "m.049_qyz": "Four Towns", "m.049_rdr": "Gingellville", "m.049_rh9": "Glengary", "m.049_rlv": "Goodison", "m.049_skq": "Hickory Ridge", "m.049_slz": "Highland", "m.049_tgq": "Jossman Acres", "m.049_v2c": "Lake Orion Heights", "m.049_v5g": "Lakeville", "m.049_xf8": "New Hudson", "m.049_xrz": "North Farmington", "m.049_xzm": "Oak Grove", "m.049_y2x": "Oakley Park", "m.049_y4d": "Oakwood", "m.049_ylm": "Oxbow", "m.049_z1y": "Perry Lake Heights", "m.049z__5": "Westacres", "m.049z_3g": "White Lake", "m.049z_j_": "Wood Creek Farms", "m.049zysb": "Thomas", "m.049zzmp": "Walters", "m.049zzpq": "Waterford", "m.049zzyd": "West Highland", "m.04b0194": "Stony Creek", "m.0nr3p": "Ferndale", "m.0vg6f": "Addison Township", "m.0vg6s": "Auburn Hills", "m.0vg74": "Berkley", "m.0vg7h": "Beverly Hills", "m.0vg8j": "Birmingham", "m.0vg8x": "Bloomfield Hills", "m.0vg97": "Brandon Township", "m.0vg9l": "Clawson", "m.0vg9y": "Commerce Township", "m.0vgb8": "Farmington", "m.0vgbm": "Farmington Hills", "m.0vgbz": "Franklin", "m.0vgc_": "Highland Township", "m.0vgc9": "Groveland Township", "m.0vgcn": "Hazel Park", "m.0vgdb": "Holly", "m.0vgdp": "Holly Township", "m.0vgf0": "Huntington Woods", "m.0vgfc": "Independence Township", "m.0vgfq": "Keego Harbor", "m.0vl_5": "Lyon Township", "m.0vl_j": "Milford Township", "m.0vl_w": "Novi", "m.0vlzh": "Lathrup Village", "m.0vm06": "Novi Township", "m.0vm0k": "Oak Park", "m.0vm17": "Orchard Lake", "m.0vm1l": "Orion Township", "m.0vm1y": "Ortonville", "m.0vm28": "Oxford", "m.0vm2m": "Oxford Charter Township", "m.0vm2z": "Pleasant Ridge", "m.0vm39": "Pontiac", "m.0vm3r": "Rochester", "m.0vm42": "Rochester Hills", "m.0vm4f": "Rose Township", "m.0vm53": "Royal Oak Charter Township", "m.0vm5g": "South Lyon", "m.0vm5t": "Southfield", "m.0vm64": "Southfield Township", "m.0vm6h": "Springfield Township", "m.0vm75": "Troy", "m.0vm7k": "Clarkston", "m.0vm7x": "Walled Lake", "m.0vm87": "Waterford Township", "m.0vm8l": "White Lake Township", "m.0vm8y": "Wixom", "m.0vm98": "Wolverine Lake", "m.0xc0s": "Madison Heights", "m.0xc13": "Milford"}}, {"question": "when did the 7th harry potter book come out", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03bkkv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03bkkv ns:book.written_work.date_of_first_publication ?x .\n}\n", "logical_form": "( JOIN ( R [ book , written work , date of first publication ] ) [ Harry Potter and the Deathly Hallows ] )", "golden_entities": {"m.03bkkv": "Harry Potter and the Deathly Hallows"}, "answer_entities": {"value": "2007-07-21"}}, {"question": "where is south carolina located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06yxd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06yxd ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , administrative parent ] ) [ South Carolina ] )", "golden_entities": {"m.06yxd": "South Carolina"}, "answer_entities": {"m.09c7w0": "United States of America"}}, {"question": "who are paul revere 's parents", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0db0x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0db0x ns:people.person.parents ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , parents ] ) [ Paul Revere ] )", "golden_entities": {"m.0db0x": "Paul Revere"}, "answer_entities": {"m.0qd6j_b": "Deborah Hitchborn", "m.0qd6jv4": "Apollos Rivoire"}}, {"question": "who is the current coach of the chicago bulls", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jm74)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jm74 ns:basketball.basketball_team.head_coach ?x .\n}\n", "logical_form": "( JOIN ( R [ basketball , basketball team , head coach ] ) [ Chicago Bulls ] )", "golden_entities": {"m.0jm74": "Chicago Bulls"}, "answer_entities": {"m.043jv80": "Tom Thibodeau"}}, {"question": "what awards has morgan freeman won", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.055c8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.055c8 ns:award.award_winner.awards_won ?y .\n?y ns:award.award_honor.award ?x .\n}\n", "logical_form": "( JOIN ( R [ award , award honor , award ] ) ( JOIN ( R [ award , award winner , awards won ] ) [ Morgan Freeman ] ) )", "golden_entities": {"m.055c8": "Morgan Freeman"}, "answer_entities": {"m.019f7x": "Golden Globe Award for Best Actor \u2013 Motion Picture Musical or Comedy", "m.025j12": "Kennedy Center Honors", "m.027b9j5": "London Film Critics' Circle Award for Actor of the Year", "m.027c95y": "National Board of Review Award for Best Actor", "m.02f2hd": "NAACP Image Award for Outstanding Actor in a Motion Picture", "m.02f2kw": "NAACP Image Award for Outstanding Supporting Actor in a Motion Picture", "m.02spb2": "AFI Life Achievement Award", "m.02x73k6": "National Society of Film Critics Award for Best Supporting Actor", "m.02x8n1n": "Independent Spirit Award for Best Supporting Male", "m.054ky1": "Golden Globe Cecil B. DeMille Award", "m.07n939s": "Golden Icon", "m.09sdmz": "Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Supporting Role", "m.09tly71": "People's Choice Award for Favorite Cast", "m.0gkmcgj": "Camie Award", "m.0gqy2": "Academy Award for Best Actor in a Supporting Role", "m.0hj8khy": "People's Choice Award for Favorite Movie Icon", "m.0lyxb7f": "American Society of Cinematographers Board of the Governors Award", "m.0zbhqxc": "Obie Award for Performance"}}, {"question": "who were michael jackson 's brothers and sisters", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:people.person.sibling_s ?y .\n?y ns:people.sibling_relationship.sibling ?x .\n}\n", "logical_form": "( JOIN ( R [ people , sibling relationship , sibling ] ) ( JOIN ( R [ people , person , sibling s ] ) [ Michael Jackson ] ) )", "golden_entities": {"m.09889g": "Michael Jackson"}, "answer_entities": {"m.013v5j": "La Toya Jackson", "m.01s993": "Jackie Jackson", "m.01s9b9": "Tito Jackson", "m.01zmpg": "Jermaine Jackson", "m.023_5s": "Marlon Jackson", "m.0247h4": "Rebbie Jackson", "m.04_70v": "Randy Jackson", "m.0598rr3": "Joh'Vonnie Jackson", "m.0gbwp": "Janet Jackson", "m.0nf3l7y": "Brandon Jackson"}}, {"question": "what teams did george steinbrenner own", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01q5t3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01q5t3 ns:sports.sports_team_owner.teams_owned ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team owner , teams owned ] ) [ George Steinbrenner ] )", "golden_entities": {"m.01q5t3": "George Steinbrenner"}, "answer_entities": {"m.0cqt41": "New York Yankees"}}, {"question": "what to see and do in revelstoke", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02qrmp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02qrmp ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Revelstoke ] )", "golden_entities": {"m.02qrmp": "Revelstoke"}, "answer_entities": {"m.01gznn": "Glacier National Park", "m.057pc4": "Illecillewaet River", "m.06ygx0": "Lake Revelstoke", "m.079rx0": "Kinbasket Lake", "m.0bmy6_": "Arrow Lakes Provincial Park", "m.0bnkzr": "Blanket Creek Provincial Park", "m.0bx3_5": "Martha Creek Provincial Park", "m.0kc5m6f": "Interior Forestry Museum", "m.0kc5m6n": "Nickelodeon Museum", "m.0kc5m6w": "Crazy Creek Falls"}}, {"question": "what guitar did andres segovia use", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jg34)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jg34 ns:music.group_member.instruments_played ?x .\n}\n", "logical_form": "( JOIN ( R [ music , group member , instruments played ] ) [ Andr\u00e9s Segovia ] )", "golden_entities": {"m.0jg34": "Andr\u00e9s Segovia"}, "answer_entities": {"m.0342h": "Guitar"}}, {"question": "what style of art did vincent van gogh do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m2 ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}\n", "logical_form": "( JOIN ( R [ visual art , visual artist , associated periods or movements ] ) [ Vincent van Gogh ] )", "golden_entities": {"m.07_m2": "Vincent van Gogh"}, "answer_entities": {"m.015xrq": "Post-Impressionism"}}, {"question": "where did the tutsi come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hnv0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hnv0 ns:people.ethnicity.geographic_distribution ?x .\n}\n", "logical_form": "( JOIN ( R [ people , ethnicity , geographic distribution ] ) [ Tutsi ] )", "golden_entities": {"m.0hnv0": "Tutsi"}, "answer_entities": {"m.06dfg": "Rwanda"}}, {"question": "what country did osama bin laden live in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05mg9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05mg9 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Osama bin Laden ] ) )", "golden_entities": {"m.05mg9": "Osama bin Laden"}, "answer_entities": {"m.01z215": "Saudi Arabia", "m.05sb1": "Pakistan", "m.06tw8": "Sudan", "m.0jdd": "Afghanistan"}}, {"question": "where was the roman empire centered", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06cmp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06cmp ns:location.country.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , capital ] ) [ Roman Empire ] )", "golden_entities": {"m.06cmp": "Roman Empire"}, "answer_entities": {"m.01q0l": "Constantinople", "m.06c62": "Rome", "m.09b93": "Ravenna"}}, {"question": "which ocean does the murray river flow into", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_4l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_4l ns:geography.river.mouth ?x .\n?x ns:geography.geographical_feature.category ns:m.05kq4 .\n}\n", "logical_form": "( AND ( JOIN [ geography , geographical feature , category ] [ Ocean ] ) ( JOIN ( R [ geography , river , mouth ] ) [ Murray River ] ) )", "golden_entities": {"m.04_4l": "Murray River", "m.05kq4": "Ocean"}, "answer_entities": {"m.06nqw": "Southern Ocean"}}, {"question": "what time zone is cincinnati oh in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01snm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01snm ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Cincinnati ] )", "golden_entities": {"m.01snm": "Cincinnati"}, "answer_entities": {"m.02hcv8": "Eastern Time Zone"}}, {"question": "what are west african countries", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hqjh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hqjh ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ West Africa ] ) )", "golden_entities": {"m.0hqjh": "West Africa", "m.01mp": "Country"}, "answer_entities": {"m.0164v": "Benin", "m.01699": "Burkina Faso", "m.02fdq": "Dahomey", "m.035dk": "Ghana", "m.03676": "Guinea", "m.036b_": "Guinea-Bissau", "m.04hzj": "Liberia", "m.04v09": "Mali", "m.04vjh": "Mauritania", "m.05cgv": "Nigeria", "m.06s_2": "Sierra Leone", "m.06srk": "Senegal", "m.07f5x": "Togo", "m.0c3fp": "Biafra", "m.0fsfyj": "People's Republic of Benin", "m.0fv4v": "Ivory Coast", "m.0hdx8": "Gambia"}}, {"question": "where is mallorca", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g52z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g52z ns:geography.island.body_of_water ?x .\n}\n", "logical_form": "( JOIN ( R [ geography , island , body of water ] ) [ Majorca ] )", "golden_entities": {"m.0g52z": "Majorca"}, "answer_entities": {"m.04swx": "Mediterranean Sea"}}, {"question": "what years have the cubs been in the world series", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01yjl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01yjl ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ Chicago Cubs ] )", "golden_entities": {"m.01yjl": "Chicago Cubs"}, "answer_entities": {"m.04tg8s": "1908 World Series", "m.04tg9h": "1907 World Series"}}, {"question": "what car companies does ford motor company own", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02zs4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02zs4 ns:automotive.company.make_s ?x .\n}\n", "logical_form": "( JOIN ( R [ automotive , company , make s ] ) [ Ford Motor Company ] )", "golden_entities": {"m.02zs4": "Ford Motor Company"}, "answer_entities": {"m.018ff1": "Edsel", "m.01q0ll": "Rover", "m.02k_k3t": "Ford", "m.098k2y": "Ford of Britain", "m.0h5z7_s": "Mercury", "m.0vv3w28": "Lincoln"}}, {"question": "what type of government does the bahamas", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0160w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0160w ns:location.country.form_of_government ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , form of government ] ) [ Bahamas ] )", "golden_entities": {"m.0160w": "Bahamas"}, "answer_entities": {"m.018wl5": "Parliamentary system", "m.01fpfn": "Unitary state", "m.01q20": "Constitutional monarchy"}}, {"question": "what language do the people in ghana speak", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035dk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035dk ns:location.country.official_language ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , official language ] ) [ Ghana ] )", "golden_entities": {"m.035dk": "Ghana"}, "answer_entities": {"m.02h40lc": "English Language"}}, {"question": "where is luke afb arizona", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04twg5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04twg5 ns:location.location.street_address ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ location , location , street address ] ) [ Luke Air Force Base ] ) )", "golden_entities": {"m.04twg5": "Luke Air Force Base"}, "answer_entities": {"m.0qplq": "Glendale"}}, {"question": "what language people speak in belgium", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0154j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0154j ns:location.country.languages_spoken ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , languages spoken ] ) [ Belgium ] )", "golden_entities": {"m.0154j": "Belgium"}, "answer_entities": {"m.02bv9": "Dutch Language", "m.02drlb": "Picard Language", "m.02y3v": "West Flemish", "m.04306rv": "German Language", "m.064_8sq": "French"}}, {"question": "what was lincoln 's wife 's name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , marriage , spouse ] ) ( JOIN ( R [ people , person , spouse s ] ) [ Abraham Lincoln ] ) ) )", "golden_entities": {"m.0gzh": "Abraham Lincoln", "m.02zsn": "Female"}, "answer_entities": {"m.01ypl0": "Mary Todd Lincoln"}}, {"question": "what did king george vi die of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cm83)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cm83 ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ George VI ] )", "golden_entities": {"m.0cm83": "George VI"}, "answer_entities": {"m.04p3w": "Lung cancer"}}, {"question": "what type of currency is used in the united kingdom", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ssc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ssc ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ United Kingdom ] )", "golden_entities": {"m.07ssc": "United Kingdom"}, "answer_entities": {"m.01nv4h": "Pound sterling"}}, {"question": "what city was robert kennedy killed in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06hx2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06hx2 ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Robert F. Kennedy ] )", "golden_entities": {"m.06hx2": "Robert F. Kennedy"}, "answer_entities": {"m.030qb3t": "Los Angeles"}}, {"question": "who plays the new michael myers", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03zj8n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03zj8n ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ The Shape ] ) )", "golden_entities": {"m.03zj8n": "The Shape"}, "answer_entities": {"m.026833n": "Don Shanks", "m.02rr5hs": "Daeg Faerch", "m.03cqsk8": "Chris Durand", "m.06rhfg": "Tyler Mane", "m.07kgxlq": "Chase Wright Vanek", "m.0bh7kk": "Nick Castle", "m.0ccvdt": "George P. Wilbur", "m.0d9zjs": "Brad Loree", "m.0fq13_2": "Tony Moran", "m.0gf652": "Dick Warlock", "m.0z7zr76": "Adam Gunn"}}, {"question": "what theme songs did alan thicke wrote", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02wd48)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02wd48 ns:music.composer.compositions ?x .\n}\n", "logical_form": "( JOIN ( R [ music , composer , compositions ] ) [ Alan Thicke ] )", "golden_entities": {"m.02wd48": "Alan Thicke"}, "answer_entities": {"m.0_jvj26": "Facts of Life", "m.0_k73bx": "The Facts of Life", "m.0g54xzv": "Hockey Sock Rock", "m.0n9cmjv": "It Takes Diff'rent Strokes", "m.0zl7d7s": "Arnold & Willy (Diff'rent Strokes)", "m.0zwh63k": "Big Wheels"}}, {"question": "what films did patrick swayze star in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02h3tp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02h3tp ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Patrick Swayze ] ) )", "golden_entities": {"m.02h3tp": "Patrick Swayze"}, "answer_entities": {"m.0_gr3lv": "Return of the Rebels", "m.01n910": "Red Dawn", "m.026z48m": "Skatetown, U.S.A.", "m.027c99q": "Waking Up in Reno", "m.02fxx9": "Point Break", "m.02pj813": "City of Joy", "m.02pm8zp": "Next of Kin", "m.02q_l_g": "Icon", "m.02qsbk5": "King Solomon's Mines", "m.032clf": "Dirty Dancing", "m.03cn85q": "Christmas in Wonderland", "m.03cv_vm": "Powder Blue", "m.03hmfjj": "Green Dragon", "m.03khj_": "To Wong Foo, Thanks for Everything! Julie Newmar", "m.03m4mm7": "Three Wishes", "m.03n7gj": "Road House", "m.03tflm": "Tall Tale", "m.04j226s": "Tiger Warsaw", "m.04j2jl7": "Along for the Ride", "m.04jlvy4": "Jump!", "m.04xnct": "Dirty Dancing: Havana Nights", "m.057jdv": "The Pacifier", "m.06bk1y": "Grandview, U.S.A.", "m.07mp6m": "Youngblood", "m.0818d7": "11:14", "m.083gcx": "Keeping Mum", "m.08bq1f": "Black Dog", "m.08cjy8": "Uncommon Valor", "m.08xxwl": "The Outsiders", "m.0bfsdy": "One Last Dance", "m.0bz3r4": "The Fox and the Hound 2", "m.0d9lb0": "Steel Dawn", "m.0fvr1": "Donnie Darko", "m.0gjs8p": "George and the Dragon", "m.0j7l8cp": "The Comeback Kid", "m.0kv750": "Father Hood", "m.0kvdhw": "Letters from a Killer", "m.0y_pg": "Ghost"}}, {"question": "where is sony headquarters", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06q07)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06q07 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Sony Corporation ] ) )", "golden_entities": {"m.06q07": "Sony Corporation"}, "answer_entities": {"m.024bqj": "Minato"}}, {"question": "what type of music is tchaikovsky", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.063tn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.063tn ns:music.artist.genre ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , genre ] ) [ Pyotr Ilyich Tchaikovsky ] )", "golden_entities": {"m.063tn": "Pyotr Ilyich Tchaikovsky"}, "answer_entities": {"m.021dvj": "Ballet", "m.05lls": "Opera", "m.06q6jz": "Art song", "m.0ggq0m": "Classical music"}}, {"question": "where did helen keller go to school", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03ppx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03ppx ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Helen Keller ] ) )", "golden_entities": {"m.03ppx": "Helen Keller"}, "answer_entities": {"m.01h4dd": "Perkins School for the Blind", "m.01k7xz": "Radcliffe College", "m.06b84v": "The Cambridge School of Weston", "m.07tr9z": "Wright-Humason School for the Deaf", "m.0bydgq": "Horace Mann School for the Deaf and Hard of Hearing"}}, {"question": "who did tupac shakur date", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07pzc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07pzc ns:base.popstra.celebrity.dated ?y .\n?y ns:base.popstra.dated.participant ?x .\n}\n", "logical_form": "( JOIN ( R [ base , popstra , dated , participant ] ) ( JOIN ( R [ base , popstra , celebrity , dated ] ) [ Tupac Shakur ] ) )", "golden_entities": {"m.07pzc": "Tupac Shakur"}, "answer_entities": {"m.01j7z7": "Jada Pinkett Smith", "m.06wpky": "Salli Richardson", "m.0dnyp2": "Kidada Jones"}}, {"question": "what did larry hagman die of", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vyv9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vyv9 ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Larry Hagman ] )", "golden_entities": {"m.01vyv9": "Larry Hagman"}, "answer_entities": {"m.0369n2": "Head and neck cancer", "m.04psf": "Leukemia", "m.0qcr0": "Cancer"}}, {"question": "what show is jill wagner on", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ch3s1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ch3s1 ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , series ] ) ( JOIN ( R [ tv , tv actor , starring roles ] ) [ Jill Wagner ] ) )", "golden_entities": {"m.0ch3s1": "Jill Wagner"}, "answer_entities": {"m.01qnwx": "Punk'd", "m.047d4bz": "Wipeout", "m.0c4htl": "Blade: The Series", "m.0fphvnc": "Teen Wolf"}}, {"question": "what currency does senegal use", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06srk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06srk ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Senegal ] )", "golden_entities": {"m.06srk": "Senegal"}, "answer_entities": {"m.025sw2q": "West African CFA franc"}}, {"question": "what do ethnic russians look like", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g6ff)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g6ff ns:people.ethnicity.included_in_group ?x .\n}\n", "logical_form": "( JOIN ( R [ people , ethnicity , included in group ] ) [ Russian ] )", "golden_entities": {"m.0g6ff": "Russian"}, "answer_entities": {"m.043_yvy": "Europeans", "m.0c54l": "East Slavs"}}, {"question": "what places made up the western roman empire", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02jbz2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02jbz2 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Western Roman Empire ] )", "golden_entities": {"m.02jbz2": "Western Roman Empire"}, "answer_entities": {"m.05g2v": "North Africa", "m.0852h": "Western Europe"}}, {"question": "what company did mitt romney run", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0271_s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0271_s ns:business.board_member.leader_of ?y .\n?y ns:organization.leadership.organization ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , leadership , organization ] ) ( JOIN ( R [ business , board member , leader of ] ) [ Mitt Romney ] ) )", "golden_entities": {"m.0271_s": "Mitt Romney"}, "answer_entities": {"m.05tl03": "Bain Capital"}}, {"question": "what is vito corleone real name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05hp_9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05hp_9 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Vito Corleone ] ) )", "golden_entities": {"m.05hp_9": "Vito Corleone"}, "answer_entities": {"m.04__f": "Marlon Brando", "m.06cgy": "Robert De Niro", "m.0nj8kct": "Oreste Baldini"}}, {"question": "where did justin bieber grew up", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06w2sn5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06w2sn5 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Justin Bieber ] )", "golden_entities": {"m.06w2sn5": "Justin Bieber"}, "answer_entities": {"m.0b1t1": "London"}}, {"question": "who drafted kevin garnett", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lm0t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lm0t ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league draft pick , team ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Kevin Garnett ] ) )", "golden_entities": {"m.02lm0t": "Kevin Garnett"}, "answer_entities": {"m.0jmgb": "Minnesota Timberwolves"}}]