[{"question": "where did jesse james die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02khkd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02khkd ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Jesse James ] )", "golden_entities": {"m.02khkd": "Jesse James"}, "answer_entities": {"m.0135p7": "Saint Joseph"}}, {"question": "what happened to sir thomas cromwell", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d05q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d05q ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Thomas Cromwell ] )", "golden_entities": {"m.0d05q": "Thomas Cromwell"}, "answer_entities": {"m.0jb19": "Decapitation"}}, {"question": "where is victoria beckham from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cgfb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cgfb ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Victoria Beckham ] )", "golden_entities": {"m.0cgfb": "Victoria Beckham"}, "answer_entities": {"m.01z26v": "Harlow"}}, {"question": "who is daniel in the bible", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cts)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cts ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Daniel ] )", "golden_entities": {"m.02cts": "Daniel"}, "answer_entities": {"m.066dv": "Prophet", "m.0cbd2": "Writer"}}, {"question": "who is jojo simmons mother", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.040j_3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.040j_3 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , parents ] ) [ Joseph Simmons ] ) )", "golden_entities": {"m.040j_3": "Joseph Simmons", "m.02zsn": "Female"}, "answer_entities": {"m.0k2yz_5": "Evelyn Simmons"}}, {"question": "what year doug williams won the super bowl", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0443ql)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0443ql ns:sports.sports_award_winner.awards ?y .\n?y ns:sports.sports_award.season ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports award , season ] ) ( JOIN ( R [ sports , sports award winner , awards ] ) [ Doug Williams ] ) )", "golden_entities": {"m.0443ql": "Doug Williams"}, "answer_entities": {"m.0790_m": "1987 NFL season"}}, {"question": "what happened to rev. robert schuller", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05vslll)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05vslll ns:people.deceased_person.date_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , date of death ] ) [ Robert H. Schuller ] )", "golden_entities": {"m.05vslll": "Robert H. Schuller"}, "answer_entities": {"value": "2015-04-02"}}, {"question": "where is located cornell university", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01w3v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01w3v ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n", "logical_form": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Cornell University ] ) )", "golden_entities": {"m.01w3v": "Cornell University"}, "answer_entities": {"m.03v_5": "Ithaca"}}, {"question": "what should i visit in venice", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_pf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_pf ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Venice ] )", "golden_entities": {"m.07_pf": "Venice"}, "answer_entities": {"m.011zyz": "Bridge of Sighs", "m.01d_55": "Saint Mark's Basilica", "m.02_ph9": "Grand Canal", "m.02173k": "Teatro La Fenice", "m.028597g": "Caff\u00e8 Florian", "m.03sp81": "San Giorgio Maggiore", "m.03vslz": "Rialto Bridge", "m.07s5md0": "Lido di Venezia", "m.0cc21s": "Palazzo Grassi", "m.0jw_d8z": "Palazzo Venier dei Leoni", "m.0pr3n": "Piazza San Marco", "m.0q41z": "Doge's Palace"}}, {"question": "where james madison was born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0424m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0424m ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ James Madison ] )", "golden_entities": {"m.0424m": "James Madison"}, "answer_entities": {"m.0dl52g": "Port Conway"}}, {"question": "where is tsonga born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027q1_3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027q1_3 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Jo-Wilfried Tsonga ] )", "golden_entities": {"m.027q1_3": "Jo-Wilfried Tsonga"}, "answer_entities": {"m.04r5c": "Le Mans"}}, {"question": "what is paige halliwell 's powers", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ymn7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ymn7 ns:fictional_universe.fictional_character.powers_or_abilities ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , fictional character , powers or abilities ] ) [ Paige Matthews ] )", "golden_entities": {"m.01ymn7": "Paige Matthews"}, "answer_entities": {"m.04kb1zt": "Orbing", "m.0fx57": "Teleportation"}}, {"question": "what city is the state capital of washington", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081yw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081yw ns:base.aareas.schema.administrative_area.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , capital ] ) [ Washington ] )", "golden_entities": {"m.081yw": "Washington"}, "answer_entities": {"m.0fw1y": "Olympia"}}, {"question": "what does shawn johnson do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.026sgt0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.026sgt0 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Shawn Johnson ] )", "golden_entities": {"m.026sgt0": "Shawn Johnson"}, "answer_entities": {"m.02hrh1q": "Actor", "m.0385k": "Gymnast", "m.0dypbr": "TV Personality"}}, {"question": "where did nadia boulanger live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cx2m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cx2m ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Nadia Boulanger ] ) )", "golden_entities": {"m.02cx2m": "Nadia Boulanger"}, "answer_entities": {"m.05qtj": "Paris"}}, {"question": "what is there to do in montpelier vt", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bjy7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bjy7 ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Montpelier ] )", "golden_entities": {"m.0bjy7": "Montpelier"}, "answer_entities": {"m.02h_zx": "Mount Mansfield", "m.03m93j1": "Fairbanks Museum and Planetarium", "m.046frb": "Vermont State House", "m.04yr22z": "Vermont Granite Museum", "m.04yr24v": "Vermont History Museum", "m.04yr3vt": "Cold Hollow Cider Mill", "m.059lxq3": "Hyde Park Opera House", "m.059m0t5": "Down To Earth Worm Farm of Vermont", "m.059m198": "Jed's Maple", "m.059qdds": "Weathered Barn Doll Museum", "m.059qdq4": "Spider Web Farm", "m.059qdvl": "Vermont Icelandic Horse Farm", "m.059qf07": "Ben & Jerry's Waterbury Factory", "m.059qf82": "Bragg Farm Sugarhouse and Gift Shop", "m.059qfky": "USS Montpelier Museum", "m.08p8jq": "Karm\u00ea Ch\u00f6ling", "m.0gsx_6": "Green Mountain Film Festival"}}, {"question": "when did michael jordan started playing basketball in the nba", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.054c1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.054c1 ns:sports.pro_athlete.career_start ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , pro athlete , career start ] ) [ Michael Jordan ] )", "golden_entities": {"m.054c1": "Michael Jordan"}, "answer_entities": {"value": "1984"}}, {"question": "in which city was president kennedy killed", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:people.deceased_person.place_of_death ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ people , deceased person , place of death ] ) [ John F. Kennedy ] ) )", "golden_entities": {"m.0d3k14": "John F. Kennedy", "m.01m9": "City/Town/Village"}, "answer_entities": {"m.0f2rq": "Dallas"}}, {"question": "what is charlie sheen 's dad 's name", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pllx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pllx ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ Charlie Sheen ] ) )", "golden_entities": {"m.01pllx": "Charlie Sheen", "m.05zppz": "Male"}, "answer_entities": {"m.0hvb2": "Martin Sheen"}}, {"question": "how much mlb teams are there", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09p14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09p14 ns:sports.sports_league.teams ?y .\n?y ns:sports.sports_league_participation.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league participation , team ] ) ( JOIN ( R [ sports , sports league , teams ] ) [ Major League Baseball ] ) )", "golden_entities": {"m.09p14": "Major League Baseball"}, "answer_entities": {"m.01d5z": "Boston Red Sox", "m.01d6g": "Baltimore Orioles", "m.01slc": "Chicago White Sox", "m.01yhm": "Cleveland Indians", "m.01yjl": "Chicago Cubs", "m.01ync": "Colorado Rockies", "m.01ypc": "Cincinnati Reds", "m.02__x": "Miami Marlins", "m.02zjfp": "Louisville Colonels", "m.03lpp_": "Washington Nationals", "m.03m1n": "Houston Astros", "m.049n7": "Kansas City Royals", "m.04mjl": "Los Angeles Dodgers", "m.04wmvz": "Los Angeles Angels of Anaheim", "m.0512p": "Minnesota Twins", "m.051vz": "Milwaukee Brewers", "m.05g76": "New York Mets", "m.05ll0s1": "Washington Senators", "m.05m_8": "Oakland Athletics", "m.05xvj": "Philadelphia Phillies", "m.061xq": "Pittsburgh Pirates", "m.06wpc": "Seattle Mariners", "m.06x68": "St. Louis Cardinals", "m.0713r": "San Francisco Giants", "m.07147": "San Diego Padres", "m.07l4z": "Toronto Blue Jays", "m.07l8f": "Tampa Bay Rays", "m.07l8x": "Texas Rangers", "m.08k7gx": "Latino Legends Team", "m.0cqt41": "New York Yankees", "m.0x0d": "Arizona Diamondbacks", "m.0x2p": "Atlanta Braves"}}, {"question": "what sport do the harlem globetrotters play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lwc3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lwc3 ns:sports.sports_team.sport ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , sport ] ) [ Harlem Globetrotters ] )", "golden_entities": {"m.01lwc3": "Harlem Globetrotters"}, "answer_entities": {"m.018w8": "Basketball"}}, {"question": "where is poe buried now", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lt8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lt8 ns:people.deceased_person.place_of_burial ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Edgar Allan Poe ] )", "golden_entities": {"m.02lt8": "Edgar Allan Poe"}, "answer_entities": {"m.04jlwk": "Westminster Hall and Burying Ground"}}, {"question": "where is danish located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k6nt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k6nt ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Denmark ] )", "golden_entities": {"m.0k6nt": "Denmark"}, "answer_entities": {"m.02j9z": "Europe"}}, {"question": "who started mary kay", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05d8vj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05d8vj ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ Mary Kay ] )", "golden_entities": {"m.05d8vj": "Mary Kay"}, "answer_entities": {"m.02crtt": "Mary Kay Ash"}}, {"question": "in which continent is russia", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bnz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bnz ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Russia ] )", "golden_entities": {"m.06bnz": "Russia"}, "answer_entities": {"m.02j9z": "Europe"}}, {"question": "what to do in ottawa ontario today", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05ksh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05ksh ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Ottawa ] )", "golden_entities": {"m.05ksh": "Ottawa"}, "answer_entities": {"m.01kw4z": "Canadian War Museum", "m.01q67r": "Rideau Hall", "m.0266k_": "Canadian Museum of Nature", "m.02g7cm": "National Gallery of Canada", "m.02pv10j": "Nepean Museum", "m.02r8kj8": "Centrepointe Theatre", "m.039613": "Canadian Museum of Contemporary Photography", "m.03963z": "Canada Agriculture Museum", "m.03966d": "Canada Aviation and Space Museum", "m.03cymk3": "Canadian Ski Museum", "m.03q4gx": "CFS Carp", "m.042wft": "Canada Science and Technology Museum", "m.06zntx5": "Currency Museum", "m.07_hr6": "Bytown Museum", "m.0826cd": "Billings Estate Museum", "m.09rvcx": "Logos Land"}}, {"question": "where did paul ryan live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.024v2j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.024v2j ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Paul Ryan ] ) )", "golden_entities": {"m.024v2j": "Paul Ryan"}, "answer_entities": {"m.01mm_c": "Janesville"}}, {"question": "what is the australian open called", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05ftlg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05ftlg ns:type.object.name ?x .\n}\n", "logical_form": "( JOIN ( R [ type , object , name ] ) [ Australian Open ] )", "golden_entities": {"m.05ftlg": "Australian Open"}, "answer_entities": {"value": "Australian Open"}}, {"question": "where is angola located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j4b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j4b ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Angola ] )", "golden_entities": {"m.0j4b": "Angola"}, "answer_entities": {"m.0dg3n1": "Africa"}}, {"question": "what is tibetan language", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kbrp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kbrp ns:language.language_writing_system.languages ?x .\n}\n", "logical_form": "( JOIN ( R [ language , language writing system , languages ] ) [ Tibetan alphabet ] )", "golden_entities": {"m.01kbrp": "Tibetan alphabet"}, "answer_entities": {"m.0148c4": "Mongolian language", "m.020gly": "Dzongkha Language", "m.02hwtv6": "Tangut", "m.02hx1d8": "Khengkha Language", "m.02hx1h3": "Tshangla Language", "m.02hx1pw": "Kurt\u00f6p language", "m.02hxp6w": "Gongduk Language", "m.02m3bw": "Balti Language", "m.03dh42": "Ladakhi Language", "m.04tcky": "Tawang language", "m.05fb9dg": "Amdo Tibetan", "m.064r7fk": "Standard Tibetan", "m.08g721": "Khams Tibetan", "m.095gcr": "Gurung language", "m.095hnm": "Tamang language", "m.09g_ln": "Sikkimese Language"}}, {"question": "when did maria sharapova start playing tennis", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03b7gw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03b7gw ns:tennis.tennis_player.year_turned_pro ?x .\n}\n", "logical_form": "( JOIN ( R [ tennis , tennis player , year turned pro ] ) [ Maria Sharapova ] )", "golden_entities": {"m.03b7gw": "Maria Sharapova"}, "answer_entities": {"value": "2001-04-19"}}, {"question": "what is the capital of oregon", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05kj_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05kj_ ns:base.aareas.schema.administrative_area.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ base , aareas , schema , administrative area , capital ] ) [ Oregon ] )", "golden_entities": {"m.05kj_": "Oregon"}, "answer_entities": {"m.0d23k": "Salem"}}, {"question": "what teams did shaq play 4", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012xdf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012xdf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Shaquille O'Neal ] ) )", "golden_entities": {"m.012xdf": "Shaquille O'Neal"}, "answer_entities": {"m.026dqjm": "LSU Tigers men's basketball", "m.0bwjj": "Boston Celtics", "m.0jm2v": "Miami Heat", "m.0jm4b": "Orlando Magic", "m.0jm7n": "Cleveland Cavaliers", "m.0jmk7": "Los Angeles Lakers", "m.0jml5": "Phoenix Suns"}}, {"question": "where did andreas vesalius die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07zk5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07zk5 ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Andreas Vesalius ] )", "golden_entities": {"m.07zk5": "Andreas Vesalius"}, "answer_entities": {"m.01t0n2": "Zakynthos Island"}}, {"question": "what color are the arizona cardinals uniforms", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ws7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ws7 ns:sports.sports_team.colors ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , colors ] ) [ Arizona Cardinals ] )", "golden_entities": {"m.0ws7": "Arizona Cardinals"}, "answer_entities": {"m.019sc": "Black", "m.03wkwg": "Cardinal", "m.083jv": "White"}}, {"question": "where was emperor qin shi huang born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pf00)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pf00 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Qin Shi Huang ] )", "golden_entities": {"m.0pf00": "Qin Shi Huang"}, "answer_entities": {"m.04xtcd": "Handan"}}, {"question": "which country does irish language come from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03x42)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03x42 ns:language.human_language.main_country ?x .\n}\n", "logical_form": "( JOIN ( R [ language , human language , main country ] ) [ Irish ] )", "golden_entities": {"m.03x42": "Irish"}, "answer_entities": {"m.03rt9": "Republic of Ireland"}}, {"question": "what did the harlem renaissance created", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019y_2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019y_2 ns:book.book_subject.works ?x .\n}\n", "logical_form": "( JOIN ( R [ book , book subject , works ] ) [ Harlem Renaissance ] )", "golden_entities": {"m.019y_2": "Harlem Renaissance"}, "answer_entities": {"m.0bm0crh": "Harlem Renaissance Way Down South", "m.0bvbrrh": "The Life, Times, and Legacies of Lena Horne Special Feature Parts 1 and 2", "m.0g98xzj": "The Wisdom of W.E.B. Du Bois", "m.0gw8fc1": "The Approaching 100th Anniversary of the Harlem Renaissance (part 2)", "m.0gxmy6l": "Harlem Renaissance Dialogues (part 4): Kareem Abdul-Jabbar and Giants of the Renaissance", "m.0gxmyjk": "Harlem Renaissance Dialogues (part 3): A Poet Rediscovered in The Great Debaters", "m.0gxmyk3": "Harlem Renaissance Dialogues (part 5): The Need to Know and the Value of Legacy", "m.0gxnkj8": "Harlem Renaissance Dialogues (Part 1): Living and Writing Black History", "m.0gxnksh": "Harlem Renaissance Dialogues (Part 2): Savannah and the Harlem Renaissance", "m.0gxq34z": "Harlem Renaissance Dialogues (Part 6): Publishing Trends and Modern Readers", "m.0gxq399": "Harlem Renaissance Dialogues (Part 7): The Renaissance and Contemporary Issues", "m.0h2x8v6": "Looking at the World through Michael Jackson's Left Eye (Part 2)", "m.0hgc8tl": "Songs of My People Art Exhibition Opens at Penn Center", "m.0hnx0cj": "Countdown of 10 Amazing Moments from the Year 2011: No. 6 Sonny Rollins", "m.0hpxc1b": "On the Shoulders of Giants: My Journey Through the Harlem Rennaissance", "m.0pxynmm": "The Young Poet and the Painter", "m.0z842cv": "Text and Meaning in Langston Hughes' The Negro Artist and the Racial Mountain"}}, {"question": "where did mendeleev died", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gglj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gglj ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ Dmitri Mendeleev ] )", "golden_entities": {"m.0gglj": "Dmitri Mendeleev"}, "answer_entities": {"m.06pr6": "Saint Petersburg"}}, {"question": "what language did ancient romans write in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06cmp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06cmp ns:fictional_universe.fictional_setting.languages ?x .\n}\n", "logical_form": "( JOIN ( R [ fictional universe , fictional setting , languages ] ) [ Roman Empire ] )", "golden_entities": {"m.06cmp": "Roman Empire"}, "answer_entities": {"m.0349s": "Greek Language", "m.04h9h": "Latin Language"}}, {"question": "what religion did jesus christ follow", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045m1_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.045m1_ ns:people.person.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , religion ] ) [ Jesus Christ ] )", "golden_entities": {"m.045m1_": "Jesus Christ"}, "answer_entities": {"m.03_gx": "Judaism"}}, {"question": "what year was tom brady drafted", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xyt7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xyt7 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Tom Brady ] ) )", "golden_entities": {"m.01xyt7": "Tom Brady"}, "answer_entities": {"m.09gmxd": "1999 NFL draft"}}, {"question": "what party is bloomberg affiliated with", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09pfj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09pfj ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n", "logical_form": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Michael Bloomberg ] ) )", "golden_entities": {"m.09pfj": "Michael Bloomberg"}, "answer_entities": {"m.075qbd2": "Independent", "m.07wbk": "Republican Party", "m.0d075m": "Democratic Party"}}, {"question": "where does t boone pickens live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05jyjn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05jyjn ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ T. Boone Pickens ] ) )", "golden_entities": {"m.05jyjn": "T. Boone Pickens"}, "answer_entities": {"m.05mph": "Oklahoma"}}, {"question": "when did the mets win the pennant", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g76)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g76 ns:sports.sports_team.championships ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , championships ] ) [ New York Mets ] )", "golden_entities": {"m.05g76": "New York Mets"}, "answer_entities": {"m.01q9lc": "1986 World Series", "m.04jg9_": "1969 World Series"}}, {"question": "where was saint paul from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.060nc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.060nc ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Paul the Apostle ] )", "golden_entities": {"m.060nc": "Paul the Apostle"}, "answer_entities": {"m.03kcs9": "Tarsus"}}, {"question": "what is the capital city of germany now", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0345h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0345h ns:location.country.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , capital ] ) [ Germany ] )", "golden_entities": {"m.0345h": "Germany"}, "answer_entities": {"m.0156q": "Berlin"}}, {"question": "what continent is syria located in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06vbd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06vbd ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Syria ] )", "golden_entities": {"m.06vbd": "Syria"}, "answer_entities": {"m.0j0k": "Asia"}}, {"question": "what events does stephanie rice compete in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c1qx3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c1qx3 ns:olympics.olympic_athlete.medals_won ?y .\n?y ns:olympics.olympic_medal_honor.event ?x .\n}\n", "logical_form": "( JOIN ( R [ olympics , olympic medal honor , event ] ) ( JOIN ( R [ olympics , olympic athlete , medals won ] ) [ Stephanie Rice ] ) )", "golden_entities": {"m.0c1qx3": "Stephanie Rice"}, "answer_entities": {"m.04f4q5m": "Swimming at the 2008 Summer Olympics \u2013 Women's 4 \u00d7 200 metre freestyle relay", "m.04g7f4g": "Swimming at the 2008 Summer Olympics - Women's 400 metre Individual Medley", "m.04g7f54": "Swimming at the 2008 Summer Olympics - Women's 200 metre Individual Medley", "m.0hzrq23": "Swimming at the 2012 Summer Olympics \u2013 Women's 400 metre individual medley"}}, {"question": "where did charlton heston live", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chsq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chsq ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n", "logical_form": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Charlton Heston ] ) )", "golden_entities": {"m.0chsq": "Charlton Heston"}, "answer_entities": {"m.030qb3t": "Los Angeles", "m.0psxp": "Evanston", "m.0s5tn": "Wilmette", "m.0vnvs": "St. Helen"}}, {"question": "where did hurricane irene", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02p70bg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02p70bg ns:meteorology.tropical_cyclone.affected_areas ?x .\n}\n", "logical_form": "( JOIN ( R [ meteorology , tropical cyclone , affected areas ] ) [ Hurricane Irene ] )", "golden_entities": {"m.02p70bg": "Hurricane Irene"}, "answer_entities": {"m.0157g9": "Lesser Antilles", "m.0160w": "Bahamas", "m.01rll_": "Greater Antilles", "m.01x73": "Connecticut", "m.027rn": "Dominican Republic", "m.02jwvm": "Eastern United States", "m.059rby": "New York", "m.05fjf": "New Jersey", "m.05fkf": "North Carolina", "m.05r7t": "Puerto Rico", "m.0684cc": "Eastern Canada", "m.07fr_": "Turks and Caicos Islands"}}]