[{"question": "what did charles babbage make", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01qmz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01qmz ns:base.argumentmaps.innovator.original_ideas ?x .\n}\n", "logical_form": "( JOIN ( R [ base , argumentmaps , innovator , original ideas ] ) [ Charles Babbage ] )", "golden_entities": {"m.01qmz": "Charles Babbage"}, "answer_entities": {"m.0nf_": "Analytical Engine"}}, {"question": "who played lt uhura", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012gkt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012gkt ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Uhura ] ) )", "golden_entities": {"m.012gkt": "Uhura"}, "answer_entities": {"m.012gl8": "Nichelle Nichols", "m.05qg6g": "Zoe Saldana"}}, {"question": "where is the french alps located", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03tmzj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03tmzj ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ French Alps ] )", "golden_entities": {"m.03tmzj": "French Alps"}, "answer_entities": {"m.0f8l9c": "France", "m.0lcd": "Alps"}}, {"question": "what year was peyton manning 's rookie year", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027jv8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027jv8 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Peyton Manning ] ) )", "golden_entities": {"m.027jv8": "Peyton Manning"}, "answer_entities": {"m.09gmwc": "1998 NFL draft"}}, {"question": "what kind of guitar does lindsey buckingham play", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.094wr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.094wr ns:music.group_member.instruments_played ?x .\n?x ns:music.instrument.family ns:m.0342h .\n}\n", "logical_form": "( AND ( JOIN [ music , instrument , family ] [ Guitar ] ) ( JOIN ( R [ music , group member , instruments played ] ) [ Lindsey Buckingham ] ) )", "golden_entities": {"m.094wr": "Lindsey Buckingham", "m.0342h": "Guitar"}, "answer_entities": {"m.018vs": "Bass guitar"}}, {"question": "what college did joe namath attend", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p_3k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p_3k ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n", "logical_form": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Joe Namath ] ) )", "golden_entities": {"m.01p_3k": "Joe Namath"}, "answer_entities": {"m.01wdl3": "University of Alabama"}}, {"question": "what county is duluth minnesota in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h1k6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h1k6 ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Duluth ] )", "golden_entities": {"m.0h1k6": "Duluth"}, "answer_entities": {"m.0nh1v": "St. Louis County"}}, {"question": "what did andrew johnson die from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rmg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rmg ns:people.deceased_person.cause_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Andrew Johnson ] )", "golden_entities": {"m.0rmg": "Andrew Johnson"}, "answer_entities": {"m.02y0js": "Stroke"}}, {"question": "what is janelle monae famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gktwr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gktwr ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Janelle Monae ] )", "golden_entities": {"m.0gktwr": "Janelle Monae"}, "answer_entities": {"m.016z4k": "Singer-songwriter", "m.01c72t": "Composer", "m.01xr66": "Spokesperson", "m.02h6p92": "Dancer", "m.09jwl": "Musician", "m.09l65": "Singer", "m.0d1pc": "Model", "m.0dz3r": "Record producer", "m.0fq0t_c": "Music artist", "m.0n1h": "Artist", "m.0nbcg": "Songwriter"}}, {"question": "what continent is mexico located on", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b90_r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b90_r ns:base.locations.countries.continent ?x .\n}\n", "logical_form": "( JOIN ( R [ base , locations , countries , continent ] ) [ Mexico ] )", "golden_entities": {"m.0b90_r": "Mexico"}, "answer_entities": {"m.059g4": "North America"}}, {"question": "what does time warner own", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0l8sx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0l8sx ns:broadcast.tv_station_owner.tv_stations ?x .\n}\n", "logical_form": "( JOIN ( R [ broadcast , tv station owner , tv stations ] ) [ Time Warner ] )", "golden_entities": {"m.0l8sx": "Time Warner"}, "answer_entities": {"m.09c2xk": "WPCH-TV"}}, {"question": "where was anne hathaway born", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vntj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vntj ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Anne Hathaway ] )", "golden_entities": {"m.02vntj": "Anne Hathaway"}, "answer_entities": {"m.0cr3d": "Brooklyn"}}, {"question": "who started twa airlines", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.013w80)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.013w80 ns:organization.organization.founders ?x .\n}\n", "logical_form": "( JOIN ( R [ organization , organization , founders ] ) [ Trans World Airlines ] )", "golden_entities": {"m.013w80": "Trans World Airlines"}, "answer_entities": {"m.03n93": "Howard Hughes"}}, {"question": "what are the two dialects of chinese", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r2l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r2l ns:language.human_language.dialects ?x .\n}\n", "logical_form": "( JOIN ( R [ language , human language , dialects ] ) [ Chinese language ] )", "golden_entities": {"m.01r2l": "Chinese language"}, "answer_entities": {"m.0653m": "Standard Chinese", "m.0bpygy": "Qingtian dialect"}}, {"question": "what state in chicago in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_d4 ns:base.biblioness.bibs_location.state ?x .\n}\n", "logical_form": "( JOIN ( R [ base , biblioness , bibs location , state ] ) [ Chicago ] )", "golden_entities": {"m.01_d4": "Chicago"}, "answer_entities": {"m.03v0t": "Illinois"}}, {"question": "who wrote luke bryan 's drunk on you", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j625w_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j625w_ ns:music.composition.composer ?x .\n}\n", "logical_form": "( JOIN ( R [ music , composition , composer ] ) [ Drunk on You ] )", "golden_entities": {"m.0j625w_": "Drunk on You"}, "answer_entities": {"m.02qk17r": "Josh Kear", "m.05chlcv": "Chris Tompkins", "m.05cxfgy": "Rodney Clawson"}}, {"question": "what boudicca do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01fz6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01fz6 ns:common.topic.notable_types ?x .\n}\n", "logical_form": "( JOIN ( R [ common , topic , notable types ] ) [ Boudica ] )", "golden_entities": {"m.01fz6": "Boudica"}, "answer_entities": {"m.02h77nv": "Military Commander"}}, {"question": "where did sir john a macdonald die", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.041rh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.041rh ns:people.deceased_person.place_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , place of death ] ) [ John A. Macdonald ] )", "golden_entities": {"m.041rh": "John A. Macdonald"}, "answer_entities": {"m.05ksh": "Ottawa"}}, {"question": "what is south korea 's capital city", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06qd3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06qd3 ns:location.country.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , capital ] ) [ South Korea ] )", "golden_entities": {"m.06qd3": "South Korea"}, "answer_entities": {"m.0hsqf": "Seoul"}}, {"question": "what is the currency in the republic of congo", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01rxw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01rxw ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Congo ] )", "golden_entities": {"m.01rxw": "Congo"}, "answer_entities": {"m.025sw2b": "Central African CFA franc"}}, {"question": "what country did giovanni da verrazano represent", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k6d2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k6d2 ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Giovanni da Verrazzano ] )", "golden_entities": {"m.0k6d2": "Giovanni da Verrazzano"}, "answer_entities": {"m.03rjj": "Italy"}}, {"question": "when was saint nicholas died", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f9q7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f9q7 ns:people.deceased_person.date_of_death ?x .\n}\n", "logical_form": "( JOIN ( R [ people , deceased person , date of death ] ) [ Saint Nicholas ] )", "golden_entities": {"m.0f9q7": "Saint Nicholas"}, "answer_entities": {"value": "0343-12-06"}}, {"question": "what city is the jacksonville jaguars from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043vc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043vc ns:sports.sports_team.location ?x .\n}\n", "logical_form": "( JOIN ( R [ sports , sports team , location ] ) [ Jacksonville Jaguars ] )", "golden_entities": {"m.043vc": "Jacksonville Jaguars"}, "answer_entities": {"m.0ggh3": "Jacksonville"}}, {"question": "where is the time zone in florida", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02xry)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02xry ns:location.location.time_zones ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , time zones ] ) [ Florida ] )", "golden_entities": {"m.02xry": "Florida"}, "answer_entities": {"m.02_37z": "UTC\u221205:00", "m.02fqwt": "Central Time Zone", "m.02hcv8": "Eastern Time Zone"}}, {"question": "what county is clearwater fl in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rqyx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rqyx ns:location.hud_county_place.county ?x .\n}\n", "logical_form": "( JOIN ( R [ location , hud county place , county ] ) [ Clearwater ] )", "golden_entities": {"m.0rqyx": "Clearwater"}, "answer_entities": {"m.0jxgx": "Pinellas County"}}, {"question": "what is the laguna beach theme song", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.048wfw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.048wfw ns:tv.tv_program.theme_song ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , tv program , theme song ] ) [ Laguna Beach: The Real Orange County ] )", "golden_entities": {"m.048wfw": "Laguna Beach: The Real Orange County"}, "answer_entities": {"m.07fprn": "Come Clean"}}, {"question": "what is thomas edison 's most famous for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07bty)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07bty ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Thomas Edison ] )", "golden_entities": {"m.07bty": "Thomas Edison"}, "answer_entities": {"m.012t_z": "Businessperson", "m.01d_h8": "Film Producer", "m.02jknp": "Film director", "m.03sbb": "Inventor", "m.06q2q": "Scientist", "m.09x_r": "Entrepreneur"}}, {"question": "what does jennifer lopez do", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043zg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043zg ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Jennifer Lopez ] )", "golden_entities": {"m.043zg": "Jennifer Lopez"}, "answer_entities": {"m.012t_z": "Businessperson", "m.015cjr": "Presenter", "m.0164xg": "Philanthropist", "m.01d_h8": "Film Producer", "m.02h6n_q": "Choreographer", "m.02h6nmf": "Entertainer", "m.02h6p92": "Dancer", "m.02hqyhw": "Fashion designer", "m.02hrh1q": "Actor", "m.03gjzk": "Television producer", "m.043tvhw": "Perfumer", "m.04l1gwb": "Film Score Composer", "m.064xm0": "Music Video Director", "m.09l65": "Singer", "m.09x_r": "Entrepreneur", "m.0dz3r": "Record producer", "m.0nbcg": "Songwriter", "m.0np9r": "Voice Actor"}}, {"question": "what is the capital city of west germany", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.082fr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.082fr ns:location.country.capital ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , capital ] ) [ West Germany ] )", "golden_entities": {"m.082fr": "West Germany"}, "answer_entities": {"m.0150n": "Bonn"}}, {"question": "when did herman cain run for president", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05972y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05972y ns:government.politician.election_campaigns ?x .\n}\n", "logical_form": "( JOIN ( R [ government , politician , election campaigns ] ) [ Herman Cain ] )", "golden_entities": {"m.05972y": "Herman Cain"}, "answer_entities": {"m.0g5q039": "Herman Cain presidential campaign, 2012"}}, {"question": "what movies has selena gomez starred in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gs6vr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gs6vr ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Selena Gomez ] ) )", "golden_entities": {"m.0gs6vr": "Selena Gomez"}, "answer_entities": {"g.11b6y9tkn4": "The Revised Fundamentals of Caregiving", "g.11b7k0v3hq": "In Dubious Battle", "m.0118fw_v": "Hotel Transylvania 2", "m.025s1wg": "Spy Kids 3-D: Game Over", "m.026ykxv": "Arwin!", "m.03h2kkl": "Another Cinderella Story", "m.03y7209": "Princess Protection Program", "m.05mxz8m": "Wizards of Waverly Place: The Movie", "m.05zs3tp": "Ramona and Beezus", "m.064qvcw": "Wizards on Deck with Hannah Montana", "m.07kb79v": "Arthur and the Revenge of Maltazard", "m.07xgs84": "Arthur 3: The War of the Two Worlds", "m.0cr_ypd": "Walker, Texas Ranger: Trial by Fire", "m.0d8n8lx": "Monte Carlo", "m.0ds5_72": "The Muppets", "m.0fk25m": "Horton Hears a Who!", "m.0gj96ln": "Hotel Transylvania", "m.0hr256b": "Spring Breakers", "m.0j_5r7f": "Aftershock", "m.0jt0y88": "Getaway", "m.0jt6hrm": "Pilot Season", "m.0nfcm4h": "The Wizards Return: Alex vs. Alex", "m.0nfvql0": "Behaving Badly", "m.0vpj6d0": "Rudderless", "m.0w03mr4": "Fifty Shades of Blue", "m.0w03ph7": "Gossip with the Girls", "m.0w03qlw": "Fashionista's Fantasy", "m.0w03r9y": "A Jet-Setters Dream", "m.0ydw9bg": "Barney: Please & Thank You"}}, {"question": "what movies has angelina jolie in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f4vbz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f4vbz ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Angelina Jolie ] ) )", "golden_entities": {"m.0f4vbz": "Angelina Jolie"}, "answer_entities": {"m.011q46b6": "By the Sea", "m.01n4z6": "Hackers", "m.01qbg5": "Gia", "m.01xbxn": "Shark Tale", "m.0279ltv": "Hell's Kitchen", "m.0287477": "Wanted", "m.0292qb": "Lara Croft Tomb Raider: The Cradle of Life", "m.02qr69m": "Changeling", "m.02vjp3": "Sky Captain and the World of Tomorrow", "m.02z9fb": "Beyond Borders", "m.03b92p": "Taking Lives", "m.03ljpk": "Gone in 60 Seconds", "m.03nfc4": "Foxfire", "m.03qcvl": "Playing by Heart", "m.03z9585": "The Tourist", "m.049mql": "Alexander", "m.04dr_8_": "Confessions of an Action Star", "m.04j1wmp": "True Women", "m.04lhqsh": "The Fever", "m.04z92b": "Pushing Tin", "m.05pbl56": "Salt", "m.05ppy": "Original Sin", "m.05sns6": "Mr. & Mrs. Smith", "m.06fwns": "The Bone Collector", "m.06ztvyx": "Kung Fu Panda 2", "m.07nxnw": "Beowulf", "m.07nxvj": "The Good Shepherd", "m.089c83": "Life or Something Like It", "m.09146g": "Kung Fu Panda", "m.098s2w": "Girl, Interrupted", "m.09hj66": "George Wallace", "m.09wwx0": "The Thomas Crown Affair 2", "m.0bhj5f": "Without Evidence", "m.0bnx59": "Love Is All There Is", "m.0by4yw": "Lookin' to Get Out", "m.0by4zy": "Cyborg 2", "m.0c03gcc": "Kung Fu Panda 3", "m.0d6_s": "Lara Croft: Tomb Raider", "m.0fgm_l": "A Mighty Heart", "m.0fq0q4y": "Kung Fu Panda Holiday", "m.0gd1d1": "Mojave Moon", "m.0gg285": "Playing God", "m.0gwssc4": "Cleopatra", "m.0gwssls": "Alice & Viril", "m.0gwssm9": "Angela & Viril", "m.0hr6gzw": "Kung Fu Panda: Secrets of the Masters", "m.0k0tq97": "Maleficent", "m.0w17ngp": "Salt 2", "m.0xnl4mm": "Valencia: The Movie/S"}}, {"question": "what country christopher columbus from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pwz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pwz ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Christopher Columbus ] )", "golden_entities": {"m.01pwz": "Christopher Columbus"}, "answer_entities": {"m.02q14r": "Republic of Genoa"}}, {"question": "who was michael j fox", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hz_1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hz_1 ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Michael J. Fox ] )", "golden_entities": {"m.0hz_1": "Michael J. Fox"}, "answer_entities": {"m.01d_h8": "Film Producer", "m.02hrh1q": "Actor", "m.03gjzk": "Television producer", "m.0kyk": "Author", "m.0np9r": "Voice Actor"}}, {"question": "what movies did jenna dewan play in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ck1l0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ck1l0 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n", "logical_form": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Jenna Dewan ] ) )", "golden_entities": {"m.0ck1l0": "Jenna Dewan"}, "answer_entities": {"m.01h3y_": "The Hot Chick", "m.02z12dc": "Waterborne", "m.047fjvq": "The Six Wives of Henry Lefay", "m.04gh5vv": "Fab Five: The Texas Cheerleader Scandal", "m.05c2tnq": "American Virgin", "m.05p5j8t": "Slightly Single in L.A.", "m.08_pq1": "The Grudge 2", "m.09vw4f_": "The Legend of Hell's Gate: An American Conspiracy", "m.0b_ztfh": "Balls to the Wall", "m.0b73wst": "Step Up", "m.0bwjrf5": "Love Lies Bleeding", "m.0c1_1c": "Take the Lead", "m.0crtsl8": "Falling Awake", "m.0fq33vs": "10 Years", "m.0g4zbk": "Tamara", "m.0gty278": "Setup", "m.0h2cvd1": "The Jerk Theory"}}, {"question": "what is father name of salman khan", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01s0l0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01s0l0 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n", "logical_form": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ Salman Khan ] ) )", "golden_entities": {"m.01s0l0": "Salman Khan", "m.05zppz": "Male"}, "answer_entities": {"m.07pwhm": "Salim Khan"}}, {"question": "where is shawn johnson gymnast from", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.026sgt0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.026sgt0 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Shawn Johnson ] )", "golden_entities": {"m.026sgt0": "Shawn Johnson"}, "answer_entities": {"m.02j3w": "Des Moines"}}, {"question": "what kind of money does the ivory coast use", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fv4v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fv4v ns:location.country.currency_used ?x .\n}\n", "logical_form": "( JOIN ( R [ location , country , currency used ] ) [ Ivory Coast ] )", "golden_entities": {"m.0fv4v": "Ivory Coast"}, "answer_entities": {"m.025sw2q": "West African CFA franc"}}, {"question": "where is roger federer from sui", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01my95)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01my95 ns:people.person.place_of_birth ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , place of birth ] ) [ Roger Federer ] )", "golden_entities": {"m.01my95": "Roger Federer"}, "answer_entities": {"m.01k4f": "Basel"}}, {"question": "what is michael buble 's style of music", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02xkkq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02xkkq ns:music.artist.genre ?x .\n}\n", "logical_form": "( JOIN ( R [ music , artist , genre ] ) [ Michael Bubl\u00e9 ] )", "golden_entities": {"m.02xkkq": "Michael Bubl\u00e9"}, "answer_entities": {"m.0155w": "Blues", "m.015y_n": "Swing music", "m.0161rf": "Easy listening", "m.02dsz1": "Lounge music", "m.02k_kn": "Soft rock", "m.02qdgx": "Blue-eyed soul", "m.02vjzr": "Adult contemporary music", "m.03_d0": "Jazz", "m.05bt6j": "Pop rock", "m.064t9": "Pop music", "m.0h08p": "Big Band", "m.0m40d": "Traditional pop music", "m.0y4f8": "Vocal music"}}, {"question": "what did skinner believe", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01jv4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01jv4 ns:people.person.religion ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , religion ] ) [ B. F. Skinner ] )", "golden_entities": {"m.01jv4": "B. F. Skinner"}, "answer_entities": {"m.0kpl": "Atheism"}}, {"question": "what is the zip code for inglewood california", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0r0f7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0r0f7 ns:location.citytown.postal_codes ?x .\n}\n", "logical_form": "( JOIN ( R [ location , citytown , postal codes ] ) [ Inglewood ] )", "golden_entities": {"m.0r0f7": "Inglewood"}, "answer_entities": {"m.01zg2_k": "90302", "m.01zg2t2": "90304", "m.01zg2ty": "90301", "m.01zg2vs": "90303", "m.01zg30c": "90305", "m.01zg5dc": "90311", "m.07nq3_6": "90308", "m.07nq3_f": "90306", "m.07nq3z_": "90309", "m.07nq3zk": "90312", "m.07nq3zs": "90310", "m.07tn95v": "90307"}}, {"question": "what made roald dahl famous", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ff2k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ff2k ns:people.person.profession ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , profession ] ) [ Roald Dahl ] )", "golden_entities": {"m.0ff2k": "Roald Dahl"}, "answer_entities": {"m.02xhgwq": "Novelist", "m.05z96": "Poet", "m.0cbd2": "Writer", "m.0dxtg": "Screenwriter", "m.0kyk": "Author"}}, {"question": "what country did ponce de leon live in", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0123f1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0123f1 ns:people.person.nationality ?x .\n}\n", "logical_form": "( JOIN ( R [ people , person , nationality ] ) [ Juan Ponce de Le\u00f3n ] )", "golden_entities": {"m.0123f1": "Juan Ponce de Le\u00f3n"}, "answer_entities": {"m.06mkj": "Spain"}}, {"question": "what does the name austin stand for", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0vzm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0vzm ns:symbols.namesake.named_after ?x .\n}\n", "logical_form": "( JOIN ( R [ symbols , namesake , named after ] ) [ Austin ] )", "golden_entities": {"m.0vzm": "Austin"}, "answer_entities": {"m.0hhsw": "Stephen F. Austin"}}, {"question": "what to do today in birmingham uk", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k33p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k33p ns:travel.travel_destination.tourist_attractions ?x .\n}\n", "logical_form": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Birmingham ] )", "golden_entities": {"m.0k33p": "Birmingham"}, "answer_entities": {"m.01ynw8": "Birmingham Museum and Art Gallery", "m.021qw_": "National Exhibition Centre", "m.02v6xh": "Millennium Point", "m.02z8kp": "Thinktank, Birmingham Science Museum", "m.0374rv": "Aston Hall", "m.04y0c7": "Cadbury World", "m.05crkh": "Blakesley Hall", "m.063cph": "Sarehole Mill", "m.07_4t5": "Birmingham Wildlife Conservation Park", "m.07tpyx": "Edgbaston Cricket Ground", "m.0g9yjs_": "Flatpack Film Festival", "m.0gvrs63": "Great Birmingham Run"}}, {"question": "what show does tamera mowry play on", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.075kfb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.075kfb ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n", "logical_form": "( JOIN ( R [ tv , regular tv appearance , series ] ) ( JOIN ( R [ tv , tv actor , starring roles ] ) [ Tamera Mowry ] ) )", "golden_entities": {"m.075kfb": "Tamera Mowry"}, "answer_entities": {"m.02rr9jc": "Detention", "m.04xrnb": "Strong Medicine", "m.05h2jn_": "Roommates", "m.0706t_": "Sister, Sister", "m.08l81_": "The Look for Less", "m.08lsjw": "The Adventures of Hyperman"}}, {"question": "what college is in greeley colorado", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rczx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rczx ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n}\n", "logical_form": "( AND ( JOIN [ common , topic , notable types ] [ College/University ] ) ( JOIN ( R [ location , location , contains ] ) [ Greeley ] ) )", "golden_entities": {"m.0rczx": "Greeley", "m.01y2hnl": "College/University"}, "answer_entities": {"m.01_k7f": "University of Northern Colorado", "m.0407qbq": "Aims Community College", "m.0clw8vv": "Academy of Natural Therapy"}}, {"question": "what countries does the niger river flow through", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05csx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05csx ns:geography.river.basin_countries ?x .\n}\n", "logical_form": "( JOIN ( R [ geography , river , basin countries ] ) [ Niger River ] )", "golden_entities": {"m.05csx": "Niger River"}, "answer_entities": {"m.0164v": "Benin", "m.03676": "Guinea", "m.04v09": "Mali", "m.05cc1": "Niger", "m.05cgv": "Nigeria"}}, {"question": "where is pyramids located in egypt", "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jmj1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jmj1 ns:location.location.containedby ?x .\n}\n", "logical_form": "( JOIN ( R [ location , location , containedby ] ) [ Egyptian pyramids ] )", "golden_entities": {"m.03jmj1": "Egyptian pyramids"}, "answer_entities": {"m.02k54": "Egypt"}}]